{"company_info": {"Company Description": "cmts is engaged in the data entry outsourcing and supply of skilled/semi skilled &amp; unskilled Manpower across the industry spectrum. Our pool of manpower ranges from professionals such as Sales &amp; technical professionals in different categories, IT professionals, aviation sector, technical profiles, engineers, non-technical in-house professionals, administrative profiles, Accountant, HR, Back office, Data Entry Operator etc. Our organization's goal is total clients satisfaction through quality and personalized delivery of each and every service. We therefore exist to cater the need of these prospecting employers/companies since our inception in 2008.", "Email": "hr@cmts.in", "Company Name": "CMTS (Core Management &amp; Technical Services)", "Telephone": "9631857963"}, "api_data": {"job_location": ["Ludhiana"], "jd_id": "5922081", "job_keywords": ["Travel support Executive", "  Travel executive at saanewaal location"], "job_industry": "Travel / Tourism", "company_name": "CMTS (Core Management & Technical Services)", "job_experience": "2 to 4 Yrs", "job_title": "Travel support Executive, Travel executive at saanewaal location"}, "other_details": {"Other Skills:": ["Travel support Executive", "Travel executive at saanewaal location"], "Industry:": ["Travel / Tourism"], "Department:": ["Customer Service (Domestic)", "Technical Support / Helpdesk"]}, "topbox_information": {"salary_information": "Rs 2.0  - 3.0 Lakh/Yr"}, "jd_information": {"description": "Urgent positions for Travel Executive at Saanewaal Location, Ludhiana.&nbsp;Female candiadtes can only apply&nbsp;Post - Travel support ExecutiveExp-2-4 yearsSalary-15-25k/monthJob Detail-Excellent Communication SkillsKnowledge of excel, word, airport codes, culture is a plusAtleast 1-2 yrs of experience in local&nbsp; market.Ability to perform in different scopes of consulting projects in Travel industry - For e.g. Business/ IT/ Operating Strategy and Implementation, Process Transformation, Customer Relationship Management, Digital Strategy and Implementation- Possesses excellent communication (written and oral) skills and excellent presentation skills- Comfortable working with the highest levels of client organizations- Comfortable functioning in a broadly positioned and highly diverse consulting firm- Excellent team work and ability to work in distributed delivery environment.Intrested can call to Aditya kumar on 8527750087 or mail your cv on hr@cmts.in, cmts.hr@gmail.com&nbsp;"}, "_id": "5922081"}