{"company_info": {"Company Description": "cmts is engaged in the data entry outsourcing and supply of skilled/semi skilled &amp; unskilled Manpower across the industry spectrum. Our pool of manpower ranges from professionals such as Sales &amp; technical professionals in different categories, IT professionals, aviation sector, technical profiles, engineers, non-technical in-house professionals, administrative profiles, Accountant, HR, Back office, Data Entry Operator etc. Our organization's goal is total clients satisfaction through quality and personalized delivery of each and every service. We therefore exist to cater the need of these prospecting employers/companies since our inception in 2008.", "Email": "hr@cmts.in", "Company Name": "CMTS (Core Management &amp; Technical Services)", "Telephone": "9631857963"}, "api_data": {"job_location": ["Ludhiana"], "jd_id": "6686185", "job_keywords": ["Travel booking exective(Inhouse) cum Client support executive"], "job_industry": "Travel / Tourism", "company_name": "CMTS (Core Management & Technical Services)", "job_experience": "0 to 3 Yrs", "job_title": "Travel booking exective(Inhouse) cum Client support executive"}, "other_details": {"Other Skills:": ["Travel booking exective(Inhouse) cum Client support executive"], "Industry:": ["Travel / Tourism"], "Department:": ["Customer Service (Domestic)", "Technical Support / Helpdesk"]}, "topbox_information": {"salary_information": "Rs 1.0  - 2.0 Lakh/Yr"}, "jd_information": {"description": "We Have Urgent positions for Travel booking cum Client support Executive at Travel Company at saanewal location,G.T.RoadFor Immediate appointment call immediate-8527750087Same Day Offer Letter will be issuePost- Travel Booking cum Client support ExecutiveExp-6,month- 3 yearsSalary- 10-16KLocation- Saanewal, Ludhiana,GT road,Near Airport Road.Job Detail-Job DescriptionSend me Jobs like this1. Coordinating travel requests, designing and costing of itinerary both domestic and international. Managing visa requests for all international travelers including the documentation &amp; Handling global hotel reservations, customized tour packages2. Handling International Packages &amp; Online System3. Handling Domestic &amp; LTC Packages4. Handling all the Queries of B2b , B2c ,Corporate , domestic &amp; Outbound tours.5. To ensure the quality and develop new ideas.6. Doing marketing activities to promote brand.7. Meeting with Hoteliers and bus vendor on regular basis to drill out better rates for sales.8. Have to handle corporate saleInterested candidates can call me on 8527750087,or mail me your cv on hr@cmts.in or cmts.hr@gmail.com&nbsp;"}, "_id": "6686185"}