{"company_info": {"Company Description": "cmts is engaged in the data entry outsourcing and supply of skilled/semi skilled &amp; unskilled Manpower across the industry spectrum. Our pool of manpower ranges from professionals such as Sales &amp; technical professionals in different categories, IT professionals, aviation sector, technical profiles, engineers, non-technical in-house professionals, administrative profiles, Accountant, HR, Back office, Data Entry Operator etc. Our organization's goal is total clients satisfaction through quality and personalized delivery of each and every service. We therefore exist to cater the need of these prospecting employers/companies since our inception in 2008.", "Email": "hr@cmts.in", "Company Name": "CMTS (Core Management &amp; Technical Services)", "Telephone": "9631857963"}, "api_data": {"job_location": ["Patiala", "Jalandhar", "Ludhiana"], "jd_id": "6978079", "job_keywords": ["sales", "company", " corporate", " manager", " for", " travel"], "job_industry": "Travel / Tourism", "company_name": "CMTS (Core Management & Technical Services)", "job_experience": "4 to 5 Yrs", "job_title": "Marketing Head cum Corpare Communication Mgr for Travel Company at saanewl"}, "other_details": {"Other Skills:": ["company", "corporate", "manager", "for", "travel"], "Department:": ["Marketing / Communication", "Tour / Travel Management"], "Industry:": ["Travel / Tourism"], "Skills:": ["sales"]}, "topbox_information": {"salary_information": "Rs 3.5  - 6 Lakh/Yr"}, "jd_information": {"description": "Need Urgent for Marketing Head Cum Corporate comm manager Post at Travel and Tourism division Company at Saanewal location.Post- Corportae sales Manager for Travel Industry SaanewalExp-3-5,Yearssalary- 30-50K+IncentiveLocation- Saanewal Ludhiana, Near Bus standJob Detail- Selling International destinations holiday packages.Attending to customer queries for holiday packages through emails and phones calls.Plan, describe, arrange, and sell itinerary tour packagesknowledge about World Geography and worldwide holidaysPossess a high degree of integrity and sense of confidentiality- Should be self starter, result oriented, and a strong bias for action is mandatory&nbsp;Interested can call to Aditya kumar on 8527750087 or mail your cm on hr@cmts.in or cmts.hr@gmail.com"}, "_id": "6978079"}