{"company_info": {"Company Description": "cmts is engaged in the data entry outsourcing and supply of skilled/semi skilled &amp; unskilled Manpower across the industry spectrum. Our pool of manpower ranges from professionals such as Sales &amp; technical professionals in different categories, IT professionals, aviation sector, technical profiles, engineers, non-technical in-house professionals, administrative profiles, Accountant, HR, Back office, Data Entry Operator etc. Our organization's goal is total clients satisfaction through quality and personalized delivery of each and every service. We therefore exist to cater the need of these prospecting employers/companies since our inception in 2008.", "Email": "hr@cmts.in", "Company Name": "CMTS (Core Management &amp; Technical Services)", "Telephone": "9631857963"}, "api_data": {"job_location": ["Ludhiana"], "jd_id": "6978067", "job_keywords": ["Sales cum Business Development executive for Travle Industry at Saanewal", " Ludhian"], "job_industry": "Travel / Tourism", "company_name": "CMTS (Core Management & Technical Services)", "job_experience": "1 to 2 Yrs", "job_title": "Sales cum Business Development executive for Travle Industry at Saanewal,Ludhian"}, "other_details": {"Other Skills:": ["Sales cum Business Development executive for Travle Industry at Saanewal", "Ludhian"], "Industry:": ["Travel / Tourism"], "Department:": ["Sales / BD"]}, "topbox_information": {"salary_information": "Rs 1.5  - 2.0 Lakh/Yr"}, "jd_information": {"description": "Need Urgent for Male candidates for sales Executive&nbsp; Post at Pharma division Company at Saanewal location.Post-&nbsp; Sales Cum Business Development executive in Travle Indsutry SaanewalExp-1-2,Yearssalary- 11-15K+ Traveling Allowances_Incentive+OTLocation- Saanewal Ludhiana, Near Bus stand&nbsp;Job DescriptionSend me Jobs like thisProvide our clients with the best travel package deals.Making Sales to meet the corporate clients and sales the Best tours and Travel packages.Offer prompt, accurate and courteous service to our clients.Assist our clients with reservations, transfers and changes.Respond to client questions, concerns and billing inquiries with the highest degree of professionalism.Secure new client sales and retention by providing exceptional customer care.Must demonstrate an enthusiastic, sales-oriented attitude.Excellent interpersonal and verbal/written communication skills.Should have a passion to work under pressure.Interested can call to Aditya kumar on 8527750087 or mail your cm on hr@cmts.in or cmts.hr@gmail.com"}, "_id": "6978067"}