{"company_info": {"Company Description": "Dear Sir/Madam,Greeting from AL HAMD MANPOWER Service IN EAST DELHISir We Manpower Provide to ONLY SAUDI ARABIA COUNTRY. We have all Catagories Experienced and HardworkerCandidate.If you have Any Recuritment of Any Candidate Please contact with us. We Provide Quality &amp; trad Workers.1. HEAVY DUTY DRIVER COMPANY(GCC LICENCE &amp; INDIAN LICENCE FRESH) = SALARY - 1500 TO 1800 SR - SC - 90 TO 1152. L.M.V. DUTY DRIVER COMPANY OR FAMILY DRIVER (GCC LICENCE &amp; INDIAN LICENCE FRESH) = SALARY - 1200 TO 1600 SR - SC - 85 TO 903. ALL OPERATOR JCB AND SHOWAL OR FORKLIFP AND EXCAVATOR CRAIN OPERATOR = SALARY - 1500 TO 1800 SR - SC - 85 TO 954. MASON (FRESHER AND GULF EXPERIENCED) = SALARY - 1400 TO 1800 SR - SC - 85 TO 905. ELECTRICION OR PLUMBER (FRESHER AND GULF EEPERIENCED) = SALARY - 1400 TO 1800 SR - SC - 85 TO 956. CARPENTER FINSHING AND SHUTRING &amp; GIPSEM CARPENTER. = SALARY - 1400 TO 1700 SR - SC - 85 TO 957. STEEL FIXER (FRESHER AND GULF EXEPERIENCED) SALARY - 1400 TO 1800 SR - SC - 85 TO 958. HELPER IN COMPANY (FRESHER AND GULF EEPERIENCED) SALARY - 1200 TO 1600 SR - SC - 90 TO 1209. COOK required . e.c.n.r. PASSPORT - (FRESH OR GULF RETURN ACCEPTED . SALARY - 1500 SR TO 2400 SR SC - 80 TO 95PAYMENT OPTION THREE PART - 1 - AFTER MOFA2 - AFTER VISA STAMPING3 - FINAL PAYMENT TIME OF AIR TICKET OR AGGREMENTEMAIL ID - alhamdservice786@gmail.comalhamdservicejobs@gmail.communeer@alhamdmanpower.comWEBSIDE - www.alhamdmanpower.comThanks and Regards,MUNEER AHMEDAL -HAMD MANPOWER VISA SERVICE - IN BHAJANPURA EAST DELHI - 11005307532081797 MUNEER AHMED - 09899838797 NEHA DHAMI --------------------", "Email": "alhamdservicejobs@gmail.com", "Company Name": "Gulf manpower", "Telephone": "9899838797"}, "api_data": {"job_location": ["Saudi Arabia"], "jd_id": "7135099", "job_keywords": ["retail", ""], "job_industry": "Travel / Tourism", "company_name": "Gulf manpower", "job_experience": "2 to 3 Yrs", "job_title": "TRAILER DRIVER CANDIDATE  URGENT REQUIRED IN SAUDI"}, "other_details": {"Department:": ["Mainframe"], "Industry:": ["Travel / Tourism"], "Skills:": ["retail"]}, "topbox_information": {"salary_information": "Rs 4.0  - 5 Lakh/Yr"}, "jd_information": {"description": "AL-HAMD SERVICE CONSULTANT&nbsp;NEW DELHIURGENT REQUIRED TRAILER DRIVER CANDIDATE IN SAUDI&nbsp;&nbsp;AGE&nbsp;- 22 TO 44 (RETURN/FRESH)&nbsp;E.C.R PASSPORT REQUIRED&nbsp;CONTRACT&nbsp;- 2 YEAR&nbsp;Processing time of Flight gone in 30-35 days&nbsp;Duty&nbsp;- 8 hours + over time + accommodation&nbsp;Documents required&nbsp;:-&nbsp;1. VALID PASSPORT&nbsp;2. RESUME WITH MOBILE NUMBER&nbsp;3. QUALIFICATION CERTIFICATE&nbsp;4. VALID DRIVING LICENCE&nbsp;6. PHOTO&nbsp;&nbsp;THANK YOU&nbsp;&nbsp;"}, "_id": "7135099"}