{"company_info": {"Company Description": "Arsenius Skill Capital (ASC) is a Management Consulting firm and a No. 1 choice for permanent results that top management prefers. We provide turnkey solution from initial screening to synergy realization. We are ardent believer of guiding and finding values across boundaries, developing insight to act upon, energizing and motivating team to deliver and to sustain success.We are a brain child of a team of young aspiring entrepreneurs with in-depth industry specific knowledge who have joined hands to cater to the Management needs for various industries. With our years of experience and research driven methodology in diverse industry vertical we have developed skills to understand the business in depth, thus able to provide unmatched solution designs. Our team works round the clock to ensure satisfactory deliverables.Our Mission “Improvising Efficiency”Our Values Integrity, Customer Centricity, Accountability &amp; Innovation", "Email": "angee@arseniusskillcapital.com", "Company Name": "Arsenius Skill  Capital Hiring For Arsenius Skill  Capital", "Telephone": "7506178102"}, "api_data": {"job_location": ["Mumbai City"], "jd_id": "7540071", "job_keywords": ["sales marketing", " sales", " corporate sales", " business development", " business to business sales", " b2b sales", " channel sales"], "job_industry": "Travel / Tourism", "company_name": "Arsenius Skill  Capital Hiring For Arsenius Skill  Capital", "job_experience": "5 to 10 Yrs", "job_title": "Corporate Sales - Assistant Manager/Manager/Sr. Manager"}, "other_details": {"Other Skills:": ["sales marketing", "sales", "corporate sales", "business development", "business to business sales", "b2b sales", "channel sales"], "Industry:": ["Travel / Tourism"], "Department:": ["Sales / BD"]}, "topbox_information": {"salary_information": "Rs 5  - 12 Lakh/Yr"}, "jd_information": {"description": "Arsenius skill Capital has Urgent requirement for Corporate SalesPosition:&nbsp;Corporate SalesDesignation:Assistant Manager/Manager/Sr. ManagerCompensation:5 Lacs P.A. to 12 Lacs P.A.Location:MumbaiJob role:&nbsp;This Job profile requires candidates to build strong Clients relations, manage overall functionality to improve corporate Sales &amp; Operations. This profile requires customer centric professionals to acquire new accounts and manage end to end travel planning for Corporate&nbsp;Candidate Profile:Graduates or MBA Preferable in Tourism, with 5 years of minimum experience in the given role handling Corporate Marketing or Sales. Candidates handling Corporate Marketing and sales in Telecom, Finance, Retail will also be considered&nbsp;Job Responsibilities:Interested candidates may share their CV at angee@arseniusskillcapital.com or call on 7506178102Kind Regards,Angee Nandi: 7506178102Arsenius Skill Capital"}, "_id": "7540071"}