{"company_info": {"Company Description": "Arsenius Skill Capital (ASC) is a Management Consulting firm and a No. 1 choice for permanent results that top management prefers. We provide turnkey solution from initial screening to synergy realization. We are ardent believer of guiding and finding values across boundaries, developing insight to act upon, energizing and motivating team to deliver and to sustain success.We are a brain child of a team of young aspiring entrepreneurs with in-depth industry specific knowledge who have joined hands to cater to the Management needs for various industries. With our years of experience and research driven methodology in diverse industry vertical we have developed skills to understand the business in depth, thus able to provide unmatched solution designs. Our team works round the clock to ensure satisfactory deliverables.Our Mission “Improvising Efficiency”Our Values Integrity, Customer Centricity, Accountability &amp; Innovation", "Email": "angee@arseniusskillcapital.com", "Company Name": "Arsenius Skill  Capital Hiring For Arsenius Skill  Capital", "Telephone": "7506178102"}, "api_data": {"job_location": ["Navi Mumbai", "Mumbai City"], "jd_id": "7590259", "job_keywords": ["customer service", " sales", " customer handling", " lead generation"], "job_industry": "Travel / Tourism", "company_name": "Arsenius Skill  Capital Hiring For Arsenius Skill  Capital", "job_experience": "1 to 5 Yrs", "job_title": "Sales & Customer Service Executive  Travel & Tourism"}, "other_details": {"Other Skills:": ["customer service", "sales", "customer handling", "lead generation"], "Industry:": ["Travel / Tourism"], "Department:": ["Customer Service (International)", "Customer Service (Domestic)"]}, "topbox_information": {"salary_information": "Rs 50,000  - 3.5 Lakh/Yr"}, "jd_information": {"description": "Arsenius Skill Capital is for a Leading Travel MNC on direct company PayrollIf you are a BPO employee and Want to make a Career in the Travel &amp; Tourism Sector call us todayWe are Hiring for Globally Renowned Travel MNCCompany Profile: We are Hiring for a Reputed Multi National Travel Company catering to Domestic and International Clients.Positions: Sales &amp; Customer Service Executive &ndash; &ldquo;International Travel&rdquo;Job Description: We are Hiring for the Destination Management Division. Inbound Customer Service &amp; Sales for Domestic &amp; International Holiday Packages.&nbsp;The job requires prior work experience and knowledge on In an International BPO Voice Process managing inbound calls for traveling customersCandidate Profile:&bull; Minimum 6 months BPO experience in Customer Service, Sales, Lead Generation etc in&bull; Customer Centric (Excellent Communication Skills)&bull; HSC or Graduates&bull; Day Shift (5 days Working)Job Description:&middot; Handle Customers on Inbound Call.&middot; Explain Products to the customer&middot; Upselling holiday packagesLocation: Andheri (E) MumbaiRemuneration: up to 3.50 lac .p.a + Perks + Incentives and BenefitsInterested candidates call Angee at 7506178102or send in your resume to angee#arseniusskillcapital.comShare this mail with all who may benefitArsenius Skill Capital ~ Routing Skill to OpportunitiesSkill-Capital/103562613033699"}, "_id": "7590259"}