{"company_info": {"Company Description": "Arsenius Skill Capital (ASC) is a Management Consulting firm and a No. 1 choice for permanent results that top management prefers. We provide turnkey solution from initial screening to synergy realization. We are ardent believer of guiding and finding values across boundaries, developing insight to act upon, energizing and motivating team to deliver and to sustain success.We are a brain child of a team of young aspiring entrepreneurs with in-depth industry specific knowledge who have joined hands to cater to the Management needs for various industries. With our years of experience and research driven methodology in diverse industry vertical we have developed skills to understand the business in depth, thus able to provide unmatched solution designs. Our team works round the clock to ensure satisfactory deliverables.Our Mission “Improvising Efficiency”Our Values Integrity, Customer Centricity, Accountability &amp; Innovation", "Email": "brinelle@arseniusskillcapital.com", "Company Name": "Arsenius Skill  Capital Hiring For a Travel company", "Telephone": "7506178105"}, "api_data": {"job_location": ["Mumbai City"], "jd_id": "7802687", "job_keywords": ["promotions", " btl", " atl", " marketing", "development", " product", " media", " social", " brand management", " campaigns", " media planning", " digital", " brand strategy"], "job_industry": "Travel / Tourism", "company_name": "Arsenius Skill  Capital Hiring For a Travel company", "job_experience": "3 to 8 Yrs", "job_title": "Marketing Manager - Travel & Tourism, Mumbai"}, "other_details": {"Other Skills:": ["development", "product", "media", "social", "brand management", "campaigns", "media planning", "digital", "brand strategy"], "Department:": ["Marketing / Communication"], "Industry:": ["Travel / Tourism"], "Skills:": ["promotions", "btl", "atl", "marketing"]}, "topbox_information": {"salary_information": "Rs 4.5  - 10 Lakh/Yr"}, "jd_information": {"description": "An opportunity to work with a reputed Travel company for their Marketing team&nbsp;Profile: Marketing ManagerSalary: Up to 9 LPALocation: Andheri east, MumbaiKey Responsibilities:&middot; Candidate will be responsible for developing and defining consumer insight driven&nbsp;marketing&nbsp;mix and product portfolio.&middot; Give strategic direction to the&nbsp;brand&nbsp;in areas such as&nbsp;market&nbsp;share, product innovation, new product development, market&nbsp;research, consumer behavior and trends in Travel and Tourism or other industry.&middot; Design effective and innovative integrated&nbsp;marketing&nbsp;campaigns across&nbsp;ATL,&nbsp;BTL&nbsp;and Digital activities.&middot; Monitor competition on various aspects such as new offering, pricing, consumer offer,&nbsp;ATL,&nbsp;BTL&nbsp;and digital activities and course correct our strategy if required.&middot; Conceptualizing &amp; implementing Trade Promotions &amp; Consumer Promotions as well as launching activities as a part of brand&nbsp;building &amp;&nbsp;market&nbsp;development.&middot; Develop the marketing plan for based on customer insights and business requirement.&middot; Lead the team to implement all marketing activities to drive everyday sales and positive impact on customer perceptions.&middot; Coach and direct a team of Marketing Specialists.&middot; Work closely with the digital marketing team on all social media and digital activities.Candidate must have the following skill:&middot; Graduate/MBA&middot; Excellent communication skill&middot; Candidate must be presentable&middot; Strong leadership experience in coaching and leading a team.&middot; Managing marketing campaigns across all channels including catalogue, TV, in-store execution and digital management of a Marketing Budget for ATL &amp; BTL activity.Interested candidates may share their CV at brinelle@arseniusskillcapital.com or call on 7506178105.Kind Regards,Brinelle Fonseca: 7506178105Career ConsultantArsenius Skill CapitalWeb: www.arseniusskillcapital.com&nbsp;"}, "_id": "7802687"}