{"company_info": {"Company Description": "Golden Opportunity for Sr. Travel Sales Consultant( US Process)We are a premier Resource Augmentation Company with Top of the line MNC's as our clients. Our excellent conversion rate speaks about our professionalism, speed of execution and accuracy.We are looking for BEST talent from all over Delhi and Gurgaon to join at Gurgaon locationWe are hiring for TRAVEL BPO. They are looking for the person who is having at least 6 months of experience in Travel Sales (includes tour packages, ticketing, reservations) etc. along with the working knowledge of Amadeus.Position- Inbound Travel Consultant – 125 OpeningsExperience – 6 months to 8 yrsShift Timings – 5 pm to 2am and 2am to 11am (Rotational Shifts)Pick and Drop, One time DinnerSalary- Up to 40 kQualification- GraduationRegardsATUL09990059049atul@eqsplacements.inPls. share with your friends and colleagues", "Email": "atul@eqsplacements.in", "Company Name": "EQS Placements Pvt Ltd", "Telephone": "9990059049"}, "api_data": {"job_location": ["Noida", "Ghaziabad", "Gurugram", "Faridabad", "Delhi"], "jd_id": "7804677", "job_keywords": ["tours", " amadeus", " bpo", " sales", "travel"], "job_industry": "Travel / Tourism", "company_name": "EQS Placements Pvt Ltd", "job_experience": "1 to 6 Yrs", "job_title": "Travel Sales Consultant with Amadeus, Gurgaon Immediate Joiner 9990059049"}, "other_details": {"Other Skills:": ["travel"], "Department:": ["Reservation / Ticketing", "Tour / Travel Management"], "Industry:": ["Travel / Tourism"], "Skills:": ["tours", "amadeus", "bpo", "sales"]}, "topbox_information": {"salary_information": "Rs 2.0  - 5 Lakh/Yr"}, "jd_information": {"description": "We are a premier Resource Augmentation Company with Top of the line MNC's as our clients. Our excellent conversion rate speaks about our professionalism, speed of execution and accuracy.&nbsp;We are looking for BEST talent from all over Delhi, Noida and Gurgaon to join at Gurgaon locationWe are hiring for TRAVEL BPO. They are looking for the person who is having at least 6 months of experience in Travel Sales (includes tour packages, ticketing, reservations, accommodation, etc.) along with the working knowledge of Amadeus.Position- Inbound Travel Consultant &ndash; 125 OpeningsExperience &ndash; 6 months to 8 yrsShift Timings &ndash; 5 pm to 2am and 2am to 11amPick and Drop, One time DinnerSalary- Up to 40 k&nbsp;Qualification-&nbsp;Graduation&nbsp;Desired Candidates Profile &ndash;Having Good sales experienceHaving Excellent Communication SkillsHaving Relevant ExperienceHaving Good Knowledge of Amadeus&nbsp;Job Description-&nbsp;1. Liasing with clients in person, over the phone or via email to discuss their travel requirements.&nbsp;2. Advising clients on suitable options for domestic or international destinations, tours, accommodation, transport, insurance and fares.&nbsp;3. Preparing customized itineraries to suit the clients&rsquo; preferences and budget.&nbsp;4. Making and confirming bookings, often via a Global Distribution System (computerized central reservation system).&nbsp;5. Issuing tickets and relevant documents.&nbsp;6. Providing up to date advice on travel regulations including visa and medical requirements, baggage limits, safety and local customs.&nbsp;7. Modifying existing bookings to suit a change in clients&rsquo; circumstances.&nbsp;8. Researching destinations and keeping up to date travel industry news.&nbsp;9. Handling costing part.RegardsATUL09990059049atul@eqsplacements.inPls. share with your friends and colleagues"}, "_id": "7804677"}