{"company_info": {"Company Description": "&nbsp;I would like to introduce our company,&nbsp;CROWN CONSULTANTS&nbsp;which has been in the business of providing placement services.We have a well-established track record and our services have always met with great customer satisfaction.Since, the people chosen to work in that enterprise determine 95 percent of the success of any enterprise, the role of recruitment consultants, becomes very important. We are focused on helping our clients in their recruitment process right from writing the job descriptions through to finally making their hiring decisions.At crown consultants, we are the team of highly professional people from Management, IT, Pharma, Banking &amp; Insurance,Marketing,FMCG and BPO Agriculture Sectors. We always believe in establishing long-term relationships and are therefore transparent in dealings with others.&nbsp;&nbsp;", "Email": "hr1crownconsultants@gmail.cm", "Company Name": "Crown Consultants", "Telephone": "9041022920"}, "api_data": {"job_location": ["Patiala", "Amritsar", "Jalandhar", "Chandigarh", "Ludhiana"], "jd_id": "7813185", "job_keywords": ["marketing", ""], "job_industry": "Travel / Tourism", "company_name": "Crown Consultants", "job_experience": "2 to 7 Yrs", "job_title": "Urgently Hiring Marketing Executive for world's largest immigration company."}, "other_details": {"Department:": ["Marketing / Communication"], "Industry:": ["Travel / Tourism"], "Skills:": ["marketing"]}, "topbox_information": {"salary_information": "Rs 2.5  - 4.0 Lakh/Yr"}, "jd_information": {"description": "Greetings From Crown Consultants!!!&nbsp;Note : We dont charge anything from candidates.We are hiring Marketing Executive For our Prestigious Client based in Mohali.Exp: 2-7 YearsLocation: Chandigarh,Amritsar,Jalandhar,Ludhiana,Patiala.Salary: 3.5-4 LPAJob Description:-Conduct the required number of seminars &amp; presentations as specified by the BM.&nbsp;-Achieve the monthly and quarterly targets as specified.- Maintain QA status cards in accordance with the &lsquo;P&rsquo; management system-Promote Advantage World Wide to clients.- Accountable for spending 4-5 hours effectively in the field for business generation.-Design &amp; submit Daily/Weekly/Monthly action plan to the BM.-Effectively implement plans to completion- Create a database of Clubs, Institutes, associations etc. for purpose of analysis to increase market share.Interested candidates can send their resumes athr1crownconsultants@gmail.comManrajdeep Kaur9041022920Crown Consultants&nbsp;&nbsp;&nbsp;"}, "_id": "7813185"}