{"company_info": {"Company Description": "ACMErange of client services includes Executive Search &amp; Selection, Top, Middle &amp; Lower Management Hiring, Project Based Hiring, Recruitment &amp; Staffing  Process  that are delivered through our integrated suite of leadership services", "Email": "admin1@acme-hms.com", "Company Name": "ACME Human  Management Pvt. Ltd.", "Telephone": "9911071022"}, "api_data": {"job_location": ["Bangalore", "Chennai", "Hyderabad"], "jd_id": "7813051", "job_keywords": ["marketing", " industry", " sales", " queries", "operator", " tour"], "job_industry": "Travel / Tourism", "company_name": "ACME Human  Management Pvt. Ltd.", "job_experience": "2 to 5 Yrs", "job_title": "Outbound Tour / Business Dev. Manager - Bangalore, Chennai and Hyderabad"}, "other_details": {"Other Skills:": ["operator", "tour"], "Department:": ["Tour / Travel Management"], "Industry:": ["Travel / Tourism"], "Skills:": ["marketing", "industry", "sales", "queries"]}, "topbox_information": {"salary_information": "Rs 2.5  - 5 Lakh/Yr"}, "jd_information": {"description": "Hiring for Outbound Tour / Business Dev. Mgr &ndash; for Reputed Delhi Based International Tour Operator Company (focus on Europe, UK, Australia, dubai and Asian Countries) Skills- highly enthusiastic experience in the Tour &amp; Travel Industry with knowledge of International Travel processes and Products. Should have strong contacts with suppliers (Travel Agents and Freelancer people) He will drive sales and achieve targets, Identify and win new enterprise accounts through effective new business, MEETING CLIENTS (INDIVIDUAL AND CORPORATES), GENERATING QUERIES AND WORKING ON POTENTIAL LEADS, AND CONVERSION, MEETING TARGETS for its Bangalore, Chennai and Hyderabad Collect data on competitor's activities. Suggest necessary marketing activities. If you are interested please mail your photo resume with following details (Post applied, Job Profile, present salary / CTC, Joining time etc).&nbsp;email : admin1@acme-hms.com and mobile no. 9911071022"}, "_id": "7813051"}