{"company_info": {"Company Description": "&nbsp;We take this opportunity to introduce ourselves as an integrated facilities and manpower solutions provider.&nbsp; Our mission is to provide the &lsquo;best in class&rsquo; facilities.&nbsp; This is done by way of realigning and synergizing the human potential of our esteemed customers with the involvement of our top niche management professionals and associates. We provide service to job seekers as well as job providers. We provide the technical, skilled marketing, administrative manpower consultancy services to the various industries.&nbsp;", "Email": "acsbiodata@gmail.com", "Company Name": "Universal  Job Linkers", "Telephone": "01244282677"}, "api_data": {"job_location": ["Gurugram", "Delhi"], "jd_id": "7813477", "job_keywords": ["air", " ticketing", " strategy", "product", " product management", " product planning", " product manager"], "job_industry": "Travel / Tourism", "company_name": "Universal  Job Linkers", "job_experience": "5 to 10 Yrs", "job_title": "Product Manager"}, "other_details": {"Other Skills:": ["product", "product management", "product planning", "product manager"], "Department:": ["Sales / BD", "Sales Support / MIS"], "Industry:": ["Travel / Tourism"], "Skills:": ["air", "ticketing", "strategy"]}, "topbox_information": {"salary_information": "Rs 4.0  - 9 Lakh/Yr"}, "jd_information": {"description": "Urgent hiringAs a Product Manager, we are looking forward you should work closely with our Tech Team and UI designer to improve the UI and User experience, increase visitors, App Downloads and Sales Revenue through enhanced experience and better Usability of the product. (Website, Mobile Site and App)&nbsp;Essential Duties of&nbsp;Product&nbsp;Manager&middot; Designing User Interfaces and applying usability principles to Website, Mobile site as well as applications. create the Standard templates and prototypes, creating page layouts, Conceptual Design, High/Low Fidelity Prototyping.&middot; Conducting regular competition analysis and recommending plan. Learn and collect the latest product designing trends of OTA.&middot; Defining and analyzing&nbsp;product&nbsp;metrics regularly, and use the learning for&nbsp;product&nbsp;innovations and improve the GUI, solve navigational issues, present new ideas to the team members, aid developers in improving the UIs.&middot; Take active part in user research and testing.&middot; Creating Style Guides and Standards for applications and websites.&middot; Leading the construction of CMS platform.&middot; Utilize the measurement tools to analyze the performance of website and App.&nbsp;Preferred Experience&middot; 5 years of experience in leading the design for rich interactive web and&nbsp;mobile applications.&middot; Preference for candidates with experience/understanding of SEO, GA and UE. Must have strong conceptual knowledge of at least one programming language&middot; Ability to work with teams with diverse background&middot; Excellent Communication and Relationship Management skills&middot; Is a team player with the confidence to take the lead and guide other employees when necessary.&middot; High analytical ability. Strong ability to work under pressure and deliver tangible solutionsWe are into travel industry having online portal provides air ticketing solutionsWalk in interview230, 2nd floor, Aapka bazar, Gurudwara road, GurgaonTelephone: 0124 4282677RegardsAmit SuthwalHR Consultant&nbsp;"}, "_id": "7813477"}