{"company_info": {"Company Description": "Job offerStore Manager in travel related -Franchisee - VijayawadaAbout Company The client is the longest established travel company in the world. Its distinguished history began in 1758 when it was appointed as general agents to the regiment of Foot Guards in India under the command of Lord Ligonier. The worldwide offices are located in UK, USA, Japan, Russia, Singapore and Dubai. It has associate offices in Germany, Italy, Spain, South Africa, Sweden and Australia.Location  VijayawadaExperience  1 – 5 YearsFunction  Sales &amp; MarketingSalary  3.2 LakhsVacancy  1Job Description Dept - FranchiseeExposure - Should have experience in FIT Sales for destinations like US, Europe, Australia, NZ, South Africa, Dubai, Far East. JD mailed as attachment.Communication skills - Good communication skills with mandatory knowledge in English &amp; local languageNotice Period - Immediate joinees preferred, if not then max. upto 1 monthQualification  GraduateWorking Days  6 Days a Week (900 AM to 500 PM)Job Nature  Full TimeInterested candidates may send resume to ultimatehr18@gmail.com", "Email": "ultimatehr18@gmail.com", "Company Name": "kamlesh travels", "Telephone": "9820597057"}, "api_data": {"job_location": ["Vijayawada"], "jd_id": "7827945", "job_keywords": ["language", " communication", " marketing", " sales", " general", " english", " was", " store", " history", "skills"], "job_industry": "Travel / Tourism", "company_name": "kamlesh travels", "job_experience": "1 to 5 Yrs", "job_title": "Store Manager in travel related -Franchisee - Vijayawada"}, "other_details": {"Other Skills:": ["skills"], "Department:": ["Operations Management / Process Analysis"], "Industry:": ["Travel / Tourism"], "Skills:": ["language", "communication", "marketing", "sales", "general", "english", "was", "store", "history"]}, "topbox_information": {"salary_information": "Rs 2.5  - 3.0 Lakh/Yr"}, "jd_information": {"description": "Job offerStore Manager in travel related -Franchisee - VijayawadaAbout Company :The client is the longest established travel company in the world. Its distinguished history began in 1758 when it was appointed as general agents to the regiment of Foot Guards in India under the command of Lord Ligonier. The worldwide offices are located in UK, USA, Japan, Russia, Singapore and Dubai. It has associate offices in Germany, Italy, Spain, South Africa, Sweden and Australia.Location :&nbsp;VijayawadaExperience :&nbsp;1 &ndash; 5 YearsFunction :&nbsp;Sales &amp; MarketingSalary : 3.2 LakhsVacancy :&nbsp;1&nbsp;Job Description :&nbsp;&nbsp;Dept -&nbsp;FranchiseeExposure -&nbsp;Should have experience in FIT Sales for destinations like US, Europe, Australia, NZ, South Africa, Dubai, Far East. JD mailed as attachment.Communication skills -&nbsp;Good communication skills with mandatory knowledge in English &amp; local languageNotice Period -&nbsp;Immediate joinees preferred, if not then max. upto 1 monthQualification :&nbsp;GraduateWorking Days :&nbsp;6 Days a Week (9:00 AM to 5:00 PM)Job Nature :&nbsp;Full Time&nbsp;Interested candidates may send resume to ultimatehr18@gmail.com&nbsp;GangadharRecruiter"}, "_id": "7827945"}