{"company_info": {"Company Description": "About CompanyThey are uniquely equipped to provide transport services which are centered on their customers and their traveling needs. They have concentrated their efforts on providing you with the state-of-the-art, reliable, and convenient taxi services. Their high-quality cab services ensure a comfortable, fully supported trip and an excellent overall traveling experience. Their team’s undivided goal is to provide each individual customer with a truly wonderful car-riding experience which features a great all-around support from the moment of the booking, all the way to the very end of the journey.", "Email": "bdsconsultants.anju@gmail.com", "Company Name": "BDS Enterprises", "Telephone": "9716049888"}, "api_data": {"job_location": ["Delhi"], "jd_id": "7832539", "job_keywords": ["co", " apps", " drivers", " basic", " well", " collection", " can", " marketing", " android", "computer", " knowledge"], "job_industry": "Travel / Tourism", "company_name": "BDS Enterprises", "job_experience": "1 to 6 Yrs", "job_title": "Req.Marketing Guys for Online Taxi ,Cab Services in Delhi"}, "other_details": {"Other Skills:": ["computer", "knowledge"], "Department:": ["Marketing / Communication", "Sales / BD"], "Industry:": ["Travel / Tourism"], "Skills:": ["co", "apps", "drivers", "basic", "well", "collection", "can", "marketing", "android"]}, "topbox_information": {"salary_information": "Rs 1.0  - 1.5 Lakh/Yr"}, "jd_information": {"description": "Dear CandidateWe require Marketing guys for online Taxi/CAB Booking services Co.1. Field Operation/Marketing Boys(Vacancies -3,Qualification : Graduate ):These Guys will go to market for signup new drivers. They will go direct mostly some times we will provide database or leads. but most probably they will go direct according for exp. Taxi stand/ Railway stations etc. These guys should have android mobile. Well understanding to operate apps. Basic computer knowledge. If they can have bike for local that is fine other no compulsory.Note : Some time we will send them outstation locations like Chandigarh, Amritsar, Jaipur many more locations for collection driver database. We will provide TA/DA for that. Also expenses we will provide.Salary package : 8.5k - 14kAbout Company:They are uniquely equipped to provide transport services which are centered on their customers and their traveling needs. They have concentrated their efforts on providing you with the state-of-the-art, reliable, and convenient taxi services. Their high-quality cab services ensure a comfortable, fully supported trip and an excellent overall traveling experience. Their team&rsquo;s undivided goal is to provide each individual customer with a truly wonderful car-riding experience which features a great all-around support from the moment of the booking, all the way to the very end of the journey.Interested may send their resume at the earliest to the undersignedRgdsAnju SinghBDS Enterprisesbdsconsultants.anju@gmail.com9716049888&nbsp;"}, "_id": "7832539"}