{"company_info": {}, "api_data": {"job_location": ["Delhi"], "jd_id": "7842989", "job_keywords": ["canal", " selling", " ticketing", " sales", " gds", " lcc", " b2b", "sales management"], "job_industry": "Travel / Tourism", "company_name": "Air The World", "job_experience": "0 to 4 Yrs", "job_title": "Regional Sales Manager"}, "other_details": {"Other Skills:": ["sales management"], "Department:": ["Sales / BD"], "Industry:": ["Travel / Tourism"], "Skills:": ["canal", "selling", "ticketing", "sales", "gds", "lcc", "b2b"]}, "topbox_information": {"salary_information": "Rs 2.5  - 3.5 Lakh/Yr"}, "jd_information": {"description": "Flights.AirTheWorld.comCall: +91-11-43516666Sameer: +9111943454Amit: +91-971707721Vijay: +91-9810121652&nbsp;I need 10 thousand candidates to sell myB2B login to over 10Lac travel agents and the candidate will get commission on each sales.&nbsp;&nbsp;Ticketing Benefits:-&nbsp;A)&nbsp;Best flight rates for both LCC (low cost carriers) and GDS (Full service carrier) flights.&nbsp;B) Get best rates for Fixed Departure flights providing tickets at very low rates&nbsp;C) Get access to Bus booking in India, Get easy bus booking service PAN India.&nbsp;D)Get access to best rates for 2 Million+ hotels(budget,2/3/4/5 Star properties)/ Resorts/Villa and Apartment rooms.&nbsp;E) Get great commission modules and incentives on different sales slabs.&nbsp;INTERNATIONAL PACKAGES:&nbsp;l&nbsp;Thailand Packagel&nbsp;Singapore Packagel&nbsp;Singapore + Malaysia Packagel&nbsp;Singapore + Bali Packagel&nbsp;Singapore + Cruise Packagel&nbsp;Dubai Packagel&nbsp;Hong Kong Packagel&nbsp;Vietnam Packagel&nbsp;China Packagel&nbsp;Nepal Packagel&nbsp;Mauritius Packagel&nbsp;Maldives Packagel&nbsp;Europe Packagel&nbsp;New Zealand Packagel&nbsp;Russia PackagesAnd Many More&nbsp;&nbsp;DOMESTIC PACKAGES:&nbsp;l&nbsp;Goa Packagesl&nbsp;Kerala Packagesl&nbsp;Ooty and Kodai Canal Packagesl&nbsp;Port Blair Packagesl&nbsp;Leh-Ladakh Packagesl&nbsp;Srinagar Packagesl&nbsp;Amarnath Packagesl&nbsp;Vaishno Devi Packagesl&nbsp;Darjeeling Gangtok Packagesl&nbsp;Himachal Pradesh Packagesl&nbsp;Uttrakhand Packagesl&nbsp;The golden triangle Packagesl&nbsp;Rajasthan Packagesl&nbsp;Gujrat packagesl&nbsp;North-east packages&nbsp;&nbsp;We provide best services at lowest price.&nbsp;Enroll to become a candidate for selling B2B login only in 500 INR&nbsp;Sell our B2B log in AgentOnly for 500 INR&nbsp;Become an agent and create agents only in 1000INR"}, "_id": "7842989"}