{"company_info": {"Company Description": "DonepullAbout the companyIts Noida based recruitment /outsource consultancy firm with Ex-Big 4 professionals as partners. Serving MNC and local clients and helping them reducing time in HR related activities.", "Email": "nidhi.donepull@gmail.com", "Company Name": "Done Pull Hiring For Y Not Travel", "Telephone": "9999851849"}, "api_data": {"job_location": ["Delhi"], "jd_id": "7873577", "job_keywords": ["packages", " travel sales", " hotel", " leisure", " contracting", " tour", " tour operator", " itinerary", " outbound sales", " holiday"], "job_industry": "Travel / Tourism", "company_name": "Done Pull Hiring For Y Not Travel", "job_experience": "2 to 3 Yrs", "job_title": "Travel Consultant  Outbound Sales"}, "other_details": {"Other Skills:": ["packages", "travel sales", "hotel", "leisure", "contracting", "tour", "tour operator", "itinerary", "outbound sales", "holiday"], "Industry:": ["Travel / Tourism"], "Department:": ["Sales / BD"]}, "topbox_information": {"salary_information": "Rs 3.0  - 5 Lakh/Yr"}, "jd_information": {"description": "About the CompanyFounded in 2004, Y Not Travel has made an incredible mark in establishing itself as a reliable travel service provider with an eye for detail towards its passengers comfort and convenience. The expertise of the company lies in creating a security shield around its travelers wherever they go and being vigilant towards their comfort level. The company is delivering excellence in orienting it with the moods of its clientele.Their clients enjoy the best in class rates from our worldwide fleet of partner hotels and agencies.The services offered by the company includes all types of hotel booking, tour packages, car rentals, event management, seminars services.&nbsp;Education - Graduation ( B.A Travel tourism)or Similar QualificationExperience - 2- 3 years experience&nbsp;required in sales in travel or any related industryJob will require knowledge of International tourism and familiarity with world geography.OUTBOUND Responsibilities :&middot; Hotel Bookings and arranging for transfers&middot; Car rental &amp; Coach hire&middot; Chalking out passenger specific itineraries&middot; Youth, student and low budget travel and accommodation offers&middot; Organizing exotic group tours, safaris and expeditions&middot; Guided tours and summer holiday trips in winter and summer&middot; Train, ship and ferry ticket booking&middot; Luxury cruises&middot; Passport Services&middot; Visa Services&middot; Currency exchange and travelers&rsquo; cheque arrangementsDesired Candidate :&middot; Should provide Excellent Customer Service Experience&middot; Responsible for providing prompt services &amp; replies to queries.Key Skills :&middot; Job will require knowledge of International tourism and familiarity with world geography.&middot; Candidates must be aware of international tourist destinations and capable of making itinerary suggestions.&middot; Must be familiar with use of Online reservations systems for hotel and tour bookings.Job Type: Full-timeSalary: 25,000.00 to 40,000.00 /month&nbsp;"}, "_id": "7873577"}