{"company_info": {"Company Description": "NirvanaTrip.in-Responsible travel to natural areas, which conserves the environment and improves the welfare of local people. It is tourism based on the natural attractions of an area include bird watching, photography, stargazing, camping, hiking and visiting nature parks. We are group of #Souls # Professionals and #Expert tour guides having long- term successful professional experience in tourism business. NirvanaTrip.in specializes in cultural &amp; natural heritage tours, hiking, trekking, mountaineering, rafting, wildlife safaris, mountain biking, And special itineraries. We provide consultation, operation and destination management in India throughout highly quality professional service to our valued clients", "Email": "hr@nirvanatrip.in", "Company Name": "Nirvana Trip", "Telephone": "9599289938"}, "api_data": {"job_location": ["Noida"], "jd_id": "7873551", "job_keywords": ["promotions", " search", " marketing", " reports", " research", " seo", " writing", " crm", "website", " development", " social", " market", " media"], "job_industry": "Travel / Tourism", "company_name": "Nirvana Trip", "job_experience": "1 to 3 Yrs", "job_title": "Travel Marketing Executive"}, "other_details": {"Other Skills:": ["website", "development", "social", "market", "media"], "Department:": ["Market Research (MR)", "Marketing / Communication"], "Industry:": ["Travel / Tourism"], "Skills:": ["promotions", "search", "marketing", "reports", "research", "seo", "writing", "crm"]}, "topbox_information": {"salary_information": "Rs 1.5  - 3.0 Lakh/Yr"}, "jd_information": {"description": "&nbsp;Key duties include:&middot;&nbsp;Responsible for implementing the marketing campaign calendar.&middot;&nbsp;Executing marketing activities across their social media channels and open up new channels when necessary.&middot;&nbsp;Responsible for designing targeted and weekly email campaigns with our CRM software.&nbsp;&middot;&nbsp;Coordinating website development, promotions and press relations.&middot;&nbsp;Writing blog content using SEO strategies&nbsp;&middot;&nbsp;Optimizing Google Ad words campaigns (PPC search and display).The successful candidate will have:&middot;&nbsp;Luxury Travel marketing experience&middot;&nbsp;At least 1-3 years&rsquo; experience working within a marketing department, with good knowledge of the latest trends and best practice&middot;&nbsp;Ability to work under pressure and to deadlines"}, "_id": "7873551"}