{"company_info": {"Company Description": "CAREER INNOVATORS is a Leading Recruitment Company based out in Delhi and working for Leading Airports-Airline-Hotels-BPO’s- Retail Store and Real Estate.. With the Experienced and Dedication Company has become No.1 in Delhi/ NCR for Closing maximum Positions for Junior and Senior Level Positions..Apart from this Career Innovators has another 2 Different units which Comes underMADHOKGroup of CompaniesUnit's ofMADHOK™Group of Companies*  (Travel Consultants for Passport's, Visa's, Domestic &amp; International Tour Packages)*  (Leading Property Consultant for Buying &amp; Selling of Flats- Plots- Floors- in Delhi-Noida-Gurgaon/ NCR*  (Recruitment Consultant for Airlines-Hotels-Airports-BPO’s- Retail Store &amp; Real Estate )", "Email": "jobtourinnovators@gmail.com", "Company Name": "Career Innovators", "Telephone": "01171227122"}, "api_data": {"job_location": ["Delhi"], "jd_id": "7874923", "job_keywords": ["tour management", " passport", " tour operations", " tour operator", " visa"], "job_industry": "Travel / Tourism", "company_name": "Career Innovators", "job_experience": "0 to 4 Yrs", "job_title": "Travel Consultant- DELHI"}, "other_details": {"Other Skills:": ["tour management", "passport", "tour operations", "tour operator", "visa"], "Industry:": ["Travel / Tourism"], "Department:": ["Tour / Travel Guide", "Tour / Travel Management"]}, "topbox_information": {"salary_information": "< Rs 50,000  - 3.0 Lakh/Yr"}, "jd_information": {"description": "We are Urgent Hiring Female Executive for International &amp; Domestic Tour Packages, Passports, VisaTravel Based processes as would be dealing with client on email and phone&nbsp;Job Location: Dwarka Mor New Delhi.&nbsp;&nbsp;Job Description&nbsp;Assisting Customers for Applying PassportAssisting Customers for Applying VisaTaking Care of the Domestic and International Tour Packages BookingBooking Travel Airline Tickets for India and InternationalWill Interact the clients face to face once they come to the officeWill be responsible for making calls and keeping regular follow-up with the client&nbsp;BenefitsFresher may also applyExcellent Working Environment as only Female EmployeesSalary Negotiable 10-15k plus Cash Incentive on Per Day basisFixed Morning Shifts (9:30 Am to 6:30 Pm) Sunday OffAge Req. can apply. : 18-30 Years&nbsp;You can send your CV: jobtourinnovators@gmail.com&nbsp;Call on 011-7122-7122&nbsp;&nbsp;Corporate OfficeCAREER INNOVATORS PVT LTD, Corporate Tower- 2nd Floor, Dwarka Mor Metro Station, Opposite Metro Pillar No 766, New Delhi - 110059 (INDIA), Land Mark Above Yes Bank&nbsp;IMPORTANT NOTE: We are the Authorized Consultants for a lot Companies in India and Dubai Hence DO NOT CHARGE any Placement Charges Before or after your Job (FREE RECRUITMENT)&nbsp;**** Thank You for Making us No.1 HR Consultant ****"}, "_id": "7874923"}