{"company_info": {"Company Description": "InterGlobe Technologies (IGT) is a global travel domain expert providing travel technology and BPM services that help maximize business performance for its customers. IGT is committed to delivering innovation and business excellence across the entire spectrum of the travel and hospitality domain.IGT is part of InterGlobe Enterprises, one of India's largest travel conglomerates. With its 11 state-of-the-art delivery centers and worldwide operational presence, IGT boasts of a talent pool of over 7,000 travel industry experts. IGT, through its innovative solutions and services, offers a unique value proposition in terms of accuracy, quality, flexibility and cost savings to a large number of airlines, travel management companies, OTAs, travel technology companies, hotels and logistics companies.&nbsp;", "Email": "monika.vats@igt.in", "Company Name": "Interglobe Technologies Pvt ltd"}, "api_data": {"job_location": ["Gurugram"], "jd_id": "7875183", "job_keywords": ["hiring", " support", " geography", " amadeus", " queries", "customer", " process", " travel", " service"], "job_industry": "Travel / Tourism", "company_name": "Interglobe Technologies Pvt ltd", "job_experience": "1 to 6 Yrs", "job_title": "Process Associate - Corporate Travel (International Process)"}, "other_details": {"Other Skills:": ["customer", "process", "travel", "service"], "Department:": ["Customer Service (International)"], "Industry:": ["Travel / Tourism"], "Skills:": ["hiring", "support", "geography", "amadeus", "queries"]}, "topbox_information": {"salary_information": ""}, "jd_information": {"description": "||| &nbsp;IGT Is Hiring |||Urgent Hiring for Corporate Travel Process Associate - Corporate Travel (International Process).Skillset Required: Preferably Amadeus, though others can be considered Minimum 3 years Corporate experience is mandatory.Interview Timings- Monday to FridayTime- 12 to 5 PMContact-&nbsp;Monika Vats-0124-4587347Venue-&nbsp;3rd Floor, InfoTech Centre,14/2 Old Delhi Gurgaon Road Dundahera,Gurgaon-122016, Haryana, IndiaJob DescriptionProvides customer support to corporate customers, on a variety of services for hotel and air reservations. Identifies, researches, and resolves bookings if within defined scope of work. Responds to telephone calls, email initiated by customers via the self service web portal or over a call. &nbsp;Has knowledge of world geography, fares , taxes and commonly-used concepts, practices, and procedures within a corporate travel field. &nbsp;Relies on instructions, Pre-established guidelines and the knowledge base to perform the function of the job. Its a blended profile, which involves inbound and out bound calls with e-mails, and shifts are 24/7 and 5 days working.Provides support to customers with a high degree of customer service and quality Works diligently &amp;&amp; responding to corporate travel queries efficiently over the phone, or web medium which is not limited just to chat, web support and emails.Regards,Monika Vats3rd Floor, InfoTech Centre,14/2 Old Delhi Gurgaon Road Dundahera,Gurgaon-122016, Haryana, India&nbsp;"}, "_id": "7875183"}