{"company_info": {"Company Description": "Arsenius Skill Capital (ASC) is a Management Consulting firm and a No. 1 choice for permanent results that top management prefers. We provide turnkey solution from initial screening to synergy realization. We are ardent believer of guiding and finding values across boundaries, developing insight to act upon, energizing and motivating team to deliver and to sustain success.We are a brain child of a team of young aspiring entrepreneurs with in-depth industry specific knowledge who have joined hands to cater to the Management needs for various industries. With our years of experience and research driven methodology in diverse industry vertical we have developed skills to understand the business in depth, thus able to provide unmatched solution designs. Our team works round the clock to ensure satisfactory deliverables.Our Mission “Improvising Efficiency”Our Values Integrity, Customer Centricity, Accountability &amp; Innovation", "Email": "angee@arseniusskillcapital.com", "Company Name": "Arsenius Skill  Capital Hiring For Travel &amp; Tourism", "Telephone": "7506178102"}, "api_data": {"job_location": ["Bangalore", "Other Gujarat", "Kolkata", "Navi Mumbai", "Thane", "Mumbai City", "Ahmedabad"], "jd_id": "7881041", "job_keywords": ["git", " management", " retail", "development", " product", " vendor", " fit", " supplier management", " inbound", " travel agency operations", " travel", " domestic", " contracting", " tour", " international", " outbound", " packages", " costing"], "job_industry": "Travel / Tourism", "company_name": "Arsenius Skill  Capital Hiring For Travel & Tourism", "job_experience": "3 to 8 Yrs", "job_title": "Branch Manager - Retail Travel Division"}, "other_details": {"Other Skills:": ["development", "product", "vendor", "fit", "supplier management", "inbound", "travel agency operations", "travel", "domestic", "contracting", "tour", "international", "outbound", "packages", "costing"], "Department:": ["Tour / Travel Guide", "Tour / Travel Management"], "Industry:": ["Travel / Tourism"], "Skills:": ["git", "management", "retail"]}, "topbox_information": {"salary_information": "Rs 5  - 12 Lakh/Yr"}, "jd_information": {"description": "Arsenius Skill Capital is Hiring Branch Managers - Travel for a Leading Travel MNC&nbsp;Position: Branch Manager Retail Travel&nbsp;Location: Mumbai / Gujarat / Kolkata&nbsp;JOB DESCRIPTION:As a Retail Travel Branch Manager you will work with a team and lead the Travel Consultants to continued success. If you are motivated, can motivate those around you and enthusiastic about Travel then this is the role for you. The role comes with a highly attractive salary package,For this Travel Retail Branch Manager role your Responsibilities will include:&middot; Through Knowledge of Travel Products (International / Domestic Destination Management)&nbsp;&middot; Strong Contracting &amp; Product Development Experience&nbsp;&middot; Good network of vendors, Supplies and Enterprise&nbsp;&middot; Meeting and exceeding sales targets&nbsp;&middot; Drive all sales and convert bookings by closing the sale and driving figures whilst achieving operating profit&middot; Day to day running of the store including operations and administration&middot; Responsible for the development of fully trained, informative, highly motivated and Travel&middot; Consultants who deliver exceptional service and revenue&middot; Develop local marketing initiatives and campaigns and set up instore events where appropriate and commercially beneficial to drive sales and build relationships to provide travel services for local business employees.&middot; Forecast walk in business, plan staffing levels and opening hours accordingly, well in advance to ensure excellent customer service is maintained at all times.EXPERIENCE REQUIRED:This Branch Manager position requires experience of managing a travel team with a true passion for travel and sales with profit and staff responsibility. Strong track record of delivering sales results and exceptional service. You will be well-travelled, as you will use your first hand destination knowledge. The ideal candidate will have experience of using GDS AND Reservation systems.&nbsp;CTC: 4 lac &ndash; 12 lac p.a&nbsp;Interested applicants can call Angee &ndash; 7506178102 for a telephonic interview or share resume with angee@arseniusskillcapital.com&nbsp;"}, "_id": "7881041"}