{"company_info": {"Company Description": "InterGlobe Technologies (IGT) is a global travel domain expert providing travel technology and BPM services that help maximize business performance for its customers. IGT is committed to delivering innovation and business excellence across the entire spectrum of the travel and hospitality domain.IGT is part of InterGlobe Enterprises, one of India's largest travel conglomerates. With its 11 state-of-the-art delivery centers and worldwide operational presence, IGT boasts of a talent pool of over 7,000 travel industry experts. IGT, through its innovative solutions and services, offers a unique value proposition in terms of accuracy, quality, flexibility and cost savings to a large number of airlines, travel management companies, OTAs, travel technology companies, hotels and logistics companies.", "Email": "Swati.Thakur@igt.in", "Company Name": "Interglobe Technologies Pvt ltd", "Telephone": "+91 7507922775"}, "api_data": {"job_location": ["Pune"], "jd_id": "7887983", "job_keywords": ["operations", " focus", " associates", " reports", " aht", " education", " management", " personal", " clearing", " support", " screening", " presentation", " multiple", " sales", " promotions", " bpo", " air", " verification", " queries", " site", " security", " pricing", "customer", " information", " service", " process", " skills", " interpersonal", " voice"], "job_industry": "Travel / Tourism", "company_name": "Interglobe Technologies Pvt ltd", "job_experience": "0 to 3 Yrs", "job_title": "IndiGo Airlines Customer Service"}, "other_details": {"Other Skills:": ["customer", "information", "service", "process", "skills", "interpersonal", "voice"], "Department:": ["Customer Service (Domestic)", "Reservation / Ticketing"], "Industry:": ["Travel / Tourism"], "Skills:": ["operations", "focus", "associates", "reports", "aht", "education", "management", "personal", "clearing", "support", "screening", "presentation", "multiple", "sales", "promotions", "bpo", "air", "verification", "queries", "site", "security", "pricing"]}, "topbox_information": {"salary_information": "Rs 1.0  - 2.0 Lakh/Yr"}, "jd_information": {"description": "Walk in with a Copy of your resume-&nbsp;Address- InterGlobe TechnologiesMantri Business ParkWING A, Ground Floor,Nagar Road Pune &ndash; 411014Near In-Orbit Mall,Bus Stand- Pachwa Mail&nbsp;Time- 10 AM to 3 PMDays- Monday to SundayContact Person- Swati ThakurContact Number- +91 7507922775/ 8412936179&nbsp;&nbsp;InterGlobe Technologies is looking for a Process Associates to handle Sales and Customer care process for End to end airline operations. The position is based in Pune and reports into the Team Leader &ndash;Operations - BPO. The position is responsible for handling Customer Care related issues, Reservations, Web site support, Bulk bookings, Notification, Re-booking, Credit card verification, Queues Management, Email management for all corporate and travel related queries.&nbsp;Essential Experience:Prior experience of working in a Voice process is an advantageA highly professional attitude and personal presentation via the telephoneComputer literacyStrong interpersonal skills, high level of accuracy and efficiency including ability to develop, offer, and execute multiple itinerary and pricing optionsStrong sense of urgency and ability to multi-task under pressurePreferable knowledge on Travel Destinations- Domestic &amp; InternationalSubject to clearing mutually agreed to aptitude test and background screening.Personal Style Enablers:Should have a good standard of both Spoken and written EnglishNeeds to be a team player with a positive attitudeShould be adaptable to changeNeeds to display confidence and the ability to sell a given product.Extrovert with a customer service mind setPrimary Job Responsibilities:Achieve the required Quality Score by following all the established parametersResponsible for call/email handling in a courteous, friendly and professional manner according to company procedures.Provide Quality Customer ServiceRespond to a high volume of telephone/email inquiries about the company&rsquo;s products or services by following standard scripts and procedures. Talks with customers by phone/email and receives information pertaining to Air reservationsProbe and understand the requirements or problems of the customer Provide valid solutions to the customer and provide any additional customer service / education as neededMaintain knowledge of products, pricing promotions, procedures and other important issues through management communications, meetings, customer focus groups and formal trainingInform customer about the Schedule and Cancellation changesOffer additional services as indicated by the businessMaintain AHT at the established levelProcessing the established daily metric, while maintaining an average talk/response time consistent with current business needsAdherence to Information security guidelinesApplicant will display Appropriate Knowledge and adh&eacute;rence to information Security guidelines.Education:Graduate/ Undergraduate/ Fresher&nbsp;&nbsp;"}, "_id": "7887983"}