{"company_info": {"Company Description": "We are experts. We know our clients, their companies, our candidates and our business. In our business it#26;s often the details which count the most to serve you in the best way. We achieve this through a spirit of excellent service and great enthusiasm exceeding the core requirements of our industry. We see the bigger picture. Our business must always benefit society as a whole. And should always contribute towards the development of the society.", "Email": "jobscareerzinn@gmail.com", "Company Name": "CareerzInn Placement Consultancy Pvt. Ltd.", "Telephone": "07884091008"}, "api_data": {"job_location": ["Mumbai City"], "jd_id": "7889689", "job_keywords": ["management", " telecom", " sales", " insurance", " b2b", " hospitality", " b2c", " nbfc", "development", "  real estate", " business", "  direct sales", " financial services", "  team handling", " banking", " manager", "  sales target", " branch", " team", " front", " fmcg", " line", " timeshare", " channel"], "job_industry": "Travel / Tourism", "company_name": "CareerzInn Placement Consultancy Pvt. Ltd.", "job_experience": "7 to 10 Yrs", "job_title": "Business Unit Head (Leading Timeshare Group)"}, "other_details": {"Other Skills:": ["development", "real estate", "business", "direct sales", "financial services", "team handling", "banking", "manager", "sales target", "branch", "team", "front", "fmcg", "line", "timeshare", "channel"], "Department:": ["Sales / BD"], "Industry:": ["Travel / Tourism"], "Skills:": ["management", "telecom", "sales", "insurance", "b2b", "hospitality", "b2c", "nbfc"]}, "topbox_information": {"salary_information": "Rs 10  - 12 Lakh/Yr"}, "jd_information": {"description": "Dear Candidates,Greetings !&nbsp;We are hiring for the subject role for a Leading Timeshare&nbsp;Group. Details below:Job Description:The key responsibilities of this function include:&bull; Leading members of the Sales team&bull; Planning, evaluating, implementing and continuously improving all aspects of sales functions and processes.&bull; Achieving stretched targets and managing sales in a result-focused environment.&bull; Making effective sales presentations and closing deals.&bull; Resolving team and member/ customer conflicts.&bull; Maintaining strong client relationship and high level of customer service.&bull; Identifying potential customers and new business opportunities.&bull; Constantly liaising with other departments for smooth functioning.&bull; Maintaining own awareness of product in order to sell effectively.&bull; Training, motivating and coaching Team Managers and teams of sales executives.&middot; Responsible for productivity &amp; conversion rates&nbsp;Required Skills:Experience : Total experience of 7-10 Years with 3-4 years of experience in team handling role.Industry : Any Industry. Should be from direct Customer sales Profile.Qualifications: Graduate and above.&nbsp;&bull; Ability to balance between task and people orientation&bull; Applicant must enjoy working in a fast-paced environment and be able to thrive under pressure.&bull; Good communication skills&nbsp;&nbsp;**Interested Candidate can apply with their updated resume on the below mentioned Email id.Preferred Resume Format- MS-WordPass this message to your friends colleagues in case if it suits them.NOTE :- Pl call us at the below mentioned number for any queries.Contact: 07884091008 / 9329321008"}, "_id": "7889689"}