{"company_info": {"Company Description": "&nbsp;I would like to introduce our company,&nbsp;CROWN CONSULTANTS&nbsp;which has been in the business of providing placement services.We have a well-established track record and our services have always met with great customer satisfaction.Since, the people chosen to work in that enterprise determine 95 percent of the success of any enterprise, the role of recruitment consultants, becomes very important. We are focused on helping our clients in their recruitment process right from writing the job descriptions through to finally making their hiring decisions.At crown consultants, we are the team of highly professional people from Management, IT, Pharma, Banking &amp; Insurance,Marketing,FMCG and BPO Agriculture Sectors. We always believe in establishing long-term relationships and are therefore transparent in dealings with others.&nbsp;&nbsp;", "Email": "hr1crownconsultants@gmail.cm", "Company Name": "Crown Consultants", "Telephone": "9041022920"}, "api_data": {"job_location": ["Ludhiana"], "jd_id": "7895123", "job_keywords": ["hiring", ""], "job_industry": "Travel / Tourism", "company_name": "Crown Consultants", "job_experience": "2 to 6 Yrs", "job_title": "Urgently Hiring Relationship Executive for our Reputated client"}, "other_details": {"Department:": ["Back Office Operations"], "Industry:": ["Travel / Tourism"], "Skills:": ["hiring"]}, "topbox_information": {"salary_information": "Rs 1.5  - 2.5 Lakh/Yr"}, "jd_information": {"description": "Greetings from Crown Consultants!!!NOTE: We don't charge from candidate.We are Hiring Relationship Executive for our Reputated Client.Experience: 2 yearsSalary: 2.4 LPAQualification: Graduation (Any)Location: LudhianaJob Description:&nbsp;-Ensure release of immigration package to the client as soon as the confirmation of retainer ship fee receipt has been received.-Follow up for retrieval of documents should also be from branch concerned RE.-RE must brief the capping status to clients at the time of retention.-Quick follow up with clients after receiving the forms for authentication/bar code.-Counselling of client for procurement of job duties/ preparation of experience certificates as per the ANZSCO guidelines and Nominated occupation.-Ensure release of immigration package to the client as soon as the confirmation of retainer ship fee receipt has been received.Interested Candidates can send their resumes athr1crownconsultants@gmail.comRegards&nbsp;Manrajdeep Kaur9041022920"}, "_id": "7895123"}