{"company_info": {"Company Description": "Arsenius Skill Capital (ASC) is a Management Consulting firm and a No. 1 choice for permanent results that top management prefers. We provide turnkey solution from initial screening to synergy realization. We are ardent believer of guiding and finding values across boundaries, developing insight to act upon, energizing and motivating team to deliver and to sustain success.We are a brain child of a team of young aspiring entrepreneurs with in-depth industry specific knowledge who have joined hands to cater to the Management needs for various industries. With our years of experience and research driven methodology in diverse industry vertical we have developed skills to understand the business in depth, thus able to provide unmatched solution designs. Our team works round the clock to ensure satisfactory deliverables.Our Mission “Improvising Efficiency”Our Values Integrity, Customer Centricity, Accountability &amp; Innovation", "Email": "alister@arseniusskillcapital.com", "Company Name": "Arsenius Skill  Capital Hiring For a Leading Travel MNC", "Telephone": "7506178104"}, "api_data": {"job_location": ["Mumbai City"], "jd_id": "7906245", "job_keywords": ["sales", "holiday", " from", " travel", " work", " experts", " home", " packages"], "job_industry": "Travel / Tourism", "company_name": "Arsenius Skill  Capital Hiring For a Leading Travel MNC", "job_experience": "1 to 6 Yrs", "job_title": "Holiday Expert- Work from Home (females Only)"}, "other_details": {"Other Skills:": ["holiday", "from", "travel", "work", "experts", "home", "packages"], "Department:": ["Tour / Travel Guide", "Tour / Travel Management"], "Industry:": ["Travel / Tourism"], "Skills:": ["sales"]}, "topbox_information": {"salary_information": "Rs 50,000  - 1.0 Lakh/Yr"}, "jd_information": {"description": "Arsenius Skill Capital is Hiring for&nbsp;Holiday Experts (Travel Sales ) for a Leading Travel MNCProfile: Holiday Expert (Females Only) Work from HomeJob Description:1) Guiding Guests on their Holiday inquiry.2) Designing Itineraries3) Doing costing for the packages4) Follow up on queries5) Selling holiday packages6) Attend class room training, web-ex and con callsRequirement:- Candidates from Travel background only Apply- Must have a Computer/Laptop &amp; Internet Connection&nbsp;Salary 6K PM + Commission&nbsp;Interested Candidates send your resume on alister@arseniusskillcapital.com or call Alister on 7506178104&nbsp;&nbsp;"}, "_id": "7906245"}