{"company_info": {"Company Description": "TRAVEL SALES CONSULTANTS WITH AMADEUS or SABRE KNOWLEDGE - GURGAON CALL / WHATSAP @ 9990872304WE ARE A PREMIER RESOURCE AUGMENTATION COMPANY WITH TOP OF THE LINE MNC'S AS OUR CLIENTS. OUR EXCELLENT CONVERSION RATE SPEAKS ABOUT OUR PROFESSIONALISM, SPEED OF EXECUTION AND ACCURACY.WE ARE LOOKING FOR BEST TALENT FROM ALL OVER DELHI, NOIDA AND GURGAON TO JOIN AT GURGAON LOCATIONWE ARE HIRING FOR TRAVEL BPO. THEY ARE LOOKING FOR THE PERSON WHO IS HAVING AT LEAST 6 MONTHS OF EXPERIENCE IN TRAVEL SALES (INCLUDES TOUR PACKAGES, TICKETING, RESERVATIONS, ACCOMMODATION, ETC.) ALONG WITH THE WORKING KNOWLEDGE OF AMADEUS or SABRE .POSITION- INBOUND TRAVEL CONSULTANT – 125 OPENINGSEXPERIENCE – 6 MONTHS TO 8 YRSPICK AND DROP, ONE TIME DINNERQUALIFICATION- NO BARDESIRED CANDIDATES PROFILE –HAVING GOOD SALES EXPERIENCEHAVING EXCELLENT COMMUNICATION SKILLSHAVING RELEVANT EXPERIENCEHAVING GOOD KNOWLEDGE OF AMADEUS or SABERJOB DESCRIPTION-1. LIASING WITH CLIENTS IN PERSON, OVER THE PHONE OR VIA EMAIL TO DISCUSS THEIR TRAVEL REQUIREMENTS.2. ADVISING CLIENTS ON SUITABLE OPTIONS FOR DOMESTIC OR INTERNATIONAL DESTINATIONS, TOURS, ACCOMMODATION, TRANSPORT, INSURANCE AND FARES.3. PREPARING CUSTOMIZED ITINERARIES TO SUIT THE CLIENTS’ PREFERENCES AND BUDGET.4. MAKING AND CONFIRMING BOOKINGS, OFTEN VIA A GLOBAL DISTRIBUTION SYSTEM (COMPUTERIZED CENTRAL RESERVATION SYSTEM).5. ISSUING TICKETS AND RELEVANT DOCUMENTS.6. PROVIDING UP TO DATE ADVICE ON TRAVEL REGULATIONS INCLUDING VISA AND MEDICAL REQUIREMENTS, BAGGAGE LIMITS, SAFETY AND LOCAL CUSTOMS.7. MODIFYING EXISTING BOOKINGS TO SUIT A CHANGE IN CLIENTS’ CIRCUMSTANCES.8. RESEARCHING DESTINATIONS AND KEEPING UP TO DATE TRAVEL INDUSTRY NEWS.9. HANDLING COSTING PART.ABHISHEK09990872304PLS. SHARE WITH YOUR FRIENDS AND COLLEAGUES", "Email": "abhishek.eqsindia@gmail.com", "Company Name": "EQS Placements Pvt Ltd", "Telephone": "9990872304"}, "api_data": {"job_location": ["Gurugram", "Delhi"], "jd_id": "7908979", "job_keywords": ["tours", " sabre", " sales", " bpo", " amadeus", "travel"], "job_industry": "Travel / Tourism", "company_name": "EQS Placements Pvt Ltd", "job_experience": "1 to 6 Yrs", "job_title": "TRAVEL SALES CONSULTANTS WITH AMADEUS or SABRE KNOWLEDGE - GURGAON"}, "other_details": {"Other Skills:": ["travel"], "Department:": ["Reservation / Ticketing", "Tour / Travel Management"], "Industry:": ["Travel / Tourism"], "Skills:": ["tours", "sabre", "sales", "bpo", "amadeus"]}, "topbox_information": {"salary_information": "Rs 2.0  - 5 Lakh/Yr"}, "jd_information": {"description": "TRAVEL SALES CONSULTANTS WITH AMADEUS or SABRE KNOWLEDGE - GURGAON CALL / WHATSAP @ 9990872304&nbsp;WE ARE A PREMIER RESOURCE AUGMENTATION COMPANY WITH TOP OF THE LINE MNC'S AS OUR CLIENTS. OUR EXCELLENT CONVERSION RATE SPEAKS ABOUT OUR PROFESSIONALISM, SPEED OF EXECUTION AND ACCURACY.&nbsp;WE ARE LOOKING FOR BEST TALENT FROM ALL OVER DELHI, NOIDA AND GURGAON TO JOIN AT GURGAON LOCATIONWE ARE HIRING FOR TRAVEL BPO. THEY ARE LOOKING FOR THE PERSON WHO IS HAVING AT LEAST 6 MONTHS OF EXPERIENCE IN TRAVEL SALES (INCLUDES TOUR PACKAGES, TICKETING, RESERVATIONS, ACCOMMODATION, ETC.) ALONG WITH THE WORKING KNOWLEDGE OF AMADEUS or SABRE .POSITION- INBOUND TRAVEL CONSULTANT &ndash; 125 OPENINGSEXPERIENCE &ndash; 6 MONTHS TO 8 YRSPICK AND DROP, ONE TIME DINNER&nbsp;QUALIFICATION-&nbsp;NO BAR&nbsp;DESIRED CANDIDATES PROFILE &ndash;HAVING GOOD SALES EXPERIENCEHAVING EXCELLENT COMMUNICATION SKILLSHAVING RELEVANT EXPERIENCEHAVING GOOD KNOWLEDGE OF AMADEUS or SABER&nbsp;JOB DESCRIPTION-&nbsp;1. LIASING WITH CLIENTS IN PERSON, OVER THE PHONE OR VIA EMAIL TO DISCUSS THEIR TRAVEL REQUIREMENTS.&nbsp;2. ADVISING CLIENTS ON SUITABLE OPTIONS FOR DOMESTIC OR INTERNATIONAL DESTINATIONS, TOURS, ACCOMMODATION, TRANSPORT, INSURANCE AND FARES.&nbsp;3. PREPARING CUSTOMIZED ITINERARIES TO SUIT THE CLIENTS&rsquo; PREFERENCES AND BUDGET.&nbsp;4. MAKING AND CONFIRMING BOOKINGS, OFTEN VIA A GLOBAL DISTRIBUTION SYSTEM (COMPUTERIZED CENTRAL RESERVATION SYSTEM).&nbsp;5. ISSUING TICKETS AND RELEVANT DOCUMENTS.&nbsp;6. PROVIDING UP TO DATE ADVICE ON TRAVEL REGULATIONS INCLUDING VISA AND MEDICAL REQUIREMENTS, BAGGAGE LIMITS, SAFETY AND LOCAL CUSTOMS.&nbsp;7. MODIFYING EXISTING BOOKINGS TO SUIT A CHANGE IN CLIENTS&rsquo; CIRCUMSTANCES.&nbsp;8. RESEARCHING DESTINATIONS AND KEEPING UP TO DATE TRAVEL INDUSTRY NEWS.&nbsp;9. HANDLING COSTING PART.ABHISHEK09990872304PLS. SHARE WITH YOUR FRIENDS AND COLLEAGUES"}, "_id": "7908979"}