{"company_info": {"Company Description": "FIT Specialist - Pune - Kalyani NagarAbout Company The client is the longest established travel company in the world. Its distinguished history began in 1758 when it was appointed as general agents to the regiment of Foot Guards in India under the command of Lord Ligonier. The worldwide offices are located in UK, USA, Japan, Russia, Singapore and Dubai. It has associate offices in Germany, Italy, Spain, South Africa, Sweden and Australia.Location  PuneExperience  2 – 4 YearsFunction  Sales &amp; MarketingVacancy  1Job Description ob ContextMention the roles &amp; responsibilities of the jobholder.1. Overseeing the entire store operations &amp; keeping up with target sale.2. Be the point of contact between Franchisee &amp; C&amp;K3. Timely MIS and Report generation4. Achieve seasonal deal targets5. Providing maximum customer satisfaction by closely interacting customers tounderstand their requirements.6. Ensure complaint resolution within specified time frame.7. store appearance &amp; cleanliness8. Recruitment and training of Franchisee staff9. Relationship management with customers and key accounts.10. All major sales promotions to be highlighted at the store3) Principal Accountabilities1. Overseeing store operations &amp; sales2. Timely MIS and Report generation3. Relationship management4) CompetenciesFunctionalExperience of selling products i.e Group and FIT Packages (International &amp;Domestic).Knowledge about the company’s productsLinguistic exp  Hindi, English, local language and other regional languagesBehaviouralCommunicates effectivelyInterpersonal skillsRelationship managementQualification  Any Graduate + IATA/UFTAA or Diploma in Travel &amp; TourismJob Nature  Full TimeDepartment/Functional AreaMarketing / Communication", "Email": "ultimatehr18@gmail.com", "Company Name": "kamlesh travels", "Telephone": "9820597057"}, "api_data": {"job_location": ["Pune"], "jd_id": "7941367", "job_keywords": ["operations", " promotions", " major", " management", " target", " language", " sales", " general", " languages", " recruitment", " selling", " accounts", " hindi", " english", " training", " behavioural", " mis", " was", " store", " history", "skills", " interpersonal", " relationship"], "job_industry": "Travel / Tourism", "company_name": "kamlesh travels", "job_experience": "2 to 6 Yrs", "job_title": "FIT Specialist - Pune - Kalyani Nagar - tourism industry"}, "other_details": {"Other Skills:": ["skills", "interpersonal", "relationship"], "Department:": ["Marketing / Communication"], "Industry:": ["Travel / Tourism"], "Skills:": ["operations", "promotions", "major", "management", "target", "language", "sales", "general", "languages", "recruitment", "selling", "accounts", "hindi", "english", "training", "behavioural", "mis", "was", "store", "history"]}, "topbox_information": {"salary_information": "Rs 3.0  - 5 Lakh/Yr"}, "jd_information": {"description": "FIT Specialist - Pune - Kalyani NagarAbout Company :The client is the longest established travel company in the world. Its distinguished history began in 1758 when it was appointed as general agents to the regiment of Foot Guards in India under the command of Lord Ligonier. The worldwide offices are located in UK, USA, Japan, Russia, Singapore and Dubai. It has associate offices in Germany, Italy, Spain, South Africa, Sweden and Australia.Location :&nbsp;PuneExperience :&nbsp;2 &ndash; 4 YearsFunction :&nbsp;Sales &amp; MarketingVacancy :&nbsp;1Job Description :ob Context&nbsp;Mention the roles &amp; responsibilities of the jobholder.1. Overseeing the entire store operations &amp; keeping up with target sale.&nbsp;2. Be the point of contact between Franchisee &amp; C&amp;K&nbsp;3. Timely MIS and Report generation&nbsp;4. Achieve seasonal deal targets&nbsp;5. Providing maximum customer satisfaction by closely interacting customers to&nbsp;understand their requirements.&nbsp;6. Ensure complaint resolution within specified time frame.&nbsp;7. store appearance &amp; cleanliness&nbsp;8. Recruitment and training of Franchisee staff&nbsp;9. Relationship management with customers and key accounts.&nbsp;10. All major sales promotions to be highlighted at the store3) Principal Accountabilities&nbsp;1. Overseeing store operations &amp; sales&nbsp;2. Timely MIS and Report generation&nbsp;3. Relationship management4) Competencies&nbsp;Functional&nbsp;Experience of selling products i.e Group and FIT Packages (International &amp;&nbsp;Domestic).&nbsp;Knowledge about the company&rsquo;s products&nbsp;Linguistic exp : Hindi, English, local language and other regional languagesBehaviouralCommunicates effectivelyInterpersonal skillsRelationship managementQualification :&nbsp;Any Graduate + IATA/UFTAA or Diploma in Travel &amp; Tourism&nbsp;Job Nature :&nbsp;Full Time"}, "_id": "7941367"}