{"company_info": {"Company Description": "Arsenius Skill Capital (ASC) is a Management Consulting firm and a No. 1 choice for permanent results that top management prefers. We provide turnkey solution from initial screening to synergy realization. We are ardent believer of guiding and finding values across boundaries, developing insight to act upon, energizing and motivating team to deliver and to sustain success.We are a brain child of a team of young aspiring entrepreneurs with in-depth industry specific knowledge who have joined hands to cater to the Management needs for various industries. With our years of experience and research driven methodology in diverse industry vertical we have developed skills to understand the business in depth, thus able to provide unmatched solution designs. Our team works round the clock to ensure satisfactory deliverables.Our Mission “Improvising Efficiency”Our Values Integrity, Customer Centricity, Accountability &amp; Innovation", "Email": "angee@arseniusskillcapital.com", "Company Name": "Arsenius Skill  Capital Hiring For Corporate &amp; Business Travel", "Telephone": "7506178102"}, "api_data": {"job_location": ["Bangalore", "Navi Mumbai", "Mumbai City", "Delhi"], "jd_id": "7951939", "job_keywords": ["negotiation", " management", " reporting", " slas", " kpi", " crm", "expansion", " relationship", " revenue", " global", " relations", " spend management", " manager", " client", " relation", " customer relationship", " key account management", " supplier", " overseas", " corporate", " coordination", " client servicing"], "job_industry": "Travel / Tourism", "company_name": "Arsenius Skill  Capital Hiring For Corporate & Business Travel", "job_experience": "5 to 7 Yrs", "job_title": "Client Relation Manager - CRM - Business Travel"}, "other_details": {"Other Skills:": ["expansion", "relationship", "revenue", "global", "relations", "spend management", "manager", "client", "relation", "customer relationship", "key account management", "supplier", "overseas", "corporate", "coordination", "client servicing"], "Department:": ["Tour / Travel Guide", "Tour / Travel Management"], "Industry:": ["Travel / Tourism"], "Skills:": ["negotiation", "management", "reporting", "slas", "kpi", "crm"]}, "topbox_information": {"salary_information": "Rs 5  - 9 Lakh/Yr"}, "jd_information": {"description": "Arsenius Skill Capital is Hiring: Client Relation Managers&nbsp;Location: Delhi/ Mumbai / Bangalore&nbsp;CTC: up to 8 lac p.a&nbsp;Industry: Corporate &amp; Business Travel&nbsp;Position: Customer Relationship Management (CRM) &amp; Implementation&nbsp;Job Summary:Responsible for managing all aspects of assigned client accounts to include but not limited to client retention, contract negotiation, implementation and business consolidation, sales of products and services, financials (budgets, billing, payment and profitability), business planning and reviews, establishing relationships with key decision makers in multiple regions, staff development, business continuance and escalation of operational issues.&nbsp;Essential Duties and Responsibilities:1) Establish &amp; maintain relationships:- Responsible for overall relationship with client at multi-national level.- Establish and maintain relationships with key customer decision makers at all levels within the customer organization, including introduction of COMPANY Travel senior management to customer.- Establish and maintain relationships within COMPANY Travel (owned, partners and affiliates) to achieve results for customer.- Develop and maintain strategic supplier relationships- Build an internal network with departments, regional leaders and key support team members to accomplish goals and initiatives that benefit the client and COMPANY- Responsible for the coordination of all central communication across regions for both COMPANY Travel and client's initiatives and interests.- Demonstrate and communicate the value that COMPANY Travel provides to the client- Umbrella policy implementation and communication to all regions, including budgets, SLAs, etc.- Develop Business Plan, implement key deliverables, measure results:- Formulate and manage multi-national business plan with client with the goal of increasing revenues, decreasing cost, better utilizing assets and reducing risk of client attrition:- Develop: Working with client and COMPANY Travel team, identify short-term and long-term objectives for the travel program and outline solutions to achieve objectives, including measurements and timelines.- Implement: Create action plan to implement each program objective with actions and timelines.- Measure and Report Results: Put into place tracking and reporting for each objective and indicator.- Account Reviews: Plan and execute quarterly business review. Plan annual strategic business review. Create actions for deficiencies.&nbsp;New Client Implementations:- Responsible for implementing new client once the client is acquired by sales team- Implementation Tracker: Regular Implementation calls/Meetings to be done with client in accordance to the agreed implementation Plan- Driving Implementation process with the help of various support teams like operations, technology, finance and others- Communication: Update the client implementation to all stakeholders Post Completion&nbsp;Service Level Agreements (SLAs) and/or Key Performance Indicators (KPIs):- Develop: Develop Service Level Agreement for Service, Financial, Management Information reports (MIS), Program Performance, Technology and Communication indicators, as applicable.- Measure and Report: Put into place tracking and reporting for each indicator.- Create and manage business improvement plans, as required.- Crisis Management responsibility, plans and tools.&nbsp;Financial:- Create and manage budgets and financials (includes billing, payment &amp; profitability).- Overall responsibility for profitability of contract.- Responsible for consolidated financial reporting to customer, if needed.- Increase revenues by Up-Sell and Cross-Sell of products and services that meet client's needs.- Negotiate financial terms of the client agreement- Ensure COMPANY Travel is billing for everything allowed by agreement.- Ensure the client is paying in accordance with the agreement&nbsp;Negotiations:- Negotiate client contract terms and manage to all contractual terms- Up-sell and cross-sell products and services that meet client's needs- Introduce consulting services to enhance program&nbsp;Operational &amp; Global Reporting Requirements:- Owner of overall service delivery strategy- Identifies opportunities to use global technology tools and new processes.- Communicates customer operations requirements to all owned, partner and affiliate servicing locations.- Escalates operational issues without personally taking on responsibility of solving the issue.- Develops business continuance plans- Work with client to establish reporting requirements and methods.- Work with Global CDS to ensure that each COMPANY Travel country is providing the required data within the agreed delivery time.&nbsp;Secondary Duties &amp; Responsibilities:- Working with Supplier Relations, evaluate success of client preferred supplier programs, assess and recommend areas for improvement.- Create and execute surveys and present survey results to support program requirements; plan for global traveler satisfaction survey.- Seek out internal and external information to ensure clear understanding of client dynamics and COMPANY Travel solutions.- Organize, prepare and/or participate in customer events/training seminars where appropriate&nbsp;Qualifications- 5+ years of corporate travel industry experience in account management or management role- Experience implementing &amp; managing large market/ global clients- Thorough knowledge of business travel account and operations management- Thorough knowledge of travel industry &amp; travel technology- Ability to travel as required by client portfolioInterested Applicants Call Angee &ndash; 7506178102 or share resume with angee@arseniusskillcapital.com"}, "_id": "7951939"}