{"company_info": {"Company Description": "Company provide travel, tourism related solutions to the free individuals as well as corporate groups. Our company competency lies in designing the best services which is only for you. Agency ensures a vicarious experience of your desired trip before you experience it. To ensure the delivery to be effective and efficient our travel agency involves only the experts from our team who work on their expertise.", "Email": "a2zgroupncr1@gmail.com", "Company Name": "A2Z Hiring Management Solutions Pvt. Ltd.", "Telephone": "9971031879"}, "api_data": {"job_location": ["Delhi"], "jd_id": "7976191", "job_keywords": ["gds", " tourism", " sales", "outbound tours", " consultant", " travel", " hotel", " tour", " holiday packages", " packages", " booking", " travel agent activities"], "job_industry": "Travel / Tourism", "company_name": "A2Z Hiring Management Solutions Pvt. Ltd.", "job_experience": "2 to 4 Yrs", "job_title": "Travel Sales Consultant For Delhi Location (Male/Female)."}, "other_details": {"Other Skills:": ["outbound tours", "consultant", "travel", "hotel", "tour", "holiday packages", "packages", "booking", "travel agent activities"], "Department:": ["Pre-Sales"], "Industry:": ["Travel / Tourism"], "Skills:": ["gds", "tourism", "sales"]}, "topbox_information": {"salary_information": "Rs 1.5  - 2.5 Lakh/Yr"}, "jd_information": {"description": "Job briefWe are looking for a Travel Consultant with great enthusiasm for traveling. You will be responsible for promoting and booking traveling arrangements for clients (individuals or businesses). The goal is to enhance satisfaction and acquire an expanding and dedicated clientele.ResponsibilitiesResearch various destinations and means of travel regarding prices, customs, weather conditions, reviews etc.Diagnose the clients&rsquo; specifications and wishes and suggest suitable travel packages or servicesOrganize travels from beginning to end, through booking tickets and accommodation, securing rental transportation etc.Supply travelers with pertinent information and useful&nbsp;travel/holiday material&nbsp;(guides, maps, event programs etc)Collect deposits and balancesUse promotional techniques and prepare promotional materials to sell itinerary tour packagesHandle unforeseen&nbsp;problems and complaints&nbsp;and determine eligibility&nbsp;for money returnsAttend conferences&nbsp;to&nbsp;maintain familiarity with tourism trendsCreate and update electronic records of clientsMaintain relationships with key personsKeep financial statements and documentsReach the revenue and profit targetsRequirementsProven working experience as a travel consultantExcellent knowledge of traveling software (computer reservations systems, GDS systems and e-travel)Proficiency in English; knowledge of additional languages is an advantageExemplary sales skills and customer oriented approachWell versed in various areas of travel (domestic/international, business/holidays, group/individual etc)Ability to present, persuade and communicate effectivelyDemonstrable ability to handle crisesDegree in Hospitality, Travel, Tourism, Business or relevant fieldCandidates with personal travel experience will be preferred"}, "_id": "7976191"}