{"company_info": {"Company Description": "Arsenius Skill Capital (ASC) is a Management Consulting firm and a No. 1 choice for permanent results that top management prefers. We provide turnkey solution from initial screening to synergy realization. We are ardent believer of guiding and finding values across boundaries, developing insight to act upon, energizing and motivating team to deliver and to sustain success.We are a brain child of a team of young aspiring entrepreneurs with in-depth industry specific knowledge who have joined hands to cater to the Management needs for various industries. With our years of experience and research driven methodology in diverse industry vertical we have developed skills to understand the business in depth, thus able to provide unmatched solution designs. Our team works round the clock to ensure satisfactory deliverables.Our Mission “Improvising Efficiency”Our Values Integrity, Customer Centricity, Accountability &amp; Innovation", "Email": "angee@arseniusskillcapital.com", "Company Name": "Arsenius Skill  Capital Hiring For Travel &amp; Toursim", "Telephone": "7506178102"}, "api_data": {"job_location": ["Navi Mumbai", "Mumbai City"], "jd_id": "8011117", "job_keywords": ["operations", " ota", " management", " sales", "development", " customer", " social media marketing", " service", " business", " travel", " online branding", " otp", " products", " online", " web products", " content strategy"], "job_industry": "Travel / Tourism", "company_name": "Arsenius Skill  Capital Hiring For Travel & Toursim", "job_experience": "3 to 6 Yrs", "job_title": "Online Product Manager - Travel & Toursim"}, "other_details": {"Other Skills:": ["development", "customer", "social media marketing", "service", "business", "travel", "online branding", "otp", "products", "online", "web products", "content strategy"], "Department:": ["Tour / Travel Guide", "Tour / Travel Management"], "Industry:": ["Travel / Tourism"], "Skills:": ["operations", "ota", "management", "sales"]}, "topbox_information": {"salary_information": "Rs 4.0  - 6 Lakh/Yr"}, "jd_information": {"description": "Arsenius Skill Capital is hiring for a leading Travel MNC,&nbsp;Asst Manager/Manager &ndash; Online ProductsLocation: MumbaiCTC: Upto 7 lac p.aDesignation: Assistant Manager / ManagerDepartment: Online ProductsDesired Candidate Profile:Candidates from any Online Travel Portal OTP, managing Domestic &amp; International destinations Products and Operations onlineJob Description:&middot; Monitor performance of holidays on the web&middot; Coordinate with the analytics team to gauge performance&middot; Conduct research on competition and explore new avenues for growth&middot; Liaise with the CC for product requirements&middot; Coordination with content team for product upload and launches&middot; Products designing and contracting&middot; Drive demand for products and monitor campaigns&nbsp;Interested applicants call Angee &ndash; 7506178102 or send in your resume to angee@arseniusskillcapital.com&nbsp;"}, "_id": "8011117"}