{"company_info": {"Company Description": "Arsenius Skill Capital (ASC) is a Management Consulting firm and a No. 1 choice for permanent results that top management prefers. We provide turnkey solution from initial screening to synergy realization. We are ardent believer of guiding and finding values across boundaries, developing insight to act upon, energizing and motivating team to deliver and to sustain success.We are a brain child of a team of young aspiring entrepreneurs with in-depth industry specific knowledge who have joined hands to cater to the Management needs for various industries. With our years of experience and research driven methodology in diverse industry vertical we have developed skills to understand the business in depth, thus able to provide unmatched solution designs. Our team works round the clock to ensure satisfactory deliverables.Our Mission “Improvising Efficiency”Our Values Integrity, Customer Centricity, Accountability &amp; Innovation", "Email": "angee@arseniusskillcapital.com", "Company Name": "Arsenius Skill  Capital Hiring For Ticketing &amp; Resrevations", "Telephone": "7506178102"}, "api_data": {"job_location": ["Navi Mumbai", "Mumbai City"], "jd_id": "8011059", "job_keywords": ["galileo", " iata", " gds", " ticketing", " amadeus", "amendments", " group", " refunds", " reservations", " cancellations", " international", " booking"], "job_industry": "Travel / Tourism", "company_name": "Arsenius Skill  Capital Hiring For Ticketing & Resrevations", "job_experience": "3 to 6 Yrs", "job_title": "Sr. Ticketing & Reservations Executive"}, "other_details": {"Other Skills:": ["amendments", "group", "refunds", "reservations", "cancellations", "international", "booking"], "Department:": ["Reservation / Ticketing", "Tour / Travel Management"], "Industry:": ["Travel / Tourism"], "Skills:": ["galileo", "iata", "gds", "ticketing", "amadeus"]}, "topbox_information": {"salary_information": "Rs 2.5  - 4.0 Lakh/Yr"}, "jd_information": {"description": "Arsenius Skill Capital is Hiring!!!Department: Group Ticketing &amp; ReservationsLocation: MumbaiCTC: up to Rs: 4&nbsp;lac p.a&nbsp;Minimum 36 months experience in International Reservations for Group and FIT packages, Ticketing, Car and Hotel related activities.Must have GDS (Gal / Amadeus / Sabre) knowledge, trained and certified and preferably IATA certified.This position is responsible for the following:&Oslash; Create reservations and ticket issuance in GDS commands/entries for both Group and FIT travelers.&Oslash; Should have knowledge of Queue management, revalidation, and reissues, cancellations, and refunds.&Oslash; Fare comparison and drive savings through low pricing wherever applicable.&Oslash; Should be able to review and audit fares if required.&Oslash; Exposure to Car and Hotel bookings using GDS.&Oslash; Ensure compliance and adherence to process.&Oslash; Willingness to work in shifts and occasionally be able to stretch for long and odd hours if required.Manage operations on the floor.&Oslash; Ensuring availability of staff is maintained above 98%.&Oslash; Ensuring critical to process level metrics are in place.&Oslash; Conduct new hire training on the existing processes.&Oslash; Attending operational or quality meetings as per client schedule.&Oslash; Mentor and assist new hires and team.&Oslash; Report deviations and Act accordingly.&Oslash; Proactively inform manager on challenges faced.Knowledge (What the person must know):&Oslash; Should be able to demonstrate command on domain and provide timely resolution to issues.&Oslash; Ability to demonstrate skill and knowledge on domain specific applications such as GDS.&Oslash; Understanding of various product combinations and should have demonstrated ability to achieve 100% Customer Satisfaction.&Oslash; Demonstrated ability to generate MIS and analytics to business for decision making.&Oslash; Sound knowledge of excel and email communication.&Oslash; Strong oral and written English communication skills (required to interact with internal / external clients).Interested Applicants Call Angee - 7506178102 or share resume with angee@arseniusskillcapital.com&nbsp;"}, "_id": "8011059"}