{"company_info": {"Company Description": "JOB VACANCY IN USAWe offer numerous opportunities for full talented, professional and upbeat people. We value innovative thinking, a strong work ethic and a commitment to safety, and we compensate our team with competitive salaries and benefits packages.Our Organization is an Equal Opportunity Employer. All qualified applicants will receive consideration for employment interested candidate should send CV to our email royalcaribbeancruiseusa@outlook.com", "Email": "royalcaribbeancruiseusa@outlook.com", "Company Name": "Freelancer Niraj Ranjan Tiwari"}, "api_data": {"job_location": ["United States of America"], "jd_id": "8019553", "job_keywords": ["management", " ad", " support", " system", " reports", " bi", " queries", ""], "job_industry": "Travel / Tourism", "company_name": "Freelancer Niraj Ranjan Tiwari", "job_experience": "3 to > 25 Yrs", "job_title": "Payroll Coordinator"}, "other_details": {"Department:": ["Cabin Crew", "Marine Deck Department"], "Industry:": ["Travel / Tourism"], "Skills:": ["management", "ad", "support", "system", "reports", "bi", "queries"]}, "topbox_information": {"salary_information": "Rs 30  - 50 Lakh/Yr"}, "jd_information": {"description": "Coordinate and process employee payrolls bi-monthly.Review payroll reports before transactions to ensure correctness.Maintain payroll system up-to-date and accurate.Process payroll processing including calculations, deposits, withholdings, loans, 401 (k) changes, and PTO balances.Generate periodic and ad-hoc payroll reports to management.Prepare reports required for audit operations.Oversee relocation expenses, stock options, compensations and other benefits for employees.Provide support to HR and payroll teams when requested.Set-up payroll arrangements and tax flings for new employees.Respond to payroll queries and concerns from employees.Prepare employee timesheets, attendance and other documents required for payroll processing.Provide proper response for queries received from IRS, unemployment and revenue offices."}, "_id": "8019553"}