{"company_info": {"Company Description": "HARRY INTERNATIONALstrives to make sure our services are dedicated to support HR solution. Our in-house research and recruiting capabilities are extensive. We follow the best systems &amp; processes in the recruitment industry, and so have the ability to serve our clients the relevant &amp; quality profiles with a minimum lead-time.We are committed for the accurate search &amp; selection of professionals with the help of highly trained search team, widely spread network as well as existing database of skilled and experienced professionals.We specialize in Executive Search/ Middle management/ Board Member &amp; CXO Search. In addition, we have expertise in Mass Hiring or Team Hiring within a speculated time and we take these assignments on a specific &amp; reasonable term unlike general requisitions.For an excellent output in the client side we follow a robust internal process which is time tested and which intertwines the recruiters, leads and directors. We concentrate on research methods, client Confidentiality, Documentation, Strict Timelines, Reporting and Follow up process, constant service feedback.", "Email": "trideep.hr.hi@gmail.com", "Company Name": "harry international", "Telephone": "9227055445"}, "api_data": {"job_location": ["Ahmedabad"], "jd_id": "8019271", "job_keywords": ["front", " tickit bookings", " office"], "job_industry": "Travel / Tourism", "company_name": "harry international", "job_experience": "3 to 8 Yrs", "job_title": "Looking for Booking personnel for Travel company"}, "other_details": {"Other Skills:": ["front", "tickit bookings", "office"], "Industry:": ["Travel / Tourism"], "Department:": ["Tour / Travel Guide", "Reservation / Ticketing"]}, "topbox_information": {"salary_information": "< Rs 50,000  - 1.5 Lakh/Yr"}, "jd_information": {"description": "Hello Job Seekers,&nbsp;Welcome to Harry International,We are getting great openings for Booking personnel for Travel company.&nbsp;Pre-requisites of the vacancy: -1) Graduate/ Post Graduate -BCOM/ BBA/ MBA degree in Marketing or Finance.2) We require personnel with good communication skills in Gujarati, Hindi, English.3) Jobexperience of 3 yearsin service industry.4) Basic Accounting knowledge.&nbsp;Job Description: -&nbsp;1) Walkin passenger's bookings to be made from front office.2) Inbound calls for bookings to be taken with outbound calls to be made to passengers regarding any modification, feedback or marketing of new services to passengers.3) Bus departures to be done by rechecking passengers list before every departure.4) Ticket cancelation querries from customers and API.&nbsp;Experience: -3+ Years in service industryEducation: -Any Graduates (BCOM/ BBA/ MBA degree in Marketing or Finance will be prefferable.)Salary Bar:- 15 to 20 k.Location: -&nbsp;3 different Locations in Ahmedabad.&nbsp;If you are interested in the opportunity send your updated CV with 1 professional photograph on with following Details to apply for the job &amp; can WALK-IN to the following Address with this mail: -Current Salary: -Expected Salary: -Notice Period: -[PLEASE MENTION shine.com as SOURCE &amp; \"APPLICATION FOR RELATIONSHIP MANAGER\" IN SUBJECT.]&nbsp;Thanks &amp; RegardsHARRY INTERNATIONAL(one stop solution consultant)HR Executive: -Trideep Trivedi&nbsp;&nbsp;Corporate Office: -305, Jeet Complex Nr Jain Derasar,Opp Muncipal Market,Above K.B Dresswala,C.G road, Navrangpura, Ahmaedabad - 380009."}, "_id": "8019271"}