{"company_info": {"Company Description": "Corpgen Services is an international recruitment and employment agency based in New Delhi, India. Our team offers high quality services to provide the best outcomes in the recruitment and employment of personnel from a diverse set of business sectors. Our philosophy is to be a win-win or no deal kind of company.When our clients are successful, we are successful!Looking for a good employee is just as difficult as searching for a good employer. When the recruitment process extends over national boundaries and borders, finding the perfect candidate are a real challenge. We at Corpgen know that good quality employees help your business grow. To ensure a streamlined process and quality service for our clients, the recruitment process is the same for every applicant we refer. This also provides our candidates with a consistent level of exceptional service from the Corpgen Recruitment team.Location 29A, Veer Sawarkar Block, Shakkarpur. Nirman Vihar Metro Station", "Email": "gaurav@corpgen.in", "Company Name": "vishwanath freelancer Hiring For Corpgen Services", "Telephone": "9953138012"}, "api_data": {"job_location": ["Delhi"], "jd_id": "8020065", "job_keywords": ["consulting", " english", " marketing", " documentation", " sales", " communication", " insurance", "outbound"], "job_industry": "Travel / Tourism", "company_name": "vishwanath freelancer Hiring For Corpgen Services", "job_experience": "1 to 5 Yrs", "job_title": "Travel Sales Consultant (Domestic)"}, "other_details": {"Other Skills:": ["outbound"], "Department:": ["Sales / BD"], "Industry:": ["Travel / Tourism"], "Skills:": ["consulting", "english", "marketing", "documentation", "sales", "communication", "insurance"]}, "topbox_information": {"salary_information": "Rs 1.5  - 3.0 Lakh/Yr"}, "jd_information": {"description": "Location :&nbsp;New DelhiExperience :&nbsp;1 &ndash; 5 YearsFunction :&nbsp;Sales &amp; MarketingVacancy :&nbsp;8&nbsp;Job Description:Desired Candidate Profile:Outbound sales (travel)-Good communication skill-Self-driven, result-oriented-Computer skills-Business and Selling Skills-Concept Selling -Destination knowledge&nbsp;(domestic)*Receiving calls and providing the passengers with the best possible routeing for their destination and competitive fares available in the market.*Helping clients with&nbsp;travel&nbsp;planning, business packages, vacation packages as well as&nbsp;travel&nbsp;advice &amp; information.*Selling vacation packages including flight, hotel, car and extra activities.*Knowledge of making Itinerary.*Should make&nbsp;travel, accommodation and related bookings.*Confirm bookings and notify clients of luggage limits and insurance requirements.*Issue tickets for&nbsp;travel, accommodation vouchers and all relevant documentation.*Collect payments and maintain records of transactions.&nbsp;&nbsp;Working Days :&nbsp;6 Days a Week (10:00 AM to 7:30 PM)Job Nature :&nbsp;Full Time"}, "_id": "8020065"}