{"company_info": {"Company Description": "PaintMyTrip® is a start-up Online Travel Agency that is registered in Canada and has its branch in India. The objective of the company is to capitalize on the high growth of the travel market in India, slowly widening its scope internationally. The company intends to sell Air/Hotel/Sightseeing/Bus and Car products through its B2B/B2C and affiliate channels, and extend into other niche businesses such as medical, honeymoon and yogic tourism. Service excellence will be key to profitability.", "Company Name": "PaintmyTrip.com OTA Pvt Ltd"}, "api_data": {"job_location": ["Bangalore"], "jd_id": "8024018", "job_keywords": ["bd", " sales", " acquisition", "development", " generating", " lead", " business", " generation", " client"], "job_industry": "Travel / Tourism", "company_name": "PaintmyTrip.com OTA Pvt Ltd", "job_experience": "1 to 4 Yrs", "job_title": "Sales Associate - Tour Packages"}, "other_details": {"Other Skills:": ["development", "generating", "lead", "business", "generation", "client"], "Department:": ["Sales / BD"], "Industry:": ["Travel / Tourism"], "Skills:": ["bd", "sales", "acquisition"]}, "topbox_information": {"salary_information": ""}, "jd_information": {"description": "Designing and administering tour packages on web site. Designing itineraries for domestic &amp; international destinations, according to the customer needs/ requirements. Follow ups with existing and new customers for tourpackages Handling customers related to travel such as tour packages, airlines, hotel bookings, making itineraries &amp; costing for Tours. Attending to customer queries through emails and phones calls. Ability to understand and prepare costing from Supplier/s and provide quotation to Client/s. Processing Bookings by coordinating with hotels and suppliers. Handling Bookings &amp; Documentation. Generate sales leads through various channels (e-mails, phone calls, portal, prospective affiliates, corporate profiles and other media) so that customer base is increased. Maintain e-base of customers, frequent travelers by type, spend etc such that marketing decisions are easily made. Act as quasi sales executive to grow as an individual sales functionary. Updating of packages on the web portal. Continuous research about industry and gather industry &amp; competitor information. Lastly, be proactive, accurate and have attention to detail. Opportunity to grow within the organization quicker than industry standards."}, "_id": "8024018"}