{"company_info": {"Company Description": "InterviewFox is an interview platform connecting employers and job seekers in real-time. Stay Solutions Private Limited uses InterviewFox for its recruitment needs.", "Company Name": "InterviewFox"}, "api_data": {"job_location": ["Delhi"], "jd_id": "8046145", "job_keywords": ["negotiation", " management", " communication", " marketing", " reporting", " sales", " research", " iata", " screening", " intelligence", " amp", " acquisition", "development", " office", " business", " skills", " travel", " direct", " client", " ms", " corporate", " market"], "job_industry": "Travel / Tourism", "company_name": "InterviewFox", "job_experience": "1 to 3 Yrs", "job_title": "Stay Solutions Private Limited - Sales Executive - 1.5 - 3 years - lztaqrnuzl"}, "other_details": {"Other Skills:": ["development", "office", "business", "skills", "travel", "direct", "client", "ms", "corporate", "market"], "Department:": ["Pre-Sales"], "Industry:": ["Travel / Tourism"], "Skills:": ["negotiation", "management", "communication", "marketing", "reporting", "sales", "research", "iata", "screening", "intelligence", "amp", "acquisition"]}, "topbox_information": {"salary_information": "Rs 1.5  - 2.5 Lakh/Yr"}, "jd_information": {"description": "Apply only if you are interested to work in New Delhi/Delhi.Responsibilities:1. Reaching out to new customers and making presentations or pitches out lining the benefits of product/services through direct contact or online selling.2. Plan, Execute &amp; promote the business and achieve the sales targets as per the business plan.3. Review &amp; identify the business gaps and develop the sales promotional activities.4. Identifying sales opportunities through extensive market research.5. Understanding the client requirements and then customizing the product/services as per their needs.6. Achieving sales targets through the acquisition of new clients and growing business from existing clients.7. Remain knowledgeable on products offered and discuss available options. Cross sell products.8. Data reporting to management and gathering market intelligence.9. Ensure high levels of customer satisfaction through excellent sales service.10. Build productive trust relationships with customers.Requirements:1. Strong customer relationship skills.2. Should have good presentation skills, prospecting skills, emphasizing excellence and negotiation skills.3. Must have excellent verbal and written communication skills.4. Superior client acquisition and lead management skills5. Ability to communicate with people at all levels.6. Should be capable of thriving in the competitive markets.7. Confident and authoritative speaker.8. Good time management skills.Note:Candidates with prior Experience in Corporate Sales (Travel Services) will be preferred.Experience in Corporate Hotel Sales is added advantage.Important: Candidates with own bike/car preferred. Should be residing in South Delhi or vicinity preferably.Apply and schedule your pre-screening interview!Stay Solutions Pvt. Ltd, a travel management company established in May,2012 is a one stop shop for all your holiday requirements. We, Stay Solutions Pvt Ltd, are a team of dedicated professionals offering the entire range of travel related services. Registered by the name of Helloholidays.in online, the company is owned by its parent company M/s Nickair Inc which was established in the year 1999 and is accredited from IATA, TAAI, TAFI and UFTA. At Helloholidays.in we provide a comprehensive range for various travel solutions like leisure, group, charters, small business travelers etc backed by real-time travel packages. Since its inception, Stay Solutions Pvt Ltd has grown rapidly, aspiring to emerge as one of the foremost tour and travel companies in India. As fairly young Travel Agents in Delhi, we are flexible, receptive to new ideas and adaptable to our clients needs."}, "_id": "8046145"}