{"company_info": {"Company Description": "Welcome to Shabdi Jobs ServicesShabdi Jobs ServicesComing From The Stable OfShabdi &amp; Zardi Trading &amp; Contracting Co. W.L.L., A Well-Known Conglomerate Of Trading OfStationery Products,Civil Construction&amp;General Cleaning ServicesIn Qatar, It Possesses The Same Client Centric Professionalism And Corporate Culture As Its Parent Company.We Deploy Professional Resources From “Entry Level Till Management / Blue And Brown Collar Categories” Indeed We Are Specialized To Work For NONIT, IT &amp; ITES Industries’ We Do Arrange Interview Campaigns For Direct Hire And Contract Hire Job.For The Individual Client, The Company Seeks To Find The Employer, Who Can Provide A Salubrious Corporate Climate For Development And Growth. Their Goal Congruence Would Pave The Way For Long And Enduring Win-Win Synergy. For The Corporate Client, The Company Will Partner In Bringing In Intellectual Capital For Sustainable Competitive Advantage And Growth.Our Service To The Client Transcends Business Goals And Aims At A Sustainable Symbiotic Relationship.", "Email": "shruti@shabdijobs.com", "Company Name": "Shabdi Job Services", "Telephone": "+919620167861"}, "api_data": {"job_location": ["Ludhiana"], "jd_id": "8059581", "job_keywords": ["logistics", " co", " ticketing", " language", " communication", " national", " documentation", " air", " application", " can", " english", " hindi", "skills", " cold", " visa", " calling"], "job_industry": "Travel / Tourism", "company_name": "Shabdi Job Services", "job_experience": "0 to 1 Yr", "job_title": "Urgent  opening for the post of Back Office Executive"}, "other_details": {"Other Skills:": ["skills", "cold", "visa", "calling"], "Department:": ["Back Office Operations"], "Industry:": ["Travel / Tourism"], "Skills:": ["logistics", "co", "ticketing", "language", "communication", "national", "documentation", "air", "application", "can", "english", "hindi"]}, "topbox_information": {"salary_information": "Rs 2.0  - 2.5 Lakh/Yr"}, "jd_information": {"description": "Job title- BACK OFFICE&nbsp;We have an urgent opening for female candidates(married preferable).&nbsp;Minimum qualification-Graduate in any stream&nbsp;Experience-Only Experienced (minimum 6 months)&nbsp;Responsibilities-&nbsp;&bull; Ability to handle packages (National / International)&bull; Knowledge about national/international vendors for tour packages.&bull; Air Ticketing / hotel bookings&bull; Deals with travel agents or retailers&bull; Making online reservations&bull; Coordinate all travel logistics/Transportation&bull; Guide the travellers through the tour&rsquo;s itinerary&bull; Co-ordinating with clients for visa documentation and application.&bull; Should be able to convert leads and can do chat and voice call with customers.&middot; Be able to interact and convince corporates for make bookings through our travel agency&middot; Cold calling and fixing meetings&nbsp;Skills and competencies-&nbsp;&bull; Have ability to work in team&bull; Good communication skills in English, Hindi and local language&bull; Personally motivated and positive Attitude&bull; Knowledge of computerSalary -15000 per month"}, "_id": "8059581"}