{"company_info": {"Company Description": "Easy Trip Planners Pvt. LtdBackground 2008 Brothers started EaseMyTrip from home-garage in May 2008. Within 3 months they lost all investment (incurring losses due to fraud conducted by some miscreants). To heck with it, they thought, &amp; decided to give it another tryFast-forward 2016 EaseMyTrip is among top-5 travel-portals in India with annual turnover of Rs 1400 crores &amp; 28 offices across the globe. EaseMyTrip is the only travel-company which is non-funded yet profitable, even though all of our foreign-funded competitors are in losses!Unique features of EaseMyTrip, which makes us preferred choice without marketing?1. EaseMyTrip.com is the only portal that doesn't charge convenience-fees on air-tickets, hence everyone at least saves Rs 200 per passenger on air-tickets!2. In order to reduce holiday-cost, EaseMyTrip has its own office, staff, cars &amp; food arrangements in Dubai, Singapore, Thailand, Maldives, Bali &amp; Mauritius3. EaseMyTrip has handpicked &amp; partnered with top 868 hotels across India (avg TripAdvisor ratings for these hotels is 4.68 out of 5). EaseMyTrip only sells these handpicked properties @ unbeatable price4. Using EaseMyTrip mobile app, now airplane co-passengers can chat with each other (even without internet). Passengers are finding travel-buddies &amp; networking on air-plane itself5. To help tourist in cases of emergencies (medical or theft), EaseMyTrip tied-up with 450+ NRIs across every major city in the world. Recently an NRI helped an Indian-tourist, as his daughter needed to be hospitalised at midnight in Budapest", "Company Name": "Easy Trip Planners Pvt. Ltd"}, "api_data": {"job_location": ["Delhi"], "jd_id": "8077280", "job_keywords": ["operations", "Good Communication written  ", "  verbal"], "job_industry": "Travel / Tourism", "company_name": "Easy Trip Planners Pvt. Ltd", "job_experience": "0 to 1 Yr", "job_title": "Hiring for Executive"}, "other_details": {"Other Skills:": ["Good Communication written", "verbal"], "Department:": ["Customer Service (Domestic)"], "Industry:": ["Travel / Tourism"], "Skills:": ["operations"]}, "topbox_information": {"salary_information": ""}, "jd_information": {"description": ""}, "_id": "8077280"}