{"company_info": {"Company Description": "Arsenius Skill Capital (ASC) is a Management Consulting firm and a No. 1 choice for permanent results that top management prefers. We provide turnkey solution from initial screening to synergy realization. We are ardent believer of guiding and finding values across boundaries, developing insight to act upon, energizing and motivating team to deliver and to sustain success.We are a brain child of a team of young aspiring entrepreneurs with in-depth industry specific knowledge who have joined hands to cater to the Management needs for various industries. With our years of experience and research driven methodology in diverse industry vertical we have developed skills to understand the business in depth, thus able to provide unmatched solution designs. Our team works round the clock to ensure satisfactory deliverables.Our Mission “Improvising Efficiency”Our Values Integrity, Customer Centricity, Accountability &amp; Innovation", "Email": "angee@arseniusskillcapital.com", "Company Name": "Arsenius Skill  Capital Hiring For Corporate &amp; Business Travel", "Telephone": "7506178102"}, "api_data": {"job_location": ["Delhi"], "jd_id": "8087955", "job_keywords": ["sas", " system", "gathering", " requirements", " office", " business", " tableau", " analysis", " data mining", " ms", " sql", " r analysis", " data science", " business analysis"], "job_industry": "Travel / Tourism", "company_name": "Arsenius Skill  Capital Hiring For Corporate & Business Travel", "job_experience": "4 to 9 Yrs", "job_title": "Business Analyst"}, "other_details": {"Other Skills:": ["gathering", "requirements", "office", "business", "tableau", "analysis", "data mining", "ms", "sql", "r analysis", "data science", "business analysis"], "Department:": ["Statistics / Analytics"], "Industry:": ["Travel / Tourism"], "Skills:": ["sas", "system"]}, "topbox_information": {"salary_information": "Rs 4.0  - 8 Lakh/Yr"}, "jd_information": {"description": "&nbsp;Arsenius Skill Capital is Hiring Asst Manager: Business Analytics&nbsp;Location: Delhi&nbsp;CTC Up to 8 lac p.a&nbsp;Industry: Corporate &amp; Business Travel&nbsp;Manages a team of business data analysts that use business data and statistical methods to provide insight into business performance and suggest area and methods of improving operations.Implements and oversees the analytical approaches and methodologies. Presents insight and recommendations to management for decision making and strategic planning.Controls and develops internal/external information sources for business analysis.Manages subordinate staff in the day-to-day performance of their jobs. True first level manager.Ensures that project/department milestones/goals are met and adhering to approved budgets.Has full authority for personnel actions. Extensive knowledge of department processes.Typically requires 5 years&rsquo; experience in the related area. Of this, 1 to 3 years supervisory experience required.If you have solid industry experience, we&rsquo;d like to meet you.Your goal will be to help our business use data to drive high performance and quality.Job brief&nbsp;We are looking for a Business Analytics Manager to organize our analytics function and manage our team of analysts. You will implement tools and strategies to translate raw data into valuable business insights.In this role, we expect you to have strong logical reasoning skills and business intelligence. The ability to communicate effectively is very essential.&nbsp;Responsibilities:&middot; Understand business needs and objectives&middot; Develop strategies for effective data analysis and reporting&middot; Define company-wide metrics and relevant data sources&middot; Select, configure and implement analytics solutions&middot; Lead and develop a team of data analysts&middot; Oversee all analytics operations to correct discrepancies and ensure quality&middot; Extract reports from multiple sources (e.g. operations, IT, customer feedback)&middot; Build systems to transform raw data into actionable business insights&middot; Apply industry knowledge to interpret data and improve performance&middot; Keep abreast of industry news and trends&nbsp;Requirements:&middot; Proven experience as an Analytics Manager or Data Scientist&middot; Solid experience in data analysis and reporting; industry experience is a plus&middot; Background in market research and project management&middot; Knowledge of Excel, R and SQL; familiarity with business intelligence tools (e.g. Tableau, SAS)&middot; Bachelor's / PG degree&nbsp;Interested Applicants call Angee - 7506178102 or email resume angee@arseniusskillcapital.com"}, "_id": "8087955"}