{"company_info": {"Company Description": "Apex visas-India s Fastest Visa Provider, is a Pune based company that has endeavored since its inception in 2010 to bring a one stop solution to your visa related queries, Our  services which include - Overseas Education assistance, Visitor Visa, Business Visa, FOREX, Ticketing, Tour Packages etc.A.V. Immigration &amp; Career Consultancy Pvt. Ltd. (Apex Visas) is Pune based company that has endeavored since its inception in 2010 to bringa one stop solutionto all your migration related queries.We are well known in the immigration circle for our specialized services &amp; are praised by our clients for enriching their experience in Visa facilitation. We have a global presence with a strategic network of own and associate offices in 25 locations across the world. We are planning to extend our services to over 50 offices by the year end.The core team of Apex Visas is spearheaded by people with more than twenty years of domain expertise. They have precision knowledge in the fields of Immigration, Visa processing and other related services. To ensure prompt and hassle free services we have a team of handpicked executives who go through rigorous &amp; in-depth training on country specific immigration and visa processing norms &amp; rules to arm them with the requisite knowledge. Our executives have thorough knowledge &amp; hands-on experience in dealing with immigration procedures followed by Embassies &amp; High Commissions.Once you register you are assigned a case-officer who will guide you through the entire application process and assist you at every stage. They work in tandem with you to complete the process on time ensuring successful results.Just walk into any of our offices around the globe and you can talk to our counsellor to learn more about the country of your interest. With our tailor made solutions, you will have a flexibility to choose the right package that is both appropriate and affordable.", "Email": "hr3@apexvisas.com", "Company Name": "A V Immigration and Careers Consultancy Private Limited", "Telephone": "7219216918"}, "api_data": {"job_location": ["Pune"], "jd_id": "8087663", "job_keywords": ["administration", "reception", " office", " ms", " desk", " front", " entry", " data"], "job_industry": "Travel / Tourism", "company_name": "A V Immigration and Careers Consultancy Private Limited", "job_experience": "1 to 4 Yrs", "job_title": "Urgent Opening For Front Office Executive in Pune"}, "other_details": {"Other Skills:": ["reception", "office", "ms", "desk", "front", "entry", "data"], "Department:": ["Data Entry", "Front Office / Receptionist"], "Industry:": ["Travel / Tourism"], "Skills:": ["administration"]}, "topbox_information": {"salary_information": "< Rs 50,000  - 2.0 Lakh/Yr"}, "jd_information": {"description": "Job Description :&nbsp;- Attending Incoming &amp; Outgoing calls with proper etiquettes and maintaining records for them- Responding the telephonic call and carry out the conversations politely and timely manner- Handling multiple telephone lines in timely manner and direct the calls to the concerned person / extension- Differentiating the incoming calls and walk-ins and handle them appropriately- Greeting and assisting visitors and Guests- To sort out incoming mails at enquiry inbox and distribute to the concerned Department / Executive and responding them in case of customer enquiries- Maintenance of Attendance Register and keeping a track on Outdoor Duties of the Executives / Staff- To do the data entry, prepare presentations, make reports whenever required by the team- Maintaining Courier Register."}, "_id": "8087663"}