{"company_info": {"Company Description": "Rocking Tripswww.rockingtrips.comRockingTrips, India's Fastest Growing Travel Company, was started with small dedicated team of three friends, and now company has stretched it’s branches from Kashmir to Kerala and was well established in 2014 with expert travel consultants. RockingTrips.com is based in Delhi, India. It is started to promote the Tourism, to make people happy, and enjoy their happy moments. RockingTrips.com is a certified Travel company with Customer satisfaction rating of 91%. Rocking Trips serves the worldwide customers, and is one of the best travel companies for all the domestic destinations, as well as international like Bali, Singapore, Malaysia, Thailand, Hong Kong, Dubai, Mauritius, Maldives, Australia, New Zealand, Europe and much more.", "Email": "akshay.mishra@rockingtrips.com", "Company Name": "RT Tourism", "Telephone": "7065009301"}, "api_data": {"job_location": ["Noida", "Delhi"], "jd_id": "8089697", "job_keywords": ["operations", " ticketing", "reservations", " travel", " agency"], "job_industry": "Travel / Tourism", "company_name": "RT Tourism", "job_experience": "1 to 3 Yrs", "job_title": "Travel Consultant"}, "other_details": {"Other Skills:": ["reservations", "travel", "agency"], "Department:": ["Pre-Sales", "Tour / Travel Guide"], "Industry:": ["Travel / Tourism"], "Skills:": ["operations", "ticketing"]}, "topbox_information": {"salary_information": "Rs 2.0  - 3.0 Lakh/Yr"}, "jd_information": {"description": "Conducting sales of International / Domestic Holiday packagesDesigning itineraries, vacation packages, costing and hotel bookingMonitoring competitors activities and collecting dataError free Updating of the bookingsDesired Candidate Profile skillQualification: GraduationEnthusiastic with Good Communication Skills.Good knowledge of destinations, suppliers &amp; hotels.Client handling skills, itinerary making &amp; costing, selling of packages.Should be highly sales and service orientedLeadership Skills: Would have leadership skill to take the ownership of the assigned task."}, "_id": "8089697"}