{"company_info": {"Company Description": "We are one of the growing full service Recruitment Solutions in India.Waays &amp; Solutions is  specialized in  Human Resource service provider offering Manpower recruitment services to major Corporate &amp; MNC’s in India.We recruit across a wide range of industries and at all position levels.Our primary activity is Permanent staff recruitment for either single, large volume or ongoing staffing requirements.We recruit at all employment levels from junior to senior and across a broad range of employee categories and sectors.", "Email": "hr6waysandsolution@gmail.com", "Company Name": "waays and solutions Pvt. ltd.", "Telephone": "9920152145"}, "api_data": {"job_location": ["Nashik"], "jd_id": "8099527", "job_keywords": ["management", " marketing", " atl", " sales", " budget", " communication", " btl", " retail", " telemarketing", "development", " vendor", " business", " office", " digital", " affiliate", " ms", " team"], "job_industry": "Travel / Tourism", "company_name": "waays and solutions Pvt. ltd.", "job_experience": "3 to 8 Yrs", "job_title": "Assistant Marketing Manager"}, "other_details": {"Other Skills:": ["development", "vendor", "business", "office", "digital", "affiliate", "ms", "team"], "Department:": ["Marketing / Communication"], "Industry:": ["Travel / Tourism"], "Skills:": ["management", "marketing", "atl", "sales", "budget", "communication", "btl", "retail", "telemarketing"]}, "topbox_information": {"salary_information": "Rs 2.0  - 4.5 Lakh/Yr"}, "jd_information": {"description": "Opening for Assistant Marketing Manager for our leading Tour and Travel company-FEMALE OnlySkills Required:Designation: Asst. Marketing Manager Planning:Keenly conceptualize various strategic and tactical marketing plans Marketing Budget Management:Manage marketing budget for around 1 Cr per annum Affiliate Marketing:Manage affiliations with Brands, Malls, and Retail Brand outlets. Experiential Marketing:Conceptualize creative marketing ideas and drive them to successful execution through teams, vendors, and marketing agencies.Activations Management: Manage footfalls at sales venues by driving and overseeing activations in malls, retail outlets, exhibitions, trade fairs, hotels restaurants, corporates, residential societies, and schools.Vendor Management / Agency Management:Manage vendors and marketing agencies, cost negotiations and payments. Team Management:Manage and drive Ideation teams, creative teams, activation teams and telemarketing teams towards company's goals. Media Mix Management: Manage activations brand awareness BTL and 360-degree media integration techniques.Marketing Communications Management:Review marketing communication and creative briefs for ATL, BTL, and Digital Marketing.Interested candidates can send their updated resumes at mehr6waysandsolution@gmail.com. you can also refer this job profile to friends.Thank you.Regards,Neha(HR executive)"}, "_id": "8099527"}