{"company_info": {"Company Description": "InterviewFox is an interview platform connecting employers and job seekers in real-time. Stay Solutions Private Limited uses InterviewFox for its recruitment needs.", "Company Name": "InterviewFox"}, "api_data": {"job_location": ["Delhi"], "jd_id": "8105135", "job_keywords": ["tours", "international tour packages", " outbound leisure holidays", "  outbound travels", " selling skills", "  leisure packages", "  outbound tour packages", "  international holidays", "  holiday packages selling", " travel packaes", "  international tours", "  outbound packages", " sales skills", "  domestic tours", " tours executive", " tour packages", "  outbound tours selling"], "job_industry": "Travel / Tourism", "company_name": "InterviewFox", "job_experience": "1 to 3 Yrs", "job_title": "Stay Solutions - Tours Executive - Domestic & Outbound - 1 - 3 yrs - lzuu8emjzl"}, "other_details": {"Other Skills:": ["international tour packages", "outbound leisure holidays", "outbound travels", "selling skills", "leisure packages", "outbound tour packages", "international holidays", "holiday packages selling", "travel packaes", "international tours", "outbound packages", "sales skills", "domestic tours", "tours executive", "tour packages", "outbound tours selling"], "Department:": ["Reservation / Ticketing"], "Industry:": ["Travel / Tourism"], "Skills:": ["tours"]}, "topbox_information": {"salary_information": ""}, "jd_information": {"description": "Apply only if you are interested to work in New Delhi/Delhi.Applicant will be responsible for selling Holidays Packages: Domestic &amp; OutboundDomestic/Outbound Tour Executive:1. Must have good knowledge of INDIAN / INTERNATIONAL destinations in detail.2. Responsibility for domestic package/Hotel/Air/Cab/Train/Bus booking.3. Receiving calls/emails and providing the clients with the best possible routing for their destination and competitive fares available in the market.4. Designing itineraries, hotel booking &amp; costing.5. Contracting with hotels.6. Managing suppliers and effectively communicating with them in order to get timely confirmations.7. The candidate should be well versed with the operational aspect of the booking.8. Capable to Web queries and walk-in clients queries.9. Make professional, accurate, cost effective travel arrangements for clients while providing excellent customer service.10. Helping clients with travel planning, business packages, vacation packages as well as travel advice &amp; information.11. Selling vacation packages including flight, hotel, car and extra activities.12. Maintaining high materialization ratio along with quality control.13. Coordinate with multiple departments to ensure quick resolution for the customer.14. Build an excellent business relationship with customer groups, peers, and vendors.15. Ensure latest updated policies, procedures, desk Instructions are read &amp; complied.16. Handling and resolving customer queries/issues pertaining to hotel/package/air/ or any other relevant reservation.Apply and schedule your pre-screening interview!Stay Solutions Pvt. Ltd, a travel management company established in May,2012 is a one stop shop for all your holiday requirements. We, Stay Solutions Pvt Ltd, are a team of dedicated professionals offering the entire range of travel related services. Registered by the name of Helloholidays.in online, the company is owned by its parent company M/s Nickair Inc which was established in the year 1999 and is accredited from IATA, TAAI, TAFI and UFTA. At Helloholidays.in we provide a comprehensive range for various travel solutions like leisure, group, charters, small business travelers etc backed by real-time travel packages. Since its inception, Stay Solutions Pvt Ltd has grown rapidly, aspiring to emerge as one of the foremost tour and travel companies in India. As fairly young Travel Agents in Delhi, we are flexible, receptive to new ideas and adaptable to our clients needs."}, "_id": "8105135"}