{"company_info": {"Company Description": "&nbsp;I would like to introduce our company,&nbsp;CROWN CONSULTANTS&nbsp;which has been in the business of providing placement services.We have a well-established track record and our services have always met with great customer satisfaction.Since, the people chosen to work in that enterprise determine 95 percent of the success of any enterprise, the role of recruitment consultants, becomes very important. We are focused on helping our clients in their recruitment process right from writing the job descriptions through to finally making their hiring decisions.At crown consultants, we are the team of highly professional people from Management, IT, Pharma, Banking &amp; Insurance,Marketing,FMCG and BPO Agriculture Sectors. We always believe in establishing long-term relationships and are therefore transparent in dealings with others.&nbsp;&nbsp;", "Email": "hr2.crown@gmail.com", "Company Name": "Crown Consultants", "Telephone": "9041022920"}, "api_data": {"job_location": ["Mohali"], "jd_id": "8116769", "job_keywords": ["finance", "control", " team handling", " financial"], "job_industry": "Travel / Tourism", "company_name": "Crown Consultants", "job_experience": "15 to 20 Yrs", "job_title": "We are hiring Chief Finance Officer for Immigration company"}, "other_details": {"Other Skills:": ["control", "team handling", "financial"], "Department:": ["Finance / Accounts / Tax"], "Industry:": ["Travel / Tourism"], "Skills:": ["finance"]}, "topbox_information": {"salary_information": "Rs 20  - 30 Lakh/Yr"}, "jd_information": {"description": "Greetings from Crown Consultants!!!Note- We don't charge anything from candidates.We are hiring Chief Finance Officer for an Immigration company.Experience-15 yrs.Qualification- CASalary- 2.0 to 2.5 Lac per monthLocation- MohaliEligibility Criteria-Should be a CAShould have vendor Management ExperienceShould have Team Handling ProfileShould be from Banking, Financial, Insurance (BFSI) Background.Interested candidates send their cv's at hr2.crown@gmail.comRegardsHarpreet Kaur9041022920"}, "_id": "8116769"}