{"company_info": {"Company Description": "We are one of the growing full service Recruitment Solutions in India.Waays &amp; Solutions is  specialized in  Human Resource service provider offering Manpower recruitment services to major Corporate &amp; MNC’s in India.We recruit across a wide range of industries and at all position levels.Our primary activity is Permanent staff recruitment for either single, large volume or ongoing staffing requirements.We recruit at all employment levels from junior to senior and across a broad range of employee categories and sectors.", "Email": "hr3waysandsolution@gmail.com", "Company Name": "waays and solutions Pvt. ltd.", "Telephone": "7045787497"}, "api_data": {"job_location": ["Navi Mumbai", "Mumbai City"], "jd_id": "8121801", "job_keywords": ["marketing", " sales", " delivery", " state", " communication", " b2c", "development", " business", " office", " skills", " direct", " presentations", " ms"], "job_industry": "Travel / Tourism", "company_name": "waays and solutions Pvt. ltd.", "job_experience": "1 to 3 Yrs", "job_title": "Sales Executive"}, "other_details": {"Other Skills:": ["development", "business", "office", "skills", "direct", "presentations", "ms"], "Department:": ["Sales / BD", "Field Sales Executive"], "Industry:": ["Travel / Tourism"], "Skills:": ["marketing", "sales", "delivery", "state", "communication", "b2c"]}, "topbox_information": {"salary_information": "Rs 2.0  - 4.0 Lakh/Yr"}, "jd_information": {"description": "Job Description:Qualification:Min Graduation&nbsp;Experience: Min 1 yearDesignation: Sales Executive/ Sr. Sales Executive/ Direct Sales ManagerType of Employment:Permanent onroll EmploymentProfile onuses:&middot; Responsible for handling the direct sale at the prospects site&middot; Generation/ souring of prospects appointments for the sales&middot; Effective delivery of the sales presentations at the prospects at his location&middot; Handling the direct meetings, exhibition sales, web leads etc&middot; Handling the HFRP (Happy Family Reference Programme)&middot; Capable to handle the customer issues/ escalations effectively&middot; Good in the B2C sale that&rsquo;s to say CDSO (Customer Direct Sales Officer) profile&nbsp;&nbsp;Job Specification:&middot; Must be preferably male with &lsquo;Go Getter&rsquo; attitude&middot; Must have potentials to turn prospect into customer&middot; Must be good in interpersonal relations&middot; Flexible to travel across state on average frequency as per the appointments&middot; Pleasant personality &amp; excellent in communication skills&middot; Sound knowledge about the local Market&middot; Should be highly enthusiastic, diligent and excellent to work for long tenure&middot; Have strong Decision making abilitiesJob Location: VashiWeekly off: Any day bet Monday to ThursdayCompensation:Max CTC Rs. 4.5Lpa + heavy Incentives + ReimbursementInterested candidates can forward their Updated resumes on hr3waysandsolution or can contact me for more details.Regards,Afsha7045787497&nbsp;&nbsp;"}, "_id": "8121801"}