{"company_info": {"Company Description": "Arsenius Skill Capital (ASC) is a Management Consulting firm and a No. 1 choice for permanent results that top management prefers. We provide turnkey solution from initial screening to synergy realization. We are ardent believer of guiding and finding values across boundaries, developing insight to act upon, energizing and motivating team to deliver and to sustain success.We are a brain child of a team of young aspiring entrepreneurs with in-depth industry specific knowledge who have joined hands to cater to the Management needs for various industries. With our years of experience and research driven methodology in diverse industry vertical we have developed skills to understand the business in depth, thus able to provide unmatched solution designs. Our team works round the clock to ensure satisfactory deliverables.Our Mission “Improvising Efficiency”Our Values Integrity, Customer Centricity, Accountability &amp; Innovation", "Email": "angee@arseniusskillcapital.com", "Company Name": "Arsenius Skill  Capital", "Telephone": "7506178102"}, "api_data": {"job_location": ["Mumbai City"], "jd_id": "8126597", "job_keywords": ["gds", " ticketing", " bpo", " catering", " amadeus", " galileo", " abacus", "saber", " process", " travel", " domestic ticketing", " worldspan", " ticket booking", " international ticketing", " reservations ticketing"], "job_industry": "Travel / Tourism", "company_name": "Arsenius Skill  Capital", "job_experience": "1 to 5 Yrs", "job_title": "Ticketing & Reservations Executves"}, "other_details": {"Other Skills:": ["saber", "process", "travel", "domestic ticketing", "worldspan", "ticket booking", "international ticketing", "reservations ticketing"], "Department:": ["Reservation / Ticketing"], "Industry:": ["Travel / Tourism"], "Skills:": ["gds", "ticketing", "bpo", "catering", "amadeus", "galileo", "abacus"]}, "topbox_information": {"salary_information": "Rs 1.5  - 3.5 Lakh/Yr"}, "jd_information": {"description": "Arsenius Skill Capital is for a Leading Travel MNC on direct company PayrollWe are Hiring for Globally Renowned Travel MNCCompany Profile: We are Hiring for a Reputed Multi National Travel Company catering to Domestic and International Clients.* MALE CANDIDATES PREFFERED FOR THIS PROFILERotational Shifts (7am to 4pm, 2 pm to 11pm, 10.30pm to 7.30 am)Positions: Ticketing &amp; Reservations &ndash; &ldquo;Travel / Airline Process&rdquo;Job Description:We are Hiring for 24*7 Inbound Customer Service &amp; Ticketing Department for Corporate Travel NRI Division, the job requires prior work experience and knowledge &nbsp;in Ticketing &amp; Reservations in any travel or airline processCandidate Profile:&bull; Minimum 6 months experience in Reservations, Ticketing for a Travel Process or Airline Process&bull; Customer Centric (Excellent Communication Skills)&bull; HSC or Graduates&bull; Candidates willing to work rotational shiftsany GDS Experience Required (Amadeus, Galileo, Saber, Abacus Etc- Should have created PNR, issued tickets, cancellations, Refund, ReissuanceLocation: Andheri (E) MumbaiRemuneration: up to 3 lac .p.a + Night Allowance + Incentives and BenefitsInterested candidates call Angee at 7506178102or send in your resume to angee#arseniusskillcapital.comShare this mail with all who may benefitArsenius Skill Capital ~ Routing Skill to Opportunities&nbsp;"}, "_id": "8126597"}