{"company_info": {"Company Description": "We are pleased to introduce our company Global Connections promoted by a group of seasoned HRD professionals. We are involved in manpower placement and Head hunting in Junior, Middle and Senior management, up to CEO levels in various functional disciplines from Last 5 Years In India &amp; Abroad. We have an excellent data bank &amp; we are a team of young, enthusiastic and qualified professionals having a corporate HR experience of more than 10 years. We are highly innovative and sincere in delivering the quality results in best possible time line, thereby becoming the most respected and effective recruitment / search firm for Permanent/Temporary placements in the IT/Non-IT and IT enabled industry. We are focused on delivering complete quality solutions for organizational Human Resource needs. We cater to the manpower requirements in various types of industries including Manufacturing, Automobile, Chemicals, Electronic Equipments, Home Appliances, Financial Services/Banks ,Pharmaceuticals, FMCG, Telecom, Steel and Power, Oil &amp; Gas, Banks, Insurance ,IT, Telecom and Hospitality sectors Pan India. We are providing complete HR Solutions; Head hunting, Background verification, Placements, Outsourcing Services and Training &amp; Development.We have Pan India database and we have fulfilled the requirements across pan India.Why Global Connections Manpower·     Global Connections is one of the fastest growing Manpower Recruitment firm started Operation In 2009·     We have well-trained recruiters to headhunting  profiles having 55 Recruiters Pan India working for different profiles·     We are Having Our Own Job Portal Global Job Alerts Having More Then 3 Million Database And Operational Globally·     We have 6.9 million+ active Profiles  and Working in 10 Leading City In India And 4 In Abroad Globally·     Turnaround time for sourcing profiles is between 4 hours to 72 hours, depending up on the positions.·     More than 22000 placements till date in Different ProfilesCurrently we are serving over 750 + Companies,", "Email": "successseeker680@gmail.com", "Company Name": "Global Connections Manpower.", "Telephone": "9990399035"}, "api_data": {"job_location": ["Noida"], "jd_id": "8126295", "job_keywords": ["marketing", " consulting", " sales", " english", ""], "job_industry": "Travel / Tourism", "company_name": "Global Connections Manpower.", "job_experience": "1 to 3 Yrs", "job_title": "Travel Sales Consultant"}, "other_details": {"Department:": ["Reservation / Ticketing", "Tour / Travel Guide"], "Industry:": ["Travel / Tourism"], "Skills:": ["marketing", "consulting", "sales", "english"]}, "topbox_information": {"salary_information": "Rs 2.0  - 3.0 Lakh/Yr"}, "jd_information": {"description": "Job DescriptionDiagnosing clients' specifications and wishes and suggesting suitable travel packages Organizing travels from beginning to end, including&nbsp;tickets&nbsp;, accommodation and transportation Supplying travelers.Handle Inbound Calls &amp; Query from Domestic customers.Knowledge of travel online booking tools.Well versed with Domestic Travel Industry.Minimum 6 Month of Travel Industry work Experience.Salary:&nbsp;INR 1, 20,000 - 3, 00,000 P.AIndustry:&nbsp;Travel / Hotels / Packages / AirlinesFunctional Area -&nbsp;Customer Service, OperationsRole Category: VoiceDesired Candidate Profile:-Should have Min 6 Month yrs of experience in airline&nbsp;ticketing&nbsp;&amp; fulfillment Should be able to do up selling to increase sales Primarily Evening shift but should be flexible for 24*7 Provide quality service to the customer &amp; focus on First Call ResolutionKnowledge:&nbsp;Domestic Travel MarketKey Skills: Good communication skill, Presentable &amp; hard workingExperience:1-3 years.Job Location: NoidaGender: AnyEducation-UG: Any Graduate - Any SpecializationPG: Any PostgraduateTO FIX UR APPOINTMENT CALL MISS POOJA: 9990399035."}, "_id": "8126295"}