{"company_info": {"Company Description": "Somya Info Edge Services Private LimitedSomya Infoedge Private Limited was incorporated under the companies act, 1956. Our company has the reputation of India’s premier on-line internet company in many esteemed fields like Education, Recruitment, Health Mantra, Matrimony, Classified, E-Commerce, Real estate, Social Initiative, IT &amp; Digital Marketing, Social networking, Social concern and other related services. Somya Infoedge Pvt. Ltd. is another star in glazing sector of online service provider. Our only intension is to touch your life with our heart warming and dedicated services and leave you with bundle of joy and happiness. Our core inspiration is the ever expanding market of internet and its huge potentiality. That’s the reason we stepped out in this business and ever since we started the business, our clients have been biggest motivators and supporters, they have acted as the pillars of our strengths. We are the company with the view to tap into the growing Indian internet market, undertakes investments in early stage companies / start-up ventures. Somya Infoedge has established and currently maintains a network of 4 websites as a division of this company, which is summarized here on somyainfoedge.in", "Email": "hrpanthereye175@gmail.com", "Company Name": "Somya Info Edge Services Private Limited Hiring For Panther Eye Pvt. Ltd.", "Telephone": "9119801803"}, "api_data": {"job_location": ["Kanpur", "Lucknow", "Delhi"], "jd_id": "8144427", "job_keywords": ["accounting", " tally", " accounts", "account", " handling", " concepts"], "job_industry": "Travel / Tourism", "company_name": "Somya Info Edge Services Private Limited Hiring For Panther Eye Pvt. Ltd.", "job_experience": "2 to 4 Yrs", "job_title": "Urgent Hiring candidates for Accountant"}, "other_details": {"Other Skills:": ["account", "handling", "concepts"], "Department:": ["Tour / Travel Management", "Reservation / Ticketing"], "Industry:": ["Travel / Tourism"], "Skills:": ["accounting", "tally", "accounts"]}, "topbox_information": {"salary_information": "Rs 3.0  - 6 Lakh/Yr"}, "jd_information": {"description": "Account executive job descriptionMeeting clients to discuss their advertising needsWorking with account planners to devise a campaign that meets the client's brief and budgetPresenting campaign ideas and costings to clientsBriefing the creative team who will produce the advertsNegotiating with clients, solving any problems and making sure deadlines are metChecking and reporting on the campaign's progressKeeping in contact with the client at all stages of the campaignManaging the account's budget and invoicing the clientMaking 'pitches' to win new businessThe finer details.Your basic working hours will be between 9am and 6pm, Monday to Friday, although you may have to work longer if you have deadlines to meet.You will be office-based but will also travel to meet clients.Advertising is a very popular career among graduates, and competition for jobs is strong. Jobs are advertised in the national and trade press, on the IPA website and by specialist recruitment agencies. However, not all jobs are advertised, so you could also find work by approaching agencies directly, and through making contacts in the industry.With experience, you could progress to become an account manager or&nbsp;director. Eventually you could become an agency director, or set up&nbsp;your own agency."}, "_id": "8144427"}