{"company_info": {"Company Description": "Azaan Services is a business and process driven company that seeks to offer top - class Talent building resources to strengthen organisational skill sets and employment relationships.Azaan Services is one of the India's upcoming Manpower, Placement Consultancy Service, and a one-stop recruitment solution for providing you with the best industry talents across a range of sectors.Placing talented people in the right positions is the key to attaining outstanding business and we believe in leaving no stone unturned in meeting our valued clients' expectations. Our business approach is 100% tailored as per clients' needs. We believe in understanding our clients' business and corporate ethos by building long-term relationships with them, taking time and care to understand their strategies, goals and their recruitment needs.Today, Azaan Services has gained the respect of job seekers and employers alike by matching the right people with the right employers. We believe, it's just because of our committed, Client–centric approach that presently we have earned a large clientele of reputed and esteemed clients. Today, Azaan Services has gained a considerable network of contacts and a database of quality Candidates, which has been generated through job-portals, networking, referrals and advertising across a wide range of media. Our strength lies in our pool of candidates in the local market.", "Email": "azaanservices@gmail.com", "Company Name": "Azaan Services Hiring For Yatra.com", "Telephone": "9911912462"}, "api_data": {"job_location": ["Noida", "Ghaziabad", "Gurugram", "Faridabad", "Delhi"], "jd_id": "8144269", "job_keywords": ["reissue tickets", " travel outbound", " book tickets", " travel cal", " travel process", " ticketing process", " travel bpo", " ticket", " flight reservation", " international tickets", " ticket booking", " travel international", " international flights", " reissuing ticket", " career in travel", " ticket reservation", " international travel", " travel issues", " international booking", " reissuing tickets"], "job_industry": "Travel / Tourism", "company_name": "Azaan Services Hiring For Yatra.com", "job_experience": "2 to 7 Yrs", "job_title": "TRAVEL CONSULTANT/TRAVEL COUNSELOR"}, "other_details": {"Other Skills:": ["reissue tickets", "travel outbound", "book tickets", "travel cal", "travel process", "ticketing process", "travel bpo", "ticket", "flight reservation", "international tickets", "ticket booking", "travel international", "international flights", "reissuing ticket", "career in travel", "ticket reservation", "international travel", "travel issues", "international booking", "reissuing tickets"], "Industry:": ["Travel / Tourism"], "Department:": ["Reservation / Ticketing", "Tour / Travel Guide"]}, "topbox_information": {"salary_information": "Rs 2.0  - 5 Lakh/Yr"}, "jd_information": {"description": "TRAVEL EXPERT/TRAVEL COUNSELOR&nbsp;SALARY UPTO 45 THOUSAND!!!Carlson WagonlitJob Description:*GDS Process/Flight Ticket Booking/Hotel Packages.*Handling Customer Care related issues, Reservations, Web site support, Bulk bookings, Notification, Rebooking, Credit card verification, Queues Management,*Handling email management for all corporate and travel agent queries.*Providing customer support over the call through inbound calling.*Refunds Ticketing International ticketing travel agent GDS issuance reissuance.*Create PNRs, make reservations, and sell airline, hotels, car rental packages.*Collect payment for transportation and accommodations from customer.&nbsp;*Converse with customer to determine destination, mode of transportation, travel dates, financial considerations, and accommodations required.*&nbsp;Compute cost of travel and accommodations, using calculator, computer, carrier tariff books, and hotel rate books, or quote package tour's costs.*&nbsp;Book transportation and hotel reservations, using computer terminal or telephone.*Plan, describe, arrange, and sell itinerary tour packages and promotional travel incentives offered by various travel carriers.*Provide travel information, such as local customs, points of interest, or foreign country regulations.*Create PNRs, make reservations, and sell airline, hotels, car rental packages.*Proven ability to create domestic &amp; international travel arrangements including air, hotel and ground transportation.*Understanding and expertise in international travel requirements, i.e. visas, passports and immunization requirements; excellent communication skills and follow through required to advise clients of those requirements.*Turkish Airlines/indgo airlines/united airlines/air canada&nbsp;and many more (fresher can also apply).*Experience in the travel industry/Hotel Industry (Preferred)*Fresher/Undergrad/Graduate/Dropout/anybody can apply.*Salary: 13K - 45K Inhand apart from *Incentive &amp; Bonus**Providing US/UK/24*7 Shift*5 Days Working*Both Sides Pick n Drop+ Meals.Other companies: HCL/IBM/Quatrro/IBM/Arvato etc.(No Registration Charges)"}, "_id": "8144269"}