{"company_info": {"Company Description": "", "Email": "profiles@paramountconsulting.in", "Company Name": "Paramount Consulting"}, "api_data": {"job_location": ["Bangalore"], "jd_id": "8158445", "job_keywords": ["operations", " training", " management", " java", " exchange", " communication", " focus", " bpo", " sales", " delivery", " consulting", "customer", " development", " service", " office", " ms", " time"], "job_industry": "Travel / Tourism", "company_name": "Paramount Consulting", "job_experience": "4 to 8 Yrs", "job_title": "Team Leader"}, "other_details": {"Other Skills:": ["customer", "development", "service", "office", "ms", "time"], "Department:": ["Back Office Operations"], "Industry:": ["Travel / Tourism"], "Skills:": ["operations", "training", "management", "java", "exchange", "communication", "focus", "bpo", "sales", "delivery", "consulting"]}, "topbox_information": {"salary_information": ""}, "jd_information": {"description": "Dear Candidate&nbsp;Hope you are doing well&nbsp;We came across your profile on the portal &amp; wanted to share a role with you&nbsp;Location &ndash; Bangalore&nbsp;ClientFounded in 1974, CLIENTis the worldwide leader in vacation exchange and a provider of travel services to businesses and consumers. Through a unique breadth and scope of accommodation choices, types and locations, CLIENToffers its global community of more than three million members quality vacation experiences at more than 4,300 resorts worldwide through its week-for-week and points-based exchange networks. As a growth partner, CLIENTdelivers customized, integrated and results-driven solutions to meet the needs and exceed the expectations of its affiliates and consumers worldwide. CLIENTis a division of the CLIENTGlobal Vacation Network, the global leader in non-hotel leisure accommodations with exclusive access for specified periods to more than 60,000 vacation properties in more than 100 countries.&nbsp;TEAM LEAD&nbsp;Has an overall responsibility for the development and delivery of histeam in the Call Centre, as well as leading a team or teams on a day-to-day basis ensuring daily, weekly and monthly targets andbenchmarks are met.&nbsp;POSTING DESCRIPTION &ndash; RESPONSIBILITIES:&Oslash; Support team and each team member to ensure that skill and knowledge training and development is delivered in an on-going, measurable and consultative manner.&Oslash; Cultivate a team work environment and provide all members of the team the opportunity to influence the work environment and the results of the team and organization through a structured communication process.&Oslash; Co-ownership of the Sales Centre objectives with other team members, taking into consideration what the business is pursuing in terms of structure, culture, cost management &amp; revenue generation&nbsp;&Oslash; Create and develop a team that is recognized both internally and externally as empowered, commercially astute, and highly professional.&Oslash; Willing to Travel PAN India for member meets /attend member meets.&Oslash; Establish &amp; maintain professional relationship within and outside the company&nbsp;&nbsp;REQUIRED QUALIFICATIONS&middot; Graduate / Post Graduate with 5 - 7 yrs. of experience in an international / domestic call centre / BPO with sales background.&middot; Experience in handling a team of 15 - 20 member sales team.Should have done field sales or managed sales operations.&middot; Demonstrated leadership in a dynamic, leisure-related environment with specific focus on revenue achievement and consultant skills and knowledge development.&middot; Proven sales management ability with a strong customer service focus.Ability to work under pressure and to deadlines.&middot; Demonstrated initiative in introducing new concepts or ideas.Proven time management skills.&middot; Candidates with work experience in Travel/ Tourism, Holiday company, Hotel or Airlines industry preferred&nbsp;&nbsp;Lots more to discuss once we are in talks.Would appreciate if you could let us know your interest in the opening &amp; share your updated word format resume so that we can start a dialogue.However, in case if you are not excited to explore &amp; understand more about these openings; would request you to share some references who may like to explore these openings with us.Your help is highly appreciatedLooking forward to your quick responseBest regardsJyotiParamount Consulting&nbsp;"}, "_id": "8158445"}