{"company_info": {"Company Description": "", "Email": "profiles@paramountconsulting.in", "Company Name": "Paramount Consulting"}, "api_data": {"job_location": ["Bangalore"], "jd_id": "8158423", "job_keywords": ["correspondence", " reporting", " shorthand", " stenography", " communication", " who", " appointments", " management", " can", " mail", " amp", " bookkeeping", " servicing", " screening", "statements", " business", " office", " secretaryship", " ms", " time", " financial"], "job_industry": "Travel / Tourism", "company_name": "Paramount Consulting", "job_experience": "7 to 12 Yrs", "job_title": "Executive Secretary"}, "other_details": {"Other Skills:": ["statements", "business", "office", "secretaryship", "ms", "time", "financial"], "Department:": ["Secretary / PA / Steno"], "Industry:": ["Travel / Tourism"], "Skills:": ["correspondence", "reporting", "shorthand", "stenography", "communication", "who", "appointments", "management", "can", "mail", "amp", "bookkeeping", "servicing", "screening"]}, "topbox_information": {"salary_information": ""}, "jd_information": {"description": "Dear Candidate&nbsp;Hope you are doing well&nbsp;We came across your profile on the portal &amp; wanted to share a role with you&nbsp;Location &ndash; Bangalore&nbsp;ClientFounded in 1974, CLIENTis the worldwide leader in vacation exchange and a provider of travel services to businesses and consumers. Through a unique breadth and scope of accommodation choices, types and locations, CLIENToffers its global community of more than three million members quality vacation experiences at more than 4,300 resorts worldwide through its week-for-week and points-based exchange networks. As a growth partner, CLIENTdelivers customized, integrated and results-driven solutions to meet the needs and exceed the expectations of its affiliates and consumers worldwide. CLIENTis a division of the CLIENTGlobal Vacation Network, the global leader in non-hotel leisure accommodations with exclusive access for specified periods to more than 60,000 vacation properties in more than 100 countries.&nbsp;Executive Secretary&nbsp;This is a key role, supporting the Managing Director of India. Reporting to the Managing Director you will be required to support the day to day work of MDs Office&nbsp;POSTING DESCRIPTION &ndash; RESPONSIBILITIES:&Oslash; Maintaining Managing Directors agenda and assist in planning appointments, board meetings, conferences etc.&Oslash; Arrange and confirm appointments.&Oslash; Organizing and servicing meetings (producing agendas and taking minutes)&Oslash; Attending meetings and keep minutes.&Oslash; Create, transcribe, and distribute meeting agendas and minutes&Oslash; Coordination with various departments for all support required for smooth functioning of the office&Oslash; Receiving and screening phone calls and redirecting them when appropriate&Oslash; Handle and prioritize all outgoing or incoming correspondence (e-mail, letters, packages etc.)&Oslash; Make travel arrangements for Managing Director&Oslash; Handle confidential documents ensuring they remain secure&Oslash; Prepare invoices or financial statements and provide assistance in bookkeeping&Oslash; Prepare and maintain MDs expense report.&nbsp;&Oslash; Establish &amp; maintain professional relationship within and outside the company&nbsp;&nbsp;REQUIRED QUALIFICATIONSGraduation is mustShould have excellent verbal and written communication skillsPresentable and confidentHigh degree of multi-tasking and time management capabilityExcellent written and verbal communication skillsIntegrity and professionalismProficiency in MS Office&nbsp;&nbsp;Lots more to discuss once we are in talks.Would appreciate if you could let us know your interest in the opening &amp; share your updated word format resume so that we can start a dialogue.However, in case if you are not excited to explore &amp; understand more about these openings; would request you to share some references who may like to explore these openings with us.Your help is highly appreciatedLooking forward to your quick responseBest regardsSameerParamount Consulting&nbsp;"}, "_id": "8158423"}