{"company_info": {"Company Description": "AVA Placement Services is one of the experienced and reputed placement and recruitment agencies with their office in Noida, Greater Noida, Delhi &amp; NCR . As an efficient company, we provide wide range of services to the clients and candidates, which include Placement Services, Manpower Recruitment, Career Consultant and HR Services. We have maintained a well-organized database in India, to meet the manpower requirements from Power Industries, Automobiles Industries, FMCG, Engineering industries and others, anywhere across the country. Because of our vast experience in the industry we are able to match the right candidate with the most suitable job. We offer our services on timely basis and make sure that we are able to meet the expectation of the client and candidates both. We also have a branch in Gurgaon to offer quick and efficient solution to clients and candidates both.", "Email": "avaplacement1@gmail.com", "Company Name": "Aba placement", "Telephone": "8178973905"}, "api_data": {"job_location": ["Delhi"], "jd_id": "8168319", "job_keywords": ["marketing", " selling", " sales", "travel", " outbound"], "job_industry": "Travel / Tourism", "company_name": "Aba placement", "job_experience": "1 to 5 Yrs", "job_title": "Travel Sales Consultant (Domestic)"}, "other_details": {"Other Skills:": ["travel", "outbound"], "Department:": ["Sales / BD", "Sales Executive (Broadband)"], "Industry:": ["Travel / Tourism"], "Skills:": ["marketing", "selling", "sales"]}, "topbox_information": {"salary_information": "Rs 1.0  - 3.0 Lakh/Yr"}, "jd_information": {"description": "Travel Sales Consultant (Domestic)About Company :It is one stop online travel portal that offers complete travel related services with comfort and satisfaction. Our highly reliable travelling professionals have attained essential marketplace to become leaders in travelling industry. We provide unique opportunities to our industry suppliers like airlines, hotels and transporters to explore and consumers to discover different places, while ensuring satisfaction at both ends. Our unique travelling solutions add extra miles to one&rsquo;s journey.Location :&nbsp;New DelhiExperience :&nbsp;1 &ndash; 5 YearsFunction :&nbsp;Sales &amp; MarketingVacancy :&nbsp;8Job Description :&nbsp;Job Description:Desired Candidate Profile:Outbound sales (travel)-Good communication skill-Self-driven, result-oriented-Computer skills-Business and Selling Skills-Concept Selling -Destination knowledge&nbsp;(domestic)*Receiving calls and providing the passengers with the best possible routeing for their destination and competitive fares available in the market.*Helping clients with&nbsp;travel&nbsp;planning, business packages, vacation packages as well as&nbsp;travel&nbsp;advice &amp; information.*Selling vacation packages including flight, hotel, car and extra activities.*Knowledge of making Itinerary.*Should make&nbsp;travel, accommodation and related bookings.*Confirm bookings and notify clients of luggage limits and insurance requirements.*Issue tickets for&nbsp;travel, accommodation vouchers and all relevant documentation.*Collect payments and maintain records of transactions.&nbsp;&nbsp;Working Days :&nbsp;6 Days a Week (10:00 AM to 7:30 PM)Job Nature :&nbsp;Full Time&nbsp;&nbsp;Interested candidate kindly send in your resume to avaplacement1@gmail.comVikas Mishra8178973905&nbsp;"}, "_id": "8168319"}