{"company_info": {"Company Description": "BookMyTourNow is India's leading online travel company founded in the year 2014. It started with offline Holiday Packages and Hotel bookings and has an online marketplace today. BookMyTourNow is the only travel-company which is non-funded yet profitable, even though all of our foreign-funded competitors are in losses! BookMyTourNow is the consumer brand of India's leading online travel company EELYSIUM INFOTAINMENT &amp; TECHNOLOGIES LLP. We strive to maintain an open culture where everyone is a hands-on contributor and feels comfortable sharing ideas and opinions. Our team spends hours designing each new feature and obsesses about the smallest of details. Created to empower the Indian traveller with instant booking and comprehensive choices, It aimed to offer a range of best-value products and services along with cutting-edge technology and dedicated round-the-clock customer support.After consolidating its position in the market as a brand recognised for its reliability and transparency, BookMyTourNow followed its success in India after starting operations in 2014.With the foresight to seize the opportunities in the domestic travel market, brought on by a slew of new airlines, BookMyTourNow offered travellers the convenience of online travel bookings at rock-bottom prices. Rapidly, BookMyTourNow became the preferred choice of millions of travellers who were delighted to be empowered by a few mouse clicks!BookMyTourNow ’s rise has been lead by the vision and the spirit of each one of its employees, for whom no idea was too big and no problem too difficult. With untiring innovation and determination,BookMyTourNow proactively began to diversify its product offering, adding a variety of online and offline products and services.BookMyTourNow also stayed ahead of the curve by continually evolving its technology to meet the ever changing demands of the rapidly developing global travel market.Steadily establishing itself across India and the world, BookMyTourNow simultaneously nurtured the growth of its offline businesses like its franchises and affiliates simultaneously, augmenting the brand’s already strong retail presence further. It is a one-stop-travel-shop that offers the broadest selection of travel products and services in India.BookMyTourNow ’s Products• International and Domestic Air Tickets, Holiday Packages and Hotels• Domestic Bus• Private Car and Taxi Rentals• Visa Support• Travel Insurance• B2B and Affiliate Services", "Company Name": "BookMyTourNow"}, "api_data": {"job_location": ["Noida"], "jd_id": "8169424", "job_keywords": ["cold calling ", "   negotiation ", "   c", "Area Mapping ", "   prospecting ", "   closing ", " p", " ate HR team members ", "   consultants"], "job_industry": "Travel / Tourism", "company_name": "BookMyTourNow", "job_experience": "3 to 6 Yrs", "job_title": "Travel Advisor"}, "other_details": {"Other Skills:": ["Area Mapping", "prospecting", "closing", "p", "ate HR team members", "consultants"], "Department:": ["Reservation / Ticketing"], "Industry:": ["Travel / Tourism"], "Skills:": ["cold calling", "negotiation", "c"]}, "topbox_information": {"salary_information": ""}, "jd_information": {"description": ""}, "_id": "8169424"}