{"company_info": {"Company Description": "Arsenius Skill Capital (ASC) is a Management Consulting firm and a No. 1 choice for permanent results that top management prefers. We provide turnkey solution from initial screening to synergy realization. We are ardent believer of guiding and finding values across boundaries, developing insight to act upon, energizing and motivating team to deliver and to sustain success.We are a brain child of a team of young aspiring entrepreneurs with in-depth industry specific knowledge who have joined hands to cater to the Management needs for various industries. With our years of experience and research driven methodology in diverse industry vertical we have developed skills to understand the business in depth, thus able to provide unmatched solution designs. Our team works round the clock to ensure satisfactory deliverables.Our Mission “Improvising Efficiency”Our Values Integrity, Customer Centricity, Accountability &amp; Innovation", "Email": "angee@arseniusskillcapital.com", "Company Name": "Arsenius Skill  Capital Hiring For Travel &amp; Toursim", "Telephone": "7506178102"}, "api_data": {"job_location": ["Gurugram", "Delhi"], "jd_id": "8173147", "job_keywords": ["gds", " testing", " integration", " reports", " galileo", " mis", " documentation", "phases", " product testing", " acceptance", " gds testing", " commercial technology", " application intergration"], "job_industry": "Travel / Tourism", "company_name": "Arsenius Skill  Capital Hiring For Travel & Toursim", "job_experience": "2 to 5 Yrs", "job_title": "Executive Commercial Technology  - Travel & Tourism"}, "other_details": {"Other Skills:": ["phases", "product testing", "acceptance", "gds testing", "commercial technology", "application intergration"], "Department:": ["Application Programming / Maintenance", "Reservation / Ticketing"], "Industry:": ["Travel / Tourism"], "Skills:": ["gds", "testing", "integration", "reports", "galileo", "mis", "documentation"]}, "topbox_information": {"salary_information": "Rs 3.0  - 6 Lakh/Yr"}, "jd_information": {"description": "Arsenius Skill Capital is Hiring for a Leading Travel MNC in Corporate &amp; Business Travel&nbsp;Position: Executive Commercial TechnologyLocation: GurugramCTC: 6 lac p.aExp: 4 yrs in the Travel IndustryEducation: Graduation is mandatory&nbsp;Roles &amp; Responsibilities:&nbsp;&bull; Possess good knowledge of GDS (Galileo) and must have good travel background&bull; Responsible for looking after all the applications and tools being used by operational teams&bull; Responsible for the documentation of business needs/requirements and testing requirements&bull; Conduct testing before implementation of new applications &amp; tools&bull; Assists the team with daily support issues&bull; Assists in the analysis of underlying issues arising from investigations into requirements.&bull; Involved in system and user acceptance testing phases, Product and GDS Integration&nbsp;&nbsp;Interested applicants call Angee &ndash; 7506178102 or share your resume with angee@arseniusskillcapital.com&nbsp;"}, "_id": "8173147"}