{"company_info": {"Company Description": "COMPANY PROFILEWelcome to the world ofCareer Belay,a one of its kind “One Stop Shop” for all the HR Solutions under one roof, the intent of helping out small and medium size companies to set up best practises in HR. The idea of forming this end-to-end, one stop HR firm, had the genesis in the word“Career Belay.", "Email": "career@belaycareer.com", "Company Name": "Career Belay Solution Pvt. Ltd.", "Telephone": "9599001285"}, "api_data": {"job_location": ["Delhi"], "jd_id": "8188839", "job_keywords": ["sales", "communication skills"], "job_industry": "Travel / Tourism", "company_name": "Career Belay Solution Pvt. Ltd.", "job_experience": "0 to 3 Yrs", "job_title": "Sale Executive"}, "other_details": {"Other Skills:": ["communication skills"], "Department:": ["Tour / Travel Management"], "Industry:": ["Travel / Tourism"], "Skills:": ["sales"]}, "topbox_information": {"salary_information": "< Rs 50,000  - 2.5 Lakh/Yr"}, "jd_information": {"description": "Skill set - Sales professional in travel agency domain . A very good understanding of travel agency back office processes &amp; pains . Technology savvy . Experience should either be in a B2B travel agency / OTA selling XML or white labelling solutions to other travel agencies OR working in a travel technology solution retailing company in sales profile selling technology solutions to travel agencies .Education - Graduates / post graduates in accounting with professional qualifications in Sales discipline shall be preferred .Gender - Both male / female candidates eligibleSoft Skills - Excellent dressing sense , excellent written &amp; spoken english , excellent presentation skillsTravelling - Job entails casual travellingSales Tools - Candidates MUST have sales tools viz laptops , dongles , bike or any other two wheeler.Compensation - For sales executives 2 to 2.5 Lacs pa on fixed / variable pattern based on minimum monthly performance (MMP). Additional incentives on achievements beyond MMP . Additional reimbursements are fixed fuel ( in Ltrs ) per month and for mobile ."}, "_id": "8188839"}