{"company_info": {"Company Description": "Arsenius Skill Capital (ASC) is a Management Consulting firm and a No. 1 choice for permanent results that top management prefers. We provide turnkey solution from initial screening to synergy realization. We are ardent believer of guiding and finding values across boundaries, developing insight to act upon, energizing and motivating team to deliver and to sustain success.We are a brain child of a team of young aspiring entrepreneurs with in-depth industry specific knowledge who have joined hands to cater to the Management needs for various industries. With our years of experience and research driven methodology in diverse industry vertical we have developed skills to understand the business in depth, thus able to provide unmatched solution designs. Our team works round the clock to ensure satisfactory deliverables.Our Mission “Improvising Efficiency”Our Values Integrity, Customer Centricity, Accountability &amp; Innovation", "Email": "angee@arseniusskillcapital.com", "Company Name": "Arsenius Skill  Capital Hiring For Corporate Travel Services", "Telephone": "7506178102"}, "api_data": {"job_location": ["Bangalore", "Chennai", "Navi Mumbai", "Thane", "Mumbai City", "Delhi"], "jd_id": "8190149", "job_keywords": ["management", " sales", "development", " customer", " business travel", " business", " service", " corporate travel desk", " area sales", " corporate travel", " corporate sales", " travel implant", " territory sales", " travel desk sales", " b2b sales", " corporate selling", " regional sales", " travel sales"], "job_industry": "Travel / Tourism", "company_name": "Arsenius Skill  Capital Hiring For Corporate Travel Services", "job_experience": "5 to 10 Yrs", "job_title": "Manager Corporate Sales - Implant, Visa, Forex, Ticketing"}, "other_details": {"Other Skills:": ["development", "customer", "business travel", "business", "service", "corporate travel desk", "area sales", "corporate travel", "corporate sales", "travel implant", "territory sales", "travel desk sales", "b2b sales", "corporate selling", "regional sales", "travel sales"], "Department:": ["Pre-Sales", "Sales / BD"], "Industry:": ["Travel / Tourism"], "Skills:": ["management", "sales"]}, "topbox_information": {"salary_information": "Rs 5  - 12 Lakh/Yr"}, "jd_information": {"description": "Arsenius Skill Capital has Urgent requirement for Corporate SalesPosition:&nbsp;Corporate SalesDesignation: ManagerCompensation:&nbsp; 12 Lacs P.A.Location: Mumbai / Bengaluru /Delhi / ChennaiJob role:&nbsp;This Job profile requires candidates to build strong Clients relations, manage overall functionality to improve corporate Sales &amp; Operations. This profile requires customer centric professionals to acquire new accounts and manage end to end travel planning for Corporate&nbsp;Candidate Profile:Graduates or MBA Preferable in Tourism, with 5 years of minimum experience in the given role handling Corporate Marketing or Sales of Travel Products (Implant/Forex / Visa) to corporatesJob Responsibilities:&nbsp;&middot; Achieve budgeted sales targets for Corporate Division&nbsp;&middot; Add new corporate accounts to data base&nbsp;&middot; Conduct and Manage BD activities&nbsp;&middot; Mentor Teammates to achieve the budget&nbsp;&middot; Should be knowledgeable of the current market standards&nbsp;&middot; Network with industry stake holders&nbsp;&middot; Monitor best practices Marketing &amp; sales Practice&nbsp;&middot; Planning &amp; Strategizing Marketing strategies for Corporate Clients&nbsp;&middot; Implant, Visa, Forex product development&nbsp;&middot; Product &amp; Advertisement development and Liaison with Airline and Marketing Campaigns&nbsp;&middot; Co-ordination of critical deals with International Delegates&nbsp;&middot; Identifying Business opportunities and do effective market penetration&nbsp;&middot; Capturing the market share with constant efforts in building sustained customer relationship&nbsp;&middot; Ensuring effective closure of Leads generated by converting them into business&nbsp;&middot; Building Brand Recall in the minds of the customersInterested candidates may share their CV at angee@arseniusskillcapital.com or call on 7506178102&nbsp;"}, "_id": "8190149"}