{"company_info": {"Company Description": "ACCURATE VISION CONSULTANCYIs one of the leading innovators in the Recruitment and Human Resource Domain. Established by Industry professionals, ACCURATE VISION CONSULTANCY has been serving the business interests in the region India. ACCURATE VISION CONSULTANCY has worked with the very best in terms of talent which in turn has enabled our valued clients across  to scale new heights. ACCURATE VISION CONSULTANCY have  its on talented and experienced consultants and have been providing consultancy on a host of HR services for both shot term and long term projects.ACCURATE VISION CONSULTANCYHas provided the mandated workforce for IT &amp; NON-IT , BPO &amp; KPO, Retail &amp; Consumer, Market Research and Banking, Finance Services &amp; Insurance  &amp; other Sectors .We get talents through Campus recruitments, Professional Websites (linked-In) well reputated study Institutes &amp; other well known Sectors.We are active in the India market and have provided workforce for a wide variety of clients from different industries. We have employed specialists from the various industry segments such as FMCG and Retail, Manufacturing, Infrastructure, IT and NON- ITES sectors..ACCURATE VISION CONSULTANCYHas also initiated training modules in coordination with our clients for all categories of the workforce from the top level executives to the floor level employees. We also initiate training programs for the fresh talent that has to be inducted.", "Email": "accurate.vision.consultancy@gmail.com", "Company Name": "accurate vision consultancy", "Telephone": "9560149228"}, "api_data": {"job_location": ["Delhi"], "jd_id": "8199565", "job_keywords": ["ticketing", " amadeus", "front", " reservations", " ms", " office"], "job_industry": "Travel / Tourism", "company_name": "accurate vision consultancy", "job_experience": "0 to 5 Yrs", "job_title": "TRAVEL RESERVATION EXECUTIVE (TICKETING & HOTEL BOOKINGS)"}, "other_details": {"Other Skills:": ["front", "reservations", "ms", "office"], "Department:": ["Reservation / Ticketing", "Tour / Travel Management"], "Industry:": ["Travel / Tourism"], "Skills:": ["ticketing", "amadeus"]}, "topbox_information": {"salary_information": "Rs 2.0  - 2.5 Lakh/Yr"}, "jd_information": {"description": "DEAR CANDIDATES,WE ARE HAVING URGENT OPENING OF TRAVEL RESERVATION EXECUTIVES FOR ONE OF OUR ESTEEMED CLIENT BASED IN DELHI (OKHLA) LOCATION.OUR CLIENT HAVE A GOOD PRESENCE IN THE MARKET OF TOUR &amp; TRAVEL INDUSTRY.BEST ENVIRONMENT FOR WORK.OFFICE TIMINGS 10:00 A.M. TO 06:00 P.M.&nbsp;JOB TITTLE :- TRAVEL RESERVATION EXECUTIVEKRA / JOB RESPONSIBILITIES FOR ALL POSTS1. Managing large amounts of incoming calls and customer inquiries2. Generating sales leads3. Knowledge of Travel Industry4. Identifying and assessing customers&rsquo; needs to achieve satisfaction5. Build sustainable relationships and trust with customer accounts through open and interactive communication6. Provide accurate, valid and complete information by using the right methods/tools7. Meet personal/customer service team&nbsp;sales targets and call handling quotas8. Handle customer complaints, provide appropriate solutions and alternatives within the time limits; follow up to ensure resolution9. Keep records of customer interactions, process customer accounts and file documents10. Take the extra mile to engage customers11. Follow communication procedures, guidelines and policies12. Must be graduate or under graduate13. Having sales Experience ( preferred for upselling candidate)14. Aiming to achieve daily targets.15. Actively seeking out new sales opportunities through cold calling16. Fast learner and passion for sales&nbsp;EXPERIENCE NEEDED ( 01 YEAR TO MAXIMUM)&nbsp;SALARY PACKAGE :- RS. 18,000/- TO RS. 22,000/- PER MONTHCANDIDATES ARE REQUESTED TO NOT SEND ME YOUR RESUME ON MY EMAIL-ID.CALL DIRECT ON MY GIVEN BELOW MOBILE NUMBER FOR FIXED UP YOUR INTERVIEW SCHEDULE BECAUSE THE POSITIONS IS ARE ON URGENT BASIS.MY MOBILE NUMBER FOR FIXED UP YOUR INTERVIEWS IS 9560149228THANKS &amp; REGARDSMANISH KUMARHR- HEAD (RECRUITMENT)ACCURATE VISION CONSULTANCYMOBILE :- 9560149228( WE ARE FROM THE JOB PLACEMENT COMPANY, WE HIRE CANDIDATES FOR THE THE COMPANIES)( WE DON'T TAKE ANY CHARGES/REGISTRATION FEES FROM THE CANDIDATES &amp; THE COMPANY TO WHOM WE RECRUIT THE PERSON WILL ALSO NOT TAKE ANY CHARGES FROM THE CANDIDATES)"}, "_id": "8199565"}