{"company_info": {"Company Description": "Villa World agreegators Pvt. Ltd. are to make inventive, quality-driven association which is moderate and makes a superior, secure career &amp; way of life for the individuals wishing to settle abroad. We guarantee to be models of magnificence and procedures. To give quality driven services to customers intrigued to migrate, travel or visit anyplace in the world. Services that are quick and guarantee results; we prepare and continually update our team to give the best conceivable services to our customers clients. What makes us stand separated is not simply our committed group of employees; who Endeavour to furnish our customers with the best answer for every one of their concerns &amp; for the basic reason that we regard each of our customers clients as special. We guarantee you fancied results inside of the base time span at the most sensible costs.", "Email": "veronica@agreegators.com", "Company Name": "Villa World agreegators Pvt. Ltd", "Telephone": "9205245638"}, "api_data": {"job_location": ["Delhi"], "jd_id": "8218871", "job_keywords": ["advisory", " documentation", " communication", "documenation filing", " visa processing", " visa counselling", " assistant", " travel", " documantation manager", " consutant ", " overseas", " visa filing"], "job_industry": "Travel / Tourism", "company_name": "Villa World agreegators Pvt. Ltd", "job_experience": "0 to 3 Yrs", "job_title": "Vacancies for Documentation Manager"}, "other_details": {"Other Skills:": ["documenation filing", "visa processing", "visa counselling", "assistant", "travel", "documantation manager", "consutant", "overseas", "visa filing"], "Department:": ["Back Office Operations", "Operations Management / Process Analysis"], "Industry:": ["Travel / Tourism"], "Skills:": ["advisory", "documentation", "communication"]}, "topbox_information": {"salary_information": "Rs 1.5  - 2.5 Lakh/Yr"}, "jd_information": {"description": "Visa Officers Required for a Leading Immigration CompanyGood communication skillsExperience in similar field requiredShould be able to handle clients over the phone and in personHandling client queries over the phone and in meetings &amp; emailsDaily followup with the clientsEscalation handlingclient retaining"}, "_id": "8218871"}