{"company_info": {"Company Description": "TripSolutionOnline.comis an online travel booking portal of Aall Solution Trip India Private Limited &amp; company is established in January 2015.The company is providing its clients with hassle free services especially in travel industry. The company today has grown in prominence to become one of the leading Travel Company. In  a  quest to provide best-in-class services, our team continuously strives to add more products &amp; services giving our clients numerous options for selecting their dream leisure &amp; vacations.VisionFor a tour and travels company, we do pretty much everything – from booking hotel rooms and flights to offering international vacation packages, as well as helping you locate the most popular travel destinations in India. In addition, we not only deal in economical international vacation packages, but also specialize in customized tourist destination packages within India.We are no ordinary tour operator in India. We know that time is in short supply for everyone, and that’s why we strive harder each day to make that one vacation you take or that one business conference you attend as comfortable and memorable as we possibly can. Our aim is to not provide you with just any package that fits your budget, but to provide you an experience that you’ll cherish for years to come.The objective is to get you the best for every penny’s worth, because for us, booking your vacation or blocking dates for an official trip aren’t just business transactions, rather opportunities to delight you. You see, we believe that happy customers make happy companies. And we practice it too. And that’s where the difference lies - between us and the other travel agencies in India.MissionTo make the travel experience of every individual completely worry free by providing services that are innovative to provide our client the highest standard of services wherein each and every individual availing our services is a happy and satisfied customer.", "Email": "vinodjha_hrd@yahoo.co.in", "Company Name": "tripsolutiononline.com", "Telephone": "9993994513"}, "api_data": {"job_location": ["Pune"], "jd_id": "8234653", "job_keywords": ["marketing", " management", " sales", "development", " channel", " business"], "job_industry": "Travel / Tourism", "company_name": "tripsolutiononline.com", "job_experience": "0 to 5 Yrs", "job_title": "Territory Sales Officer - B2B- PUNE"}, "other_details": {"Other Skills:": ["development", "channel", "business"], "Department:": ["Sales / BD"], "Industry:": ["Travel / Tourism"], "Skills:": ["marketing", "management", "sales"]}, "topbox_information": {"salary_information": "Rs 1.0  - 2.0 Lakh/Yr"}, "jd_information": {"description": "The primary role of the TSM/TSO is to prospect for new clients/Franchise/Travel Agents by networking, references, cold calling,advertising or other means of generating interest from potential clients. They must then plan persuasive approaches andpitches that will convince potential clients to do business with the company. They must develop a rapport with new clients, andset targets for sales and provide support that will continually improve the relationship. They are also required to grow andretain existing accounts by presenting new solutions and services to clients.TSM/TSO work with mid and senior levelmanagement, marketing, and technical staff. He/she may manage the activities of others responsible for developing businessfor the company. Strategic planning is a key part of this job description, since it is the TSM/TSO&rsquo;s esposiility to deelop thepipeline of new business coming in to the company. This requires a thorough knowledge of the market, the solutions/servicesthe opay a poide, ad of the opay&rsquo;s opetitos. While the exact responsibilities will vary from company tocompany"}, "_id": "8234653"}