{"company_info": {}, "api_data": {"job_location": ["Bareilly", "Varanasi", "Bhagalpur", "Kanpur", "Faizabad", "Lucknow", "Patna", "Muzzafarpur", "Agra", "Aligarh"], "jd_id": "8250017", "job_keywords": ["operations", " tourism", " ticketing", " english", "customer", " skills", " tour", " service"], "job_industry": "Travel / Tourism", "company_name": "Somya Info Edge Services Private Limited Hiring For Panther Eye Pvt. Ltd", "job_experience": "0 to 2 Yrs", "job_title": "Urgent Requirement for Tour Consultant"}, "other_details": {"Other Skills:": ["customer", "skills", "tour", "service"], "Department:": ["Tour / Travel Guide"], "Industry:": ["Travel / Tourism"], "Skills:": ["operations", "tourism", "ticketing", "english"]}, "topbox_information": {"salary_information": "Rs 2.0  - 4.5 Lakh/Yr"}, "jd_information": {"description": "Travel Agents provide an intermediary service between clients and suppliers to plan leisure and business travel arrangements.These services may range from straightforward tasks such as booking direct flights to coordinating entire travel experiences including itineraries, accommodation, transport, tours and visas.As a Travel Agent, your key responsibility will be to simplify the process of arranging travel for your clients using your knowledge of the industry. Travel Agents provide expert advice, secure the best value options for their clients, and ensure they have a positive travel experience.Travel Agents may specialise in a particular field such as domestic travel, international travel, corporate travel, or tours. Specialities can also be destination-specific, usually based on a Travel Agent&rsquo;s familiarity with a particular region.Most Travel Agents work in a sales environment in a retail travel agency, call centre or online agency, and make a commission on the bookings made.Daily tasks for a Travel ConsultantAs a Travel Agent, your daily tasks will include:Liaising with clients in person, over the phone or via email to discuss their travel requirements.Advising clients on suitable options for domestic or international destinations, tours, accommodation, transport, insurance and fares.Preparing customised itineraries to suit the clients&rsquo; preferences and budget.Making and confirming bookings, often via a Global Distribution System (computerised central reservation system).Issuing tickets or relevant documents.Providing up to date advice on travel regulations including visa and medical requirements, baggage limits, safety and local customs.Modifying existing bookings to suit a change in clients&rsquo; circumstances.Researching destinations and keeping up to date with travel industry news.Ongoing training with other team members and management.&nbsp;To learn about the skills, traits and training needed to be a successful Travel Agent, read our tips on&nbsp;how to become a Travel Agent."}, "_id": "8250017"}