{"company_info": {"Company Description": "Arsenius Skill Capital (ASC) is a Management Consulting firm and a No. 1 choice for permanent results that top management prefers. We provide turnkey solution from initial screening to synergy realization. We are ardent believer of guiding and finding values across boundaries, developing insight to act upon, energizing and motivating team to deliver and to sustain success.We are a brain child of a team of young aspiring entrepreneurs with in-depth industry specific knowledge who have joined hands to cater to the Management needs for various industries. With our years of experience and research driven methodology in diverse industry vertical we have developed skills to understand the business in depth, thus able to provide unmatched solution designs. Our team works round the clock to ensure satisfactory deliverables.Our Mission “Improvising Efficiency”Our Values Integrity, Customer Centricity, Accountability &amp; Innovation", "Email": "angee@arseniusskillcapital.com", "Company Name": "Arsenius Skill  Capital Hiring For Travel &amp; Toursim", "Telephone": "7506178102"}, "api_data": {"job_location": ["Bangalore", "Chennai", "Mumbai City", "Delhi"], "jd_id": "8258085", "job_keywords": ["operations", " forex", " ticketing", " iata", " management", " galileo", " tourism", "customer", " corporate travel desk", "  iata", " relationship", " reservations", " travel", " corporate travel", " desk", " implant"], "job_industry": "Travel / Tourism", "company_name": "Arsenius Skill  Capital Hiring For Travel & Toursim", "job_experience": "1 to 3 Yrs", "job_title": "Corporate Travel Desk Execuitves"}, "other_details": {"Other Skills:": ["customer", "corporate travel desk", "iata", "relationship", "reservations", "travel", "corporate travel", "desk", "implant"], "Department:": ["Reservation / Ticketing"], "Industry:": ["Travel / Tourism"], "Skills:": ["operations", "forex", "ticketing", "iata", "management", "galileo", "tourism"]}, "topbox_information": {"salary_information": "Rs 1.5  - 4.0 Lakh/Yr"}, "jd_information": {"description": "Arsenius Skill Capital is for a Globally Renowned Travel MNCCompany Profile: We are Hiring for a Reputed Multi National Travel Company catering to Domestic and International Clients.Positions: Corporate Travel Desk ExecutivesDay Shift OnlyLocation: Mumbai / Chennai / Delhi / Bangalore&middot; Managing overall travel related operations / functions (Book &amp; Deliver Travel requirements) at the&nbsp;Corpoarte&nbsp;location as per TAT.&middot; Maintain SOP at the&nbsp;Corporate&nbsp;desk&middot; Bill Submissions &amp; MIS requirements&middot; Proper Co-ordinate for Visa related work with back office/branch/CTS immegration team.&middot; Constantly working on Customer relationship management, being the most sensitive&nbsp;&middot; Maintain PR with Admin/HR and cross sell travel products to maximize business volume&middot; Co-ordinate with client/Corporate/servicing team to collect duly filled signed visa forms with all relevant documents.&nbsp;&middot; Action on different mails from back office/MAA/Finance etc.&middot; Ensure payment collection should be done on time&middot; Co-ordination with CTS key persons on a daily basis regarding different issues like deals,refund/faulty transaction and other issues&nbsp;&middot; Increasing revenue targets, by increasing business volume selling incentive &amp; leisure packages&nbsp;Competencies:&nbsp;&middot; IATA qualified/any other relevant Travel and Tourism qualification would also be an advantage&nbsp;&middot; Multi-skilled and sound job knowledge to handle Domestic /International bookings, Manage Hotel &amp; Car, Visas, Passport assistance, Forex regulatory &amp; other travel related function&middot; Knowledge of Galileo central reservation system&nbsp;Location: MumbaiRemuneration: up to 4 lac .p.a + Perks + Incentives and BenefitsInterested candidates call Angee at 7506178102or send in your resume to angee#arseniusskillcapital.comShare this mail with all who may benefitArsenius Skill Capital ~ Routing Skill to Opportunities"}, "_id": "8258085"}