{"company_info": {"Company Description": "Veedee Solutions LLP“Veedee Solutions LLP”one of the fastest HR Solutions organisation inIndia. Highly skilled professional polyglot, self motivated, goal oriented, committed to contribute with strong conceptualizations,equipped with teamwork, and solutions-driven educational &amp; professional with a strong background of recruiting and counselling services,expanding business towards gaining targeted objectives of hospitality of low-skilled as well as high-skilled recruitment’s for all fields of the corporate day for 1st world and 2nd world i.e. Gulf Countries, Middle east, Central Asia, Africa, North America holding its regional and associated offices across the globe since 2012 in Mumbai, India.Experienced and enriched business-person working towards “OVERSEAS MANPOWER RECRUITMENT’S” believing on humanity, equipped and ready to serve with 24 hours across the India the right candidates, examining the educational &amp; professional approach as well as conducting the interviews undertaking the modernistic communication instruments to meet the requirements of the company seeking the staff with the art of excellent coaching and training skills while holing the Motto of TRUST from the day 1st for all future times.", "Email": "hr1@veedeesolutions.in", "Company Name": "Veedee Solutions LLP", "Telephone": "9029164516"}, "api_data": {"job_location": ["Mumbai City"], "jd_id": "8265085", "job_keywords": ["urgent opening for ladies driver for mumbai international airport."], "job_industry": "Travel / Tourism", "company_name": "Veedee Solutions LLP", "job_experience": "2 to 7 Yrs", "job_title": "Urgent Opening for ladies Driver   for Mumbai international Airport."}, "other_details": {"Other Skills:": ["urgent opening for ladies driver for mumbai international airport."], "Industry:": ["Travel / Tourism"], "Department:": ["Tour / Travel Guide"]}, "topbox_information": {"salary_information": "Rs 2.0  - 3.0 Lakh/Yr"}, "jd_information": {"description": "Dear Candidates,Greetings from Veedee Solutions LLP!!!We are having Urgent Opening for &ldquo;ladies Driver \" for Mumbai international Airport.It&rsquo;s a best opportunity to those who are searching a job in&nbsp;international Airport. Interested candidate&nbsp;Kindly give a call on +91-9082912950Post :-ladies Driver .Experience :- 1 to 5 years Experience.Work Location :- Andheri&nbsp;international AirportSalary :- Negotiable.Process of Selection Face to Face interview.If you are interested kindly email us the documents on below mentioned email id: vivaan.s@veedeesolutions.in&nbsp;1. Update CV.&nbsp;&nbsp;******* Kindly Note For any Confusion you can call on the this number +91-9082912950************** Interested candidates email us on&nbsp;vivaan.s@veedeesolutions.in******Also share with friends &amp; relatives******&nbsp;Thank you!&nbsp;www.veedeesolutions.in&nbsp;Thanks &amp; Regards|&nbsp;HR Recruiter |&nbsp;Veedee Solutions LLP.&nbsp;&nbsp;Seema ShikareF-104, B Wing, Express Zone, Off. Western Express Highway, Malad (E) Mumbai - 400097.(D)&nbsp;+91 2265552776&nbsp;&nbsp;www.veedeesolutions.in&nbsp;&nbsp;INNOVATIVE SOLUTIONS FOR BUSINESS WORLDWIDE&nbsp;"}, "_id": "8265085"}