{"company_info": {"Company Description": "Streamsource Services is the leading executive search, recruitment, organizational development and consulting company with a global focus on the Human Resources Management.&nbsp;", "Email": "jobs@streamsourceindia.com", "Company Name": "Streamsource Services.", "Telephone": "9916906580"}, "api_data": {"job_location": ["Bangalore"], "jd_id": "8267171", "job_keywords": ["tourism", " tours", " sales", "international travel", " travel sales", " travel", " outbound tours", " international tours", " fit specilaist", " customized tours sales"], "job_industry": "Travel / Tourism", "company_name": "Streamsource Services.", "job_experience": "2 to 4 Yrs", "job_title": "FIT Specialist(2-4 Yrs.Exp.in Customized Tours Sales)-Bangalore"}, "other_details": {"Other Skills:": ["international travel", "travel sales", "travel", "outbound tours", "international tours", "fit specilaist", "customized tours sales"], "Department:": ["Sales / BD"], "Industry:": ["Travel / Tourism"], "Skills:": ["tourism", "tours", "sales"]}, "topbox_information": {"salary_information": "Rs 4.0  - 5 Lakh/Yr"}, "jd_information": {"description": "Dear Job Seeker,&nbsp;We are looking for the FIT Specialist in Koramangala (5th Block) &amp; Jayanagar (3rd Block) - Bangalore&nbsp;Please find below the Company Profile &amp; Job Description for FIT Specialist.&nbsp;Designation / Position:&nbsp;FIT Specialist&nbsp;Number of Openings: 2&nbsp;Company Profile (1001 &ndash; 5000 Employees): We are the longest established travel company in the world. Its distinguished history began in 1758 when it was appointed as general agents to the regiment of Foot Guards in India under the command of Lord Ligonier. The worldwide offices are located in UK, USA, Japan, Russia, Singapore and Dubai. It has associate offices in Germany, Italy, Spain, South Africa, Sweden and Australia.Job Description / Duties &amp; Responsibilities:&nbsp;&nbsp;Dept. - FranchiseeExposure -&nbsp;Should have experience in Customized Tours Sales for destinations like US, Europe, Australia, NZ, South Africa, Dubai, Far East.Communication skills -&nbsp;Good communication skills with mandatory knowledge in English &amp; local languages.Notice Period -&nbsp;Immediate joinees preferred, if not then max. up to 1 month.Preferred Qualities:&nbsp;Dept. &ndash; FranchiseeNotice Period -&nbsp;Immediate joinees preferred, if not then max. up to 1 month.Skills Must Have:&nbsp;Good / Excellent communication skillsPresentableEnthusiasticConvincing skillsGood computer knowledge (MS-Office tools, Internet)&nbsp;Relevant Experience: 2 &ndash; 4 Years as FIT Specialist&nbsp;Salary Offered: Between 4.0 lac - 5.01 lac pa / Depends on the experience, performance &amp; competency level of the candidates.&nbsp;Job Location- Koramangala (5th Block) &amp; Jayanagar (3rd Block) - Bangalore&nbsp;Education - Any Graduate&nbsp;Industry&nbsp;&ndash;&nbsp;Tours &amp; Travel&nbsp;Functioning&nbsp;Area&nbsp;&ndash;&nbsp;Sales &amp; Marketing&nbsp;Mandatory Languages: English, (Optional, Hindi, Kannada, Tamil, Telugu, Malayalam)&nbsp;Age Bracket&nbsp;&ndash; Below 30 Years&nbsp;Office Timing: 9:00 AM to 5:00 PM&nbsp;Working Days: 6 Days a Week (Full Time Job).&nbsp;Gender : Male / Female&nbsp;Two Wheeler Preferred&nbsp;Notice Period: Immediate Joiners&nbsp;Please apply if you are interested.&nbsp;Note: It is an urgent requirement. Male / female candidates with relevant experience of 2 - 4 Years as FIT Specialist only can apply for the above job. Please also share your updated resume / cv.Please fill the below mandatory details:Availability for F2F Interview:Total Years of Experience as FIT Specialist :Relevant Experience as FIT Specialist :Current CTC:Notice Period:Qualification:Age:Own Two Wheeler: Yes / No:Languages Known:Current Location In Bangalore:&nbsp;Streamsource Services,&nbsp;jobs@streamsourceindia.com&nbsp;9916906580"}, "_id": "8267171"}