{"company_info": {"Company Description": "VMAKE VISAS PROVIDE (ORAS) “OVERSEAS RESUME ADVERTISEMENT SERVICES” IN CANADA ,AUSTRALIA.ORAS-VMAKE VISAS PROVIDE (ORAS) “OVERSEAS RESUME ADVERTISEMENT SERVICES”MIDDAL EAST COUNTRY, CANADA, AUSTRALIA, UK, USA, NEW ZEALAND, NORWAY,DENMARK AND REST OF THE WORLD.ANDFOR AUSTRALIA PERMANENT RESIDENCY-HOT OCCUPATIONS WIDE OPEN IN AUSTRALIA FOR IMMIGRATION FOR SKILLED PROFESSIONALS.ANDFOR CANADA PERMANENT RESIDENCY-CANADA FEDERAL SKILLED MIGRATION.ANDVISA IMMIGRATION CONSULTANCY SERVICES -BUSINESS VISA, INVESTMENT VISA , WORK &amp; WORK PERMIT VISA, VISIT &amp; VISITORS VISA, DEPENDENT VISA, TOURIST VISA, SPOUSE VISA, STUDY VISA.(PERMANENT RESIDENCY), CANADA, AUSTRALIA, UK, USA, NEW ZEALAND, NORWAY DENMARK AND SINGAPORE,ANDSTUDY ABROAD-STUDY ABROAD CONSULTANTS,STUDY ABROAD COUNSELORS.CANADA, AUSTRALIA, UK, USA, NEW ZEALAND, NORWAY,  DENMARK &amp; SINGAPORE.VMAKE VISAS(Immigrant Immigrates with Vmake Visas )VMAKE VISAS PVT. LTD.", "Email": "hrpune@vmakevisas.in", "Company Name": "VMAKE Visas Pvt Ltd.", "Telephone": "7030939000"}, "api_data": {"job_location": ["Pune"], "jd_id": "8272085", "job_keywords": ["communication", " documentation", "customer", " visa processing", " case processing", " service", " visa counselling", " travel process", " document processing", " visa assistance", " international ticketing"], "job_industry": "Travel / Tourism", "company_name": "VMAKE Visas Pvt Ltd.", "job_experience": "0 to 1 Yr", "job_title": "Walk in for Visa documentation (Females only)"}, "other_details": {"Other Skills:": ["customer", "visa processing", "case processing", "service", "visa counselling", "travel process", "document processing", "visa assistance", "international ticketing"], "Department:": ["Tour / Travel Guide", "Tour / Travel Management"], "Industry:": ["Travel / Tourism"], "Skills:": ["communication", "documentation"]}, "topbox_information": {"salary_information": "Rs 1.5  - 2.5 Lakh/Yr"}, "jd_information": {"description": "As a Documentation Executive you have to ensure completion of all relevant visa and immigration documents are received within the time frame.&nbsp;As a Documentation Executive you have to ensure that all of the information provided by the client is accurate and correct&nbsp;As a Documentation Executive you have to ensure there are no communication gaps between the company and the client&nbsp;As a Documentation Executive you have to ensure you provide good customer service to the client.&nbsp;Interview all clients; deal with all their questions and queries&nbsp;Calling prospective clients and making follow ups on daily basis.&nbsp;When required To talk to the client through calls, emails and face to face&nbsp;&nbsp;"}, "_id": "8272085"}