{"company_info": {"Email": "hrpune@vmakevisas.in", "Company Name": "VMAKE Visas Pvt Ltd.", "Telephone": "7030939000"}, "api_data": {"job_location": ["Delhi"], "jd_id": "8272055", "job_keywords": ["marketing", " b2b", " management", " sales", " servicing", "development", " campaign", " business", " brand", " planning", " communications", " client", " promotion", " channel"], "job_industry": "Travel / Tourism", "company_name": "VMAKE Visas Pvt Ltd.", "job_experience": "0 to 2 Yrs", "job_title": "Immediate opening for Sales and Marketing (Females only)"}, "other_details": {"Other Skills:": ["development", "campaign", "business", "brand", "planning", "communications", "client", "promotion", "channel"], "Department:": ["Sales / BD"], "Industry:": ["Travel / Tourism"], "Skills:": ["marketing", "b2b", "management", "sales", "servicing"]}, "topbox_information": {"salary_information": "Rs 1.5  - 2.5 Lakh/Yr"}, "jd_information": {"description": "Dear Candidate,Vmake Visas pvt. Ltd. (Delhi) the Immigration Consulting firm is looking for enthusiastic full-time Immigration Consultants.- Responsible for meeting monthlysalestargets by converting warm leads and enquiries to prospects and sell individual and corporate cases performing the necessary checks to ensure full client eligibility.- To talk to the client through calls, emails and face to face discussion understand the clients profile and visa requirement and provide appropriate solutions based on client eligibility.- Ensure all leads, potentials and cases taken are managed according to sales management processes and procedures.- Research and develop possible new services to be offered to clients&nbsp;- Maintain the updated knowledge of the competitors&rsquo; products, services and prices and also keeps abreast of changes in immigration&nbsp;laws that affect our area of business.- Delivery of outstanding client service which is a paramount to not only the success of a case but is intrinsic to the culture and values of the organization.&nbsp;- Ensure that all service levels agreed with the clients are achieved and improved upon where possible.- Manage client feedback and complaints proactively in line with organization&rsquo;s procedures.- Develop a solid understanding of all aspects of the services provided by organization ensuring that you are able to complete all tasks effectively- Understand and adhere to all policies and procedures of the organization at all times.&nbsp;Eligibility criteria:Good English communication+minimum graduationSalary:&nbsp;Starting from&nbsp;1.5 lakh to 2.5 lakh+ incentiveDay Shift Job:9;30 am to&nbsp;6:30 pm&nbsp;,6 days working(Monday to&nbsp;Saturday).&nbsp;Note: This opening is for only female candidateslocation:&nbsp;Vmake Visas Pvt. Ltd.office&nbsp;No.305, 3rd Floor, Sheetla House, Building No 73-74Nehru Place, New Delhi - 110019Contact:&nbsp;9999735096email: hrdelhi@vmakevisas.in&nbsp;"}, "_id": "8272055"}