{"company_info": {"Company Description": "Mabyn Communication Pvt. Ltd. is a multi-tasking integrated marketing services agency in Delhi, providing its services as an outstanding event management company. We are a new and dynamic company, established by a team of young, innovative, talented, and energetic professionals, which have a vast experience in the field of event management. MABYN was established with an aim to deliver highest level of creativity and authenticity to this field. We work dedicatedly to offer clients highest quality services at affordable prices. Be it any event, we take care of everything and make the best arrangements accordingly.Having acquired an international image for its practicality and honesty, Mabyn Communication Pvt. Ltd. has emerged as a major Placement Consultancy in Delhi. The wide range of services, offered by the company, includes Data Processing Services, Data Entry Services and Manpower Outsourcing Services and the company also offers Services for Human Resources Outsourcing. Added to that, the company has been helping its client organizations with the finer nuances of the HR, Finance and many other processes.Mabyn Communication Pvt. Ltd. is a highly distinguished IT/BPO company running under the efficient guidance as well as the collaborative brilliance of the Directors Mr. Mayank and Mr. Umesh Kumar. Founded in the year 2013, the company has been the major force to reckon whenever the talk is centered on the offshore outsourcing solutions and services. we have been the key to the clients’ capability of ensuring efficient business management in terms of handling information as well as the associated processes. Reaching out to the right user with the right content and ensuring that the timing is right too has always been our forte.Our clients have had the ability to speed up their time-to-market, which has resulted in higher levels of customer satisfaction. With the backing our services and assistance, our clients can enhance their respective supply chain efficiencies which has contributed crucially to the reduced operating costs as well as numerous other overall competitive advantages. We have been serving reputed entities from diverse industrial sectors such as Insurance, BPO, HR, Finance, Engineering, Pharmaceuticals, Event Management, Sales &amp; Marketing, FMCG, Telecom/Technology/ISP, Manufacturing/Operations, Export/Import, IT/ITES, Medical/Health Care, Education/Training, Retail, Construction, Tour &amp; Travel, Automobile, Banking, Technical and Academic/Teaching.", "Email": "hr@mabyncommunication.co.in", "Company Name": "Mabyn Communication Pvt. Ltd.", "Telephone": "8920618788"}, "api_data": {"job_location": ["Gurugram", "Delhi"], "jd_id": "8278293", "job_keywords": ["communication", "customer", " office", " service", " skills", " ms", " voice"], "job_industry": "Travel / Tourism", "company_name": "Mabyn Communication Pvt. Ltd.", "job_experience": "0 to 1 Yr", "job_title": "Customer Care Executive"}, "other_details": {"Other Skills:": ["customer", "office", "service", "skills", "ms", "voice"], "Department:": ["Finance / Accounts / Tax", "Customer Service (International)"], "Industry:": ["Travel / Tourism"], "Skills:": ["communication"]}, "topbox_information": {"salary_information": "Rs 2.5  - 3.0 Lakh/Yr"}, "jd_information": {"description": "WE ARE HIRING FOR INTERNATIONAL BASED ORGANISATION LOCATION WOULD BE GURGAON. ITS TRAVEL&nbsp; BASED PROCESS (BLANDED AND BACKEND) SALARY WOULD BE 26K"}, "_id": "8278293"}