{"company_info": {"Company Description": "Arsenius Skill Capital (ASC) is a Management Consulting firm and a No. 1 choice for permanent results that top management prefers. We provide turnkey solution from initial screening to synergy realization. We are ardent believer of guiding and finding values across boundaries, developing insight to act upon, energizing and motivating team to deliver and to sustain success.We are a brain child of a team of young aspiring entrepreneurs with in-depth industry specific knowledge who have joined hands to cater to the Management needs for various industries. With our years of experience and research driven methodology in diverse industry vertical we have developed skills to understand the business in depth, thus able to provide unmatched solution designs. Our team works round the clock to ensure satisfactory deliverables.Our Mission “Improvising Efficiency”Our Values Integrity, Customer Centricity, Accountability &amp; Innovation", "Email": "brinelle@arseniusskillcapital.com", "Company Name": "Arsenius Skill  Capital Hiring For a Travel MNC", "Telephone": "7506178105"}, "api_data": {"job_location": ["Mumbai City"], "jd_id": "8278577", "job_keywords": ["communication", " tourism", " sales", "travel", " skills", " tour packages", " travel sales", " holiday packages"], "job_industry": "Travel / Tourism", "company_name": "Arsenius Skill  Capital Hiring For a Travel MNC", "job_experience": "0 to 5 Yrs", "job_title": "Work from home - Holiday Sales Consultant"}, "other_details": {"Other Skills:": ["travel", "skills", "tour packages", "travel sales", "holiday packages"], "Department:": ["Tour / Travel Management"], "Industry:": ["Travel / Tourism"], "Skills:": ["communication", "tourism", "sales"]}, "topbox_information": {"salary_information": ""}, "jd_information": {"description": "An opportunity to work from home for a reputed Travel MNCProfile: Holiday Sales ConsultantSalary: Commission basedTraining: One week training will be providedRequirement:&middot; Candidate must be from Mumbai only&middot; Good communication skills&middot; Internet connection at home&middot; Basic geographical knowledge&middot; 18 to 50 years of age&nbsp;Job Responsibilities:&middot; Coordinate with clients for holiday packages&middot; Understand clients&rsquo; requirement and suggest holiday packages based on their requirement&middot; Maintain a good relationship with them&nbsp;Interested candidates may share their resumes at brinelle@arseniusskillcapital.com or call on 7506178105.Kind Regards,Brinelle Fonseca: 7506178105"}, "_id": "8278577"}