{"company_info": {"Company Description": "Best way HR solutions is one of the specialist Placement Consultancy in India and abroad with a focus on providing Executive Search, Headhunting, Permanent Staffing, Temporary staffing and HR Services Outsourcing . We cater to manpower requirements of the various sectors at junior, middle and senior management levels–National and International staffing. In our international staffing we recruiter Doctors in Middle East and Malaysia. We assist our Clients in creating and developing their human capital by providing top quality HR services with international standards. We strive to be the first choice in the supply of staffing solutions to local and international businesses through partnership with clients and fulfilling the expectations of our candidatesOur promoter director has rich experience of more than 15 years in various corporates, with his able guidance Our young and proficient team", "Email": "satya.pooja@gmail.com", "Company Name": "[Company Hidden]"}, "api_data": {"job_location": ["Bangalore"], "jd_id": "8284583", "job_keywords": ["negotiation", " marketing", " target", " sales", "development", " corporate", " direct", " business"], "job_industry": "Travel / Tourism", "company_name": "[Company Hidden]", "job_experience": "1 to 2 Yrs", "job_title": "wanted corporate sales executive"}, "other_details": {"Other Skills:": ["development", "corporate", "direct", "business"], "Department:": ["Sales / BD"], "Industry:": ["Travel / Tourism"], "Skills:": ["negotiation", "marketing", "target", "sales"]}, "topbox_information": {"salary_information": "Rs 2.5  - 3.0 Lakh/Yr"}, "jd_information": {"description": "Executive Sales BangaloreCOMPANY - Smassh entertainment pvt ltd.salary - 2.5 to 3 LacJob profileField Trip to assigned areas for developing the Business through salesTarget Chasing negotiation and relationship buildingShould have relevant database of potential clientsAny graduateskindly revert back with your updated resume immediately if you interested for this job"}, "_id": "8284583"}