{"company_info": {"Company Description": "VMAKE VISAS PROVIDE (ORAS) “OVERSEAS RESUME ADVERTISEMENT SERVICES” IN CANADA ,AUSTRALIA.ORAS-VMAKE VISAS PROVIDE (ORAS) “OVERSEAS RESUME ADVERTISEMENT SERVICES”MIDDAL EAST COUNTRY, CANADA, AUSTRALIA, UK, USA, NEW ZEALAND, NORWAY,DENMARK AND REST OF THE WORLD.ANDFOR AUSTRALIA PERMANENT RESIDENCY-HOT OCCUPATIONS WIDE OPEN IN AUSTRALIA FOR IMMIGRATION FOR SKILLED PROFESSIONALS.ANDFOR CANADA PERMANENT RESIDENCY-CANADA FEDERAL SKILLED MIGRATION.ANDVISA IMMIGRATION CONSULTANCY SERVICES -BUSINESS VISA, INVESTMENT VISA , WORK &amp; WORK PERMIT VISA, VISIT &amp; VISITORS VISA, DEPENDENT VISA, TOURIST VISA, SPOUSE VISA, STUDY VISA.(PERMANENT RESIDENCY), CANADA, AUSTRALIA, UK, USA, NEW ZEALAND, NORWAY DENMARK AND SINGAPORE,ANDSTUDY ABROAD-STUDY ABROAD CONSULTANTS,STUDY ABROAD COUNSELORS.CANADA, AUSTRALIA, UK, USA, NEW ZEALAND, NORWAY,  DENMARK &amp; SINGAPORE.VMAKE VISAS(Immigrant Immigrates with Vmake Visas )VMAKE VISAS PVT. LTD.", "Email": "hrdelhi@vmakevisas.in", "Company Name": "VMAKE Visas Pvt Ltd.", "Telephone": "011-48414141"}, "api_data": {"job_location": ["Delhi"], "jd_id": "8285637", "job_keywords": ["sales", " visa counselor", "  business development"], "job_industry": "Travel / Tourism", "company_name": "VMAKE Visas Pvt Ltd.", "job_experience": "0 to 2 Yrs", "job_title": "immigration Consultant"}, "other_details": {"Other Skills:": ["sales", "visa counselor", "business development"], "Industry:": ["Travel / Tourism"], "Department:": ["Sales / BD"]}, "topbox_information": {"salary_information": "Rs 2.5  - 3.5 Lakh/Yr"}, "jd_information": {"description": "1. Helping Individuals Who are wanting who are interested in going abroad by attending to customer walkins / emailers / tele etc etc to reallocate Internationally2. Help the Common immigration and visa aspirants and guide them through the difficult immigration procedures and processes in a better and a fruitful manner3. The Immigration Consultant must interview all clients and ensure that the client is suitable for the process4. Providing counseling and customer service to the prospects/clients over phone or in person5. It will be the in-house profile6. Calling prospective clients and making follow ups on daily basis7. Responsible for meeting monthly sales targets by converting warm leads and enquiries to prospects clients8. Working on Filtered leads9. Work As a Business Development Consultant and a Counselor10. Track Payments and deadlines11. Experience From the Same Field Must&nbsp;"}, "_id": "8285637"}