{"company_info": {"Company Description": "Amara Resort is the perfect place to experience Manali and its surroundingsAmara Resorts, Manali a Luxurious resort invites you to enjoy the World Class Amenities, Spread over 3,000 Square Yard covered with orchards and fields. Although not away from the town, it is secluded enough to offer sufficient privacy and peace to its guests. Located in Kullu Nagar, Manali Road, it is surrounded with beautiful Mountains &amp; Lush Greenery. Each rooms window and balcony offer a breath-taking &amp; picturesque view to the nature lovers.Our main aim is to provide the world class comfort and privacy to our guests. You can take a walk in the beautiful garden blossoming with flowers and admire its landscapes scenic beauty. The multi-cuisine restaurant serves mouth-watering food that tickles the taste buds of the diners. Buffet meal is served at the restaurant in Indian, Chinese and other cuisines to avail from.The Resort provides 24-Hour Front Desk Service with Luggage Storage, Mini Bar, Full Wi-Fi Coverage throughout the Resort and Car Parking to ensure the greatest comfort and to make your stay unforgettable.We offer 2 types of Accommodation Firstly the Comfort Room &amp; Premium Room Categories and Secondly the Cottages, in which we have 2 Bedroom, 3 Bedroom as well as 4 Bedroom Cottages. Along with these Categories, we also have 2 Amara Suites with Private Sit-Out.", "Email": "mohit@amararesorts.in", "Company Name": "Amara Hotels and Resorts Pvt Ltd", "Telephone": "9871001494"}, "api_data": {"job_location": ["Faridabad"], "jd_id": "8303467", "job_keywords": ["accounting", " taxation", " tally", " accounts", "account", " handling"], "job_industry": "Travel / Tourism", "company_name": "Amara Hotels and Resorts Pvt Ltd", "job_experience": "2 to 4 Yrs", "job_title": "Accounts Executive"}, "other_details": {"Other Skills:": ["account", "handling"], "Department:": ["Finance / Accounts / Tax"], "Industry:": ["Travel / Tourism"], "Skills:": ["accounting", "taxation", "tally", "accounts"]}, "topbox_information": {"salary_information": "Rs 1.5  - 2.5 Lakh/Yr"}, "jd_information": {"description": "Accounting Experience and computer knowledge, Tally ERP 9 is must to apply for this position. Job involves daily accounting, preparing GST Return,IT Return,documentation and other accounting work.&nbsp; Job location is N.I.T 2 FARIDABAD Contact 9871001494"}, "_id": "8303467"}