{"company_info": {"Company Description": "DEW VACATIONS Pvt Ltd, is an Tour Operator based in Bhubaneswar and is one of the fastest growing &amp; reputed Travel Agencies in Bhubaneswar with a strong penchant to reach the Horizon. The main activity of thecompanyis to provide all land arrangements, including hotel &amp; services apartment accommodation, transfers, and sightseeing services for clients travelling to all over World. We pride ourselves in our dynamic ability in providing a personal service at incredibly competitive prices, working in partnership with overseas Travel Agents, Tour Operators and Airlines to generate Individual and Group Tour in World. Although we have some fixed programmes, we regularly craft creative and unique arrangements for our clients.DEW VACATIONS Pvt Ltdalways had the aim of providing the tourists a complete package without any hassles when it comes to transportation, accommodation &amp; sightseeing. We offers wide range of Honeymoon tours for destinations covering all the exciting destinations which include beaches, backwaters, hill stations etc. Holiday can be fun, only when you have the correct destination knowledge, can select the right holiday package, avoid hassles and plan your tour accordingly.Our team of specialists, managers, tour guides are multi-lingual, which will help tourists to understand native cultures, handicrafts, history, arts and heritage etc easily. Multiple years of global working experience and a sound understanding of the international travel market, we are familiar with different cultures and -environments and hence act according to them..We believe in transparency in our work, dedication to our services and commitment to our clients.", "Company Name": "DEW VACATIONS PVT.LTD"}, "api_data": {"job_location": ["Bhubaneswar"], "jd_id": "8327728", "job_keywords": ["Sales  ", "   Marketing", ""], "job_industry": "Travel / Tourism", "company_name": "DEW VACATIONS PVT.LTD", "job_experience": "2 to 5 Yrs", "job_title": "Sales & Marketing"}, "other_details": {"Department:": ["Sales / BD"], "Industry:": ["Travel / Tourism"], "Skills:": ["Sales", "Marketing"]}, "topbox_information": {"salary_information": ""}, "jd_information": {"description": ""}, "_id": "8327728"}