{"company_info": {"Company Description": "Somya Info Edge Services Private LimitedSomya Infoedge Private Limited was incorporated under the companies act, 1956. Our company has the reputation of India’s premier on-line internet company in many esteemed fields like Education, Recruitment, Health Mantra, Matrimony, Classified, E-Commerce, Real estate, Social Initiative, IT &amp; Digital Marketing, Social networking, Social concern and other related services. Somya Infoedge Pvt. Ltd. is another star in glazing sector of online service provider. Our only intension is to touch your life with our heart warming and dedicated services and leave you with bundle of joy and happiness. Our core inspiration is the ever expanding market of internet and its huge potentiality. That’s the reason we stepped out in this business and ever since we started the business, our clients have been biggest motivators and supporters, they have acted as the pillars of our strengths. We are the company with the view to tap into the growing Indian internet market, undertakes investments in early stage companies / start-up ventures. Somya Infoedge has established and currently maintains a network of 4 websites as a division of this company, which is summarized here on somyainfoedge.in", "Email": "hrpanthereye@gmail.com", "Company Name": "[Company Hidden]", "Telephone": "9119801809"}, "api_data": {"job_location": ["Lucknow", "Muzzafarpur", "Patna"], "jd_id": "8342017", "job_keywords": ["accounting", " tally", "account", " handling", " tax legal compliance", " concepts"], "job_industry": "Travel / Tourism", "company_name": "[Company Hidden]", "job_experience": "1 to 5 Yrs", "job_title": "Urgent Need an Accountant"}, "other_details": {"Other Skills:": ["account", "handling", "tax legal compliance", "concepts"], "Department:": ["Audit", "Finance / Accounts / Tax"], "Industry:": ["Travel / Tourism"], "Skills:": ["accounting", "tally"]}, "topbox_information": {"salary_information": "Rs 1.5  - 3.0 Lakh/Yr"}, "jd_information": {"description": "Should Prepare Books of AccountsShould Prepare Balance SheetShould have knowledge of all taxesShould file tax returnsGood command over taxes, laws and accountsGood coomand over tally erp9"}, "_id": "8342017"}