{"company_info": {"Company Description": "View Holiday TripPerceived as one of India's finest Travel Organizations, ViewHolidayTrip has come to be known as the finest hotspot for all your travel needs. Only four years of age, View Holiday Trip has exceeded expectations in giving travel related administrations to household and inbound tourists and corporate.Travel organizations, for example, hotels, tour administrators and other industry monsters discover our travel gateway \"View Holiday Trip\" a vital medium to advance their offerings. Be it business or delight we offer a reliable administration and different assets to fulfill your each want. With a time of giving incorporated tour and travel benefits our group can coordinate the ideal excursion to suit your dates and spending plan.A smooth new overhaul with shifted interfaces alongside a top to bottom travel guide can enable you to make your holiday a pleasurable experience. We welcome you to investigate the informal style of this site consummate in serving up a classy read giving you a chance to peruse through effortlessly. Do visit us to figure out how we can rearrange and streamline your travel agenda allowing you to re-find a large number of chances you never knew existed.", "Email": "salesviewholidaystrip@gmail.com", "Company Name": "View Holiday Trip", "Telephone": "9311539278"}, "api_data": {"job_location": ["Delhi"], "jd_id": "8375363", "job_keywords": ["sales-oriented attitude. excellent interpersonal verbal/written communication skills. should have a passion to work under pressure flexible availability including mornings", " must demonstrate an enthusiastic", "  evenings", "  weekends as needed."], "job_industry": "Travel / Tourism", "company_name": "View Holiday Trip", "job_experience": "1 to 3 Yrs", "job_title": "Travel Consultant (executive ) for Domestic Tour Walk in Interview"}, "other_details": {"Other Skills:": ["sales-oriented attitude. excellent interpersonal verbal/written communication skills. should have a passion to work under pressure flexible availability including mornings", "must demonstrate an enthusiastic", "evenings", "weekends as needed."], "Industry:": ["Travel / Tourism"], "Department:": ["Sales Support / MIS"]}, "topbox_information": {"salary_information": "Rs 1.0  - 3.5 Lakh/Yr"}, "jd_information": {"description": "Provide our clients with the best travel (tour) package deals.Making Sales on outbound callsOffer prompt, accurate and courteous service to our clients.Assist our clients with reservations, transfers and changes.Respond to client questions, concerns and billing inquiries with the highest degree of professionalism.Secure new client sales and retention by providing exceptional customer care.Males and Females Required"}, "_id": "8375363"}