{"company_info": {"Company Description": "Established in February 2013, Times Quest Services Pvt.Ltd. is today ranked as the leading provider of travel services in India. Our website timesqholiday.com has emerged as one of the most trusted travel brand in India, Outstanding performance as a Domestic Tour Operator in India and as well as an Inbound Tour Operator over the years.", "Email": "timesquestservices@gmail.com", "Company Name": "Times Quest Services Pvt Ltd", "Telephone": "9821385140"}, "api_data": {"job_location": ["Delhi"], "jd_id": "8384363", "job_keywords": ["marketing", " research", "search engine marketing", " lead", " business development", " generation", " lead management", " marketing analytics", " online lead generation", " content strategy", " social media", " digital marketing"], "job_industry": "Travel / Tourism", "company_name": "Times Quest Services Pvt Ltd", "job_experience": "3 to 5 Yrs", "job_title": "Urgent Hiring for Lead Gen Executive in Backend Profile. Apply Now"}, "other_details": {"Other Skills:": ["search engine marketing", "lead", "business development", "generation", "lead management", "marketing analytics", "online lead generation", "content strategy", "social media", "digital marketing"], "Department:": ["Internet Marketing", "Market Research (MR)"], "Industry:": ["Travel / Tourism"], "Skills:": ["marketing", "research"]}, "topbox_information": {"salary_information": "Rs 1.5  - 3.0 Lakh/Yr"}, "jd_information": {"description": "The Lead Generation Specialist is responsible for prospecting, qualifying and generating new sales leads. This individual will be a highly motivated, self-starter able to identify and develop new business prospects from multiple sources including inbound marketing leads, prospect lists, discovery and individual researchOwn the B2B Pre Sales process of Company.Market mapping with respect to competition and identify new business potential markets.Conduct primary and secondary research to identify new business opportunities.Prepare the lead generation strategy using market mapping, current penetration and sales potential.Create various B2B campaigns as per the agreed strategy to generate interest amongst current and new recruitment portal users.Cultivate new channels like direct marketing channels (Emailing, Telesales etc), Mass media channels, Events, Webinar etc to identify new business leads.Identify the right decision maker and pitch the right solution and warming up the leads.Identify key buying influencers within these prospects to determine budget and timeline.Work with the Regional Sales teams and Sales Leads to develop and grow the sales pipeline to consistently meet quarterly revenue goals.Manage data for new and prospective clients in Company, ensuring all communications are logged, information is accurate and documents are attached.Prepare and analyze sales pipeline reports and dashboards."}, "_id": "8384363"}